Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/BurstSurface.po
Languages: es, fr

source: list; A list of sprite objects representing the subsurfaces or pixels of the explosion. These sprites will be rendered onto the screen.
es: lista; Una lista de objetos sprite que representan las subsuperficies o píxeles de la explosión. Estos sprites serán renderizados en la pantalla.
fr: liste ; Une liste d'objets sprite représentant les sous-surfaces ou les pixels de l'explosion. Ces sprites seront rendus à l'écran.

source: unsigned char, optional; The blending mode to use when rendering the sprites. The default is 0 (no blending). A non-zero value will apply the specified blend mode (e.g., additive blending).
es: unsigned char, opcional; El modo de mezcla a usar al renderizar los sprites. El valor predeterminado es 0 (sin mezcla). Un valor distinto de cero aplicará el modo de mezcla especificado (por ejemplo, mezcla aditiva).
fr: unsigned char, optionnel ; Le mode de fusion à utiliser lors du rendu des sprites. La valeur par défaut est 0 (pas de fusion). Une valeur non nulle appliquera le mode de fusion spécifié (par exemple, fusion additive).

source: **Returns** void; This function updates the screen by rendering the sprites based on the specified frame and blending settings.
es: **Returns** void; Esta función actualiza la pantalla renderizando los sprites según el fotograma y los ajustes de mezcla especificados.
fr: **Retour** void ; Cette fonction met à jour l'écran en rendant les sprites en fonction du cadre spécifié et des paramètres de fusion.

source: Burst a sprite group into memory, creating an explosion effect.
es: Explosión de un grupo de sprites en memoria, creando un efecto de explosión.
fr: Divisez un groupe de sprites en mémoire, créant un effet d'explosion.

source: This function processes a sprite group (`sg_`) and generates an explosion effect by bursting it into memory. The function creates a set of sprites or subsurfaces that are distributed across a specified region of the screen defined by `screenrect`. The number of sprites (`n_`) determines how many parts the sprite group will be divided into. It also supports warnings and automatic configuration for the number of elements to process.
es: Esta función procesa un grupo de sprites (`sg_`) y genera un efecto de explosión al descomponerlo en memoria. La función crea un conjunto de sprites o subsuperficies que se distribuyen a través de una región especificada de la pantalla definida por `screenrect`. El número de sprites (`n_`) determina cuántas partes se dividirá el grupo de sprites. También admite advertencias y configuración automática para el número de elementos a procesar.
fr: Cette fonction traite un groupe de sprites (`sg_`) et génère un effet d'explosion en le divisant en mémoire. La fonction crée un ensemble de sprites ou de sous-surfaces distribuées sur une région spécifiée de l'écran définie par `screenrect`. Le nombre de sprites (`n_`) détermine combien de parties le groupe de sprites sera divisé. Elle prend également en charge les avertissements et la configuration automatique pour le nombre d'éléments à traiter.

source: unsigned int; The number of elements to burst into memory. This controls how many parts the sprite group will be split into for the explosion effect.
es: unsigned int; El número de elementos a descomponer en memoria. Esto controla cuántas partes se dividirá el grupo de sprites para el efecto de explosión.
fr: unsigned int ; Le nombre d'éléments à diviser en mémoire. Cela contrôle combien de parties le groupe de sprites sera divisé pour l'effet d'explosion.

source: object; A pygame.sprite.Group containing the sprites to be processed and exploded into memory.
es: objeto; Un pygame.sprite.Group que contiene los sprites que se procesarán y se descompondrán en memoria.
fr: objet ; Un pygame.sprite.Group contenant les sprites à traiter et diviser en mémoire.

source: **screenrect**:
es: **rectángulo_pantalla**:

source: object; The pygame.Rect object that defines the area of the screen where the explosion effect will be displayed. This helps control the positioning of the sprites within the screen area.
es: objeto; El objeto pygame.Rect que define el área de la pantalla donde se mostrará el efecto de explosión. Esto ayuda a controlar el posicionamiento de los sprites dentro del área de la pantalla.
fr: objet ; L'objet pygame.Rect qui définit la zone de l'écran où l'effet d'explosion sera affiché. Cela aide à contrôler le positionnement des sprites dans la zone de l'écran.

source: **warn_**:
es: **advertencia_**:

source: bint, optional; A flag to trigger warnings if certain conditions are met (e.g., if the sprite group is too large to process efficiently). Defaults to False.
es: bint, opcional; Una bandera para activar advertencias si se cumplen ciertas condiciones (por ejemplo, si el grupo de sprites es demasiado grande para procesarse de manera eficiente). El valor predeterminado es False.
fr: bint, optionnel ; Un indicateur pour déclencher des avertissements si certaines conditions sont remplies (par exemple, si le groupe de sprites est trop grand pour être traité efficacement). Par défaut, False.

source: bint, optional; A flag that, if set to True, automatically determines the number of elements to burst based on the sprite group’s size. Defaults to False.
es: bint, opcional; Una bandera que, si se establece en True, determina automáticamente el número de elementos a descomponer según el tamaño del grupo de sprites. El valor predeterminado es False.
fr: bint, optionnel ; Un indicateur qui, s'il est défini sur True, détermine automatiquement le nombre d'éléments à diviser en fonction de la taille du groupe de sprites. Par défaut, False.

source: **Returns** void; This function modifies the memory by creating and storing the explosion effect, which can then be displayed on the screen.
es: **Returns** void; Esta función modifica la memoria creando y almacenando el efecto de explosión, que luego puede ser mostrado en la pantalla.
fr: **Retour** void ; Cette fonction modifie la mémoire en créant et en stockant l'effet d'explosion, qui peut ensuite être affiché à l'écran.

source: Rebuild and render an image from stored memory data.
es: Reconstruir y renderizar una imagen a partir de los datos de memoria almacenados.
fr: Reconstruire et rendre une image à partir des données de mémoire stockées.

source: This function takes a list of vertex data (`vertex_array_`) and reconstructs an image or animation by rendering the stored memory information onto the provided screen. The image is rendered using the specified blending mode (`blend_`). This can be used for reconstructing exploded or fragmented visual effects from previously stored memory.
es: Esta función toma una lista de datos de vértices (`array_de_vertices_`) y reconstruye una imagen o animación al renderizar la información de memoria almacenada en la pantalla proporcionada. La imagen se renderiza utilizando el modo de mezcla especificado (`mezcla_`). Esto puede usarse para reconstruir efectos visuales explotados o fragmentados a partir de la memoria almacenada previamente.
fr: Cette fonction prend une liste de données de vertex (`vertex_array_`) et reconstruit une image ou une animation en rendant les informations de mémoire stockées sur l'écran fourni. L'image est rendue en utilisant le mode de fusion spécifié (`blend_`). Cela peut être utilisé pour reconstruire des effets visuels explosés ou fragmentés à partir de la mémoire précédemment stockée.

source: object; The surface or screen where the rebuilt image will be rendered. Typically, this would be a pygame.Surface representing the display window.
es: objeto; La superficie o pantalla donde se renderizará la imagen reconstruida. Típicamente, esto sería un pygame.Surface que representa la ventana de visualización.
fr: objet ; La surface ou l'écran où l'image reconstruite sera rendue. Typiquement, il s'agira d'un pygame.Surface représentant la fenêtre d'affichage.

source: list; A list containing the vertex data (e.g., pixels, sprite blocks, or fragmented image parts) used to reconstruct the image. This data is used to render the final visual output on the screen.
es: lista; Una lista que contiene los datos de vértices (por ejemplo, píxeles, bloques de sprites o partes de imágenes fragmentadas) usados para reconstruir la imagen. Estos datos se utilizan para renderizar la salida visual final en la pantalla.
fr: liste ; Une liste contenant les données de vertex (par exemple, les pixels, les blocs de sprite ou les parties d'image fragmentées) utilisées pour reconstruire l'image. Ces données sont utilisées pour rendre la sortie visuelle finale sur l'écran.

source: unsigned char, optional; The blend mode to be used when rendering the image. A blend mode of 0 typically represents no blending (normal mode), while other values may represent different additive or subtractive blending effects. Defaults to 0 (no blending).
es: unsigned char, opcional; El modo de mezcla que se usará al renderizar la imagen. Un modo de mezcla de 0 normalmente representa sin mezcla (modo normal), mientras que otros valores pueden representar diferentes efectos de mezcla aditiva o sustractiva. El valor predeterminado es 0 (sin mezcla).
fr: unsigned char, optionnel ; Le mode de fusion à utiliser lors du rendu de l'image. Un mode de fusion de 0 représente typiquement aucune fusion (mode normal), tandis que d'autres valeurs peuvent représenter différents effets de fusion additive ou soustractive. Par défaut, 0 (pas de fusion).

source: **Returns** void; This function modifies the screen object by rendering the rebuilt image from the provided vertex data without returning a value.
es: **Returns** void; Esta función modifica el objeto de pantalla al renderizar la imagen reconstruida a partir de los datos de vértices proporcionados sin devolver un valor.
fr: **Retour** void ; Cette fonction modifie l'objet écran en rendant l'image reconstruite à partir des données de vertex fournies sans renvoyer de valeur.

source: Explode a surface into multiple subsurfaces or pixels and apply random projections.
es: Explotar una superficie en múltiples subsuperficies o píxeles y aplicar proyecciones aleatorias.
fr: Faire exploser une surface en plusieurs sous-surfaces ou pixels et appliquer des projections aléatoires.

source: This function takes a single surface (`image_`) and splits it into multiple blocks or individual pixels, based on the specified block size, number of rows, and columns. Each resulting block or pixel is assigned a random angle of projection, giving the effect of the surface being 'exploded' into separate pieces. The pieces are added to the specified sprite group (`group_`) for further manipulation or rendering.
es: Esta función toma una única superficie (`imagen_`) y la divide en múltiples bloques o píxeles individuales, según el tamaño del bloque especificado, el número de filas y columnas. A cada bloque o píxel resultante se le asigna un ángulo aleatorio de proyección, dando el efecto de que la superficie se está 'explotando' en piezas separadas. Las piezas se agregan al grupo de sprites especificado (`grupo_`) para su posterior manipulación o renderizado.
fr: Cette fonction prend une seule surface (`image_`) et la divise en plusieurs blocs ou pixels individuels, en fonction de la taille des blocs, du nombre de lignes et de colonnes spécifiés. Chaque bloc ou pixel résultant se voit attribuer un angle de projection aléatoire, donnant l'effet de la surface éclatant en morceaux séparés. Les morceaux sont ajoutés au groupe de sprites spécifié (`group_`) pour une manipulation ou un rendu ultérieur.

source: **render_**:
es: **renderizado_**:

source: object; The 2D rendering context used for rendering the exploded pieces. Typically a pygame.Surface or similar rendering context.
es: objeto; El contexto de renderizado 2D utilizado para renderizar las piezas explotadas. Típicamente un pygame.Surface o un contexto de renderizado similar.
fr: objet ; Le contexte de rendu 2D utilisé pour rendre les morceaux éclatés. Typiquement un pygame.Surface ou un contexte de rendu similaire.

source: **image_**:
es: **imagen_**:

source: object; The pygame.Surface to be split into smaller blocks or pixels. This image will be 'exploded' into multiple parts based on the block size.
es: objeto; El pygame.Surface que se dividirá en bloques o píxeles más pequeños. Esta imagen será 'explotada' en múltiples partes según el tamaño del bloque.
fr: objet ; Le pygame.Surface à diviser en petits blocs ou pixels. Cette image sera 'explosée' en plusieurs parties en fonction de la taille des blocs.

source: **group_**:
es: **grupo_**:

source: object; A pygame.sprite.Group that will contain the resulting pieces (subsurfaces or pixels) after the explosion. Each part of the exploded image will be added as a sprite to this group.
es: objeto; Un pygame.sprite.Group que contendrá las piezas resultantes (subsuperficies o píxeles) después de la explosión. Cada parte de la imagen explotada se agregará como un sprite a este grupo.
fr: objet ; Un pygame.sprite.Group qui contiendra les morceaux résultants (sous-surfaces ou pixels) après l'explosion. Chaque partie de l'image éclatée sera ajoutée en tant que sprite à ce groupe.

source: **block_size_**:
es: **tamaño_bloque_**:

source: int; The size of each block or pixel in the explosion. This defines the width and height of each subsurface or pixel entity. A block size of 1 will result in individual pixels being created.
es: int; El tamaño de cada bloque o píxel en la explosión. Esto define el ancho y alto de cada subsuperficie o entidad de píxel. Un tamaño de bloque de 1 resultará en la creación de píxeles individuales.
fr: int ; La taille de chaque bloc ou pixel dans l'explosion. Cela définit la largeur et la hauteur de chaque sous-surface ou pixel. Une taille de bloc de 1 résultera en la création de pixels individuels.

source: int; The number of rows into which the surface will be divided. This, combined with the block size, determines how many blocks are created along the vertical axis.
es: int; El número de filas en las que se dividirá la superficie. Esto, combinado con el tamaño del bloque, determina cuántos bloques se crean a lo largo del eje vertical.
fr: int ; Le nombre de lignes dans lesquelles la surface sera divisée. Cela, combiné avec la taille des blocs, détermine combien de blocs sont créés le long de l'axe vertical.

source: **columns_**:
es: **columnas_**:

source: int; The number of columns into which the surface will be divided. This, combined with the block size, determines how many blocks are created along the horizontal axis.
es: int; El número de columnas en las que se dividirá la superficie. Esto, combinado con el tamaño del bloque, determina cuántos bloques se crean a lo largo del eje horizontal.
fr: int ; Le nombre de colonnes dans lesquelles la surface sera divisée. Cela, combiné avec la taille des blocs, détermine combien de blocs sont créés le long de l'axe horizontal.

source: int; The starting x-coordinate of the surface, representing the top-left corner before the explosion.
es: int; La coordenada x inicial de la superficie, que representa la esquina superior izquierda antes de la explosión.
fr: int ; La coordonnée x de départ de la surface, représentant le coin supérieur gauche avant l'explosion.

source: int; The starting y-coordinate of the surface, representing the top-left corner before the explosion.
es: int; La coordenada y inicial de la superficie, que representa la esquina superior izquierda antes de la explosión.
fr: int ; La coordonnée y de départ de la surface, représentant le coin supérieur gauche avant l'explosion.

source: int, optional; The maximum angle (in degrees) for the projection of each exploded piece. Each piece will be projected at a random angle between 0 and `max_angle_`. Defaults to 359 degrees (full circle).
es: int, opcional; El ángulo máximo (en grados) para la proyección de cada pieza explotada. Cada pieza será proyectada a un ángulo aleatorio entre 0 y `max_angle_`. El valor predeterminado es 359 grados (círculo completo).
fr: int, optionnel ; L'angle maximal (en degrés) pour la projection de chaque morceau explosé. Chaque morceau sera projeté à un angle aléatoire entre 0 et `max_angle_`. Par défaut, 359 degrés (cercle complet).

source: **Returns** void; This function modifies the `group_` object by adding the exploded pieces as sprites, but does not return any value.
es: **Returns** void; Esta función modifica el objeto `group_` añadiendo las piezas explotadas como sprites, pero no devuelve ningún valor.
fr: **Retour** void ; Cette fonction modifie l'objet `group_` en ajoutant les morceaux explosés en tant que sprites, mais ne renvoie aucune valeur.

source: Perform an experimental database effect with a sprite group and optional blending.
es: Realiza un efecto experimental de base de datos con un grupo de sprites y opcionalmente mezclando.
fr: Appliquer un effet expérimental de base de données à un groupe de sprites et un mélange optionnel.

source: This function applies an experimental effect to a sprite group (`group_`), rendering it within a specified screen region (`screenrect_`). The effect is optionally blended based on the `blend_` value. The function can also optionally clean up the group (`clean_`), removing or resetting elements as necessary.
es: Esta función aplica un efecto experimental a un grupo de sprites (`group_`), representándolo dentro de una región de pantalla especificada (`screenrect_`). El efecto se mezcla opcionalmente según el valor de `blend_`. La función también puede limpiar el grupo (`clean_`), eliminando o restableciendo elementos según sea necesario.
fr: Cette fonction applique un effet expérimental à un groupe de sprites (`group_`), le rendant dans une région spécifique de l'écran (`screenrect_`). L'effet est optionnellement fusionné en fonction de la valeur `blend_`. La fonction peut également nettoyer le groupe (`clean_`), supprimant ou réinitialisant les éléments si nécessaire.

source: object; A pygame.Rect that defines the region of the screen to render the effect.
es: objeto; Un pygame.Rect que define la región de la pantalla para renderizar el efecto.
fr: objet ; Un pygame.Rect qui définit la région de l'écran où l'effet sera rendu.

source: object; The 2D rendering context (usually a pygame.Surface) where the effect will be rendered.
es: objeto; El contexto de renderizado 2D (normalmente un pygame.Surface) donde se renderizará el efecto.
fr: objet ; Le contexte de rendu 2D (généralement un pygame.Surface) où l'effet sera rendu.

source: object; A pygame.sprite.Group that contains the sprites to be affected by the experimental effect.
es: objeto; Un pygame.sprite.Group que contiene los sprites que serán afectados por el efecto experimental.
fr: objet ; Un pygame.sprite.Group qui contient les sprites à affecter par l'effet expérimental.

source: bint, optional; A flag that determines whether the group will be cleaned (reset or cleared) before rendering. Defaults to False.
es: bint, opcional; Una bandera que determina si el grupo será limpiado (restablecido o borrado) antes de renderizar. El valor predeterminado es False.
fr: bint, optionnel ; Un indicateur qui détermine si le groupe sera nettoyé (réinitialisé ou effacé) avant le rendu. Par défaut, False.

source: unsigned char, optional; The blending mode to be used when rendering the effect. A blend mode of 0 typically represents no blending (normal mode). Defaults to 0.
es: unsigned char, opcional; El modo de mezcla que se usará al renderizar el efecto. Un modo de mezcla de 0 típicamente representa sin mezcla (modo normal). El valor predeterminado es 0.
fr: unsigned char, optionnel ; Le mode de fusion à utiliser lors du rendu de l'effet. Un mode de fusion de 0 représente généralement aucune fusion (mode normal). Par défaut, 0.

source: **Returns** void; This function modifies the `group_` object by rendering or cleaning the sprites, but does not return any value.
es: **Returns** void; Esta función modifica el objeto `group_` renderizando o limpiando los sprites, pero no devuelve ningún valor.
fr: **Retour** void ; Cette fonction modifie l'objet `group_` en rendant ou nettoyant les sprites, mais ne renvoie aucune valeur.

source: Rebuild an exploded image from a specific frame number.
es: Reconstruir una imagen explotada a partir de un número de fotograma específico.
fr: Reconstruire une image explosée à partir d'un numéro de frame spécifique.

source: This function starts rebuilding an exploded image from a given start frame number and continues to modify the image until it reaches the current frame. It delegates the core logic to the `rff_experimental_c` function for performance.
es: Esta función comienza a reconstruir una imagen explotada desde un número de fotograma inicial y continúa modificando la imagen hasta que llega al fotograma actual. Delegará la lógica principal a la función `rff_experimental_c` para mejorar el rendimiento.
fr: Cette fonction commence à reconstruire une image explosée à partir d'un numéro de frame de départ et continue de modifier l'image jusqu'à ce qu'elle atteigne la frame actuelle. Elle délègue la logique principale à la fonction `rff_experimental_c` pour des raisons de performance.

source: The rebuild process involves inverting the direction of each pixel or pixel block's vector and drawing them to the render surface, while respecting the screen boundaries.
es: El proceso de reconstrucción consiste en invertir la dirección de cada vector de píxel o bloque de píxeles y dibujarlos en la superficie de renderizado, respetando los límites de la pantalla.
fr: Le processus de reconstruction consiste à inverser la direction du vecteur de chaque pixel ou bloc de pixels et à les dessiner sur la surface de rendu, tout en respectant les limites de l'écran.

source: Pygame.Surface; The surface where the image will be rendered. This is usually the game screen or the target rendering surface.
es: Pygame.Surface; La superficie donde se renderizará la imagen. Normalmente es la pantalla del juego o la superficie de renderizado objetivo.
fr: Pygame.Surface ; La surface où l'image sera rendue. Il s'agit généralement de l'écran du jeu ou de la surface de rendu cible.

source: Pygame.Rect; The rectangle defining the screen's area. Used to determine if a sprite is within the visible area of the screen.
es: Pygame.Rect; El rectángulo que define el área de la pantalla. Se usa para determinar si un sprite está dentro del área visible de la pantalla.
fr: Pygame.Rect; Le rectangle définissant la zone de l'écran. Utilisé pour déterminer si un sprite est dans la zone visible de l'écran.

source: unsigned int; The current frame number. The image will start rebuilding from the specified `start_frame` until the `current_frame` is reached.
es: unsigned int; El número del fotograma actual. La imagen comenzará a reconstruirse desde el `start_frame` especificado hasta que se alcance el `current_frame`.
fr: unsigned int; Le numéro de la frame actuelle. L'image commencera à être reconstruite depuis la `start_frame` spécifiée jusqu'à ce que la `current_frame` soit atteinte.

source: unsigned int; The frame number at which the rebuild process starts. The image will not be modified before this frame.
es: unsigned int; El número de fotograma en el que comienza el proceso de reconstrucción. La imagen no se modificará antes de este fotograma.
fr: unsigned int; Le numéro de la frame où le processus de reconstruction commence. L'image ne sera pas modifiée avant cette frame.
