Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/BurstSurface.po
Languages: es, fr

source: Pygame.sprite.Group; A group of sprites representing the blocks or pixels of the image to be rebuilt. Each sprite is manipulated and rendered during the rebuild process.
es: Pygame.sprite.Group; Un grupo de sprites que representa los bloques o píxeles de la imagen que se reconstruirá. Cada sprite es manipulado y renderizado durante el proceso de reconstrucción.
fr: Pygame.sprite.Group; Un groupe de sprites représentant les blocs ou pixels de l'image à reconstruire. Chaque sprite est manipulé et rendu pendant le processus de reconstruction.

source: unsigned char, optional; The blend mode to use when rendering the sprites. Blend modes control how the sprite colors are combined with the existing surface. Defaults to 0 (no blending).
es: unsigned char, opcional; El modo de mezcla que se usará al renderizar los sprites. Los modos de mezcla controlan cómo se combinan los colores de los sprites con la superficie existente. El valor predeterminado es 0 (sin mezcla).
fr: unsigned char, optionnel; Le mode de fusion à utiliser lors du rendu des sprites. Les modes de fusion contrôlent comment les couleurs des sprites sont combinées avec la surface existante. Par défaut, 0 (pas de fusion).

source: **Returns** None; This function modifies the `group_` sprites and the surface directly. No value is returned.
es: **Returns** None; Esta función modifica directamente los sprites de `group_` y la superficie. No se devuelve ningún valor.
fr: **Retourne** None; Cette fonction modifie directement les sprites `group_` et la surface. Aucun valeur n'est retournée.

source: Rebuild an exploded image with pixels or pixel blocks outside the screen boundaries.
es: Reconstruir una imagen explotada con píxeles o bloques de píxeles fuera de los límites de la pantalla.
fr: Reconstruire une image éclatée avec des pixels ou des blocs de pixels en dehors des limites de l'écran.

source: This function applies an experimental process to rebuild an image using pixels or pixel blocks that are outside the boundaries of the screen. It delegates the core logic to the `rfm_experimental_c` function for better performance. This process is often used for creating effects where the image "explodes" or pieces of it move outside the screen area.
es: Esta función aplica un proceso experimental para reconstruir una imagen usando píxeles o bloques de píxeles que están fuera de los límites de la pantalla. Delegada la lógica principal a la función `rfm_experimental_c` para mejorar el rendimiento. Este proceso se usa comúnmente para crear efectos donde la imagen "explota" o piezas de ella se mueven fuera del área de la pantalla.
fr: Cette fonction applique un processus expérimental pour reconstruire une image en utilisant des pixels ou des blocs de pixels qui se trouvent en dehors des limites de l'écran. Elle délègue la logique principale à la fonction `rfm_experimental_c` pour de meilleures performances. Ce processus est souvent utilisé pour créer des effets où l'image "explose" ou des morceaux de celle-ci sortent de la zone de l'écran.

source: Pygame.Rect; The rectangle representing the boundaries of the screen or the game display. Used to check if a sprite is within the screen's area.
es: Pygame.Rect; El rectángulo que representa los límites de la pantalla o la pantalla del juego. Se usa para verificar si un sprite está dentro del área de la pantalla.
fr: Pygame.Rect; Le rectangle représentant les limites de l'écran ou l'affichage du jeu. Utilisé pour vérifier si un sprite est dans la zone de l'écran.

source: Pygame.Surface; The surface where the rebuilt image will be rendered. This is typically the game display or render target.
es: Pygame.Surface; La superficie donde se renderizará la imagen reconstruida. Normalmente es la pantalla del juego o el objetivo de renderizado.
fr: Pygame.Surface; La surface où l'image reconstruite sera rendue. Il s'agit généralement de l'affichage du jeu ou de la cible de rendu.

source: Pygame.sprite.Group; A group of sprites that represent the pixels or blocks being used to rebuild the image. Each sprite in the group will be processed and blitted onto the surface.
es: Pygame.sprite.Group; Un grupo de sprites que representan los píxeles o bloques utilizados para reconstruir la imagen. Cada sprite en el grupo será procesado y transferido a la superficie.
fr: Pygame.sprite.Group; Un groupe de sprites représentant les pixels ou blocs utilisés pour reconstruire l'image. Chaque sprite dans le groupe sera traité et affiché sur la surface.

source: unsigned char, optional; A blend mode to be used when rendering the sprites. Blend modes control how the colors of the sprites are combined with the existing colors on the surface. Defaults to 0 (no blending).
es: unsigned char, opcional; Un modo de fusión que se usará al renderizar los sprites. Los modos de fusión controlan cómo se combinan los colores de los sprites con los colores existentes en la superficie. El valor predeterminado es 0 (sin fusión).
fr: unsigned char, optionnel; Un mode de fusion à utiliser lors du rendu des sprites. Les modes de fusion contrôlent comment les couleurs des sprites sont combinées avec les couleurs existantes sur la surface. Par défaut, 0 (pas de fusion).

source: **Returns** None; This function modifies the surface directly and does not return any value. It also modifies the group of sprites in place.
es: **Returns** Ninguno; Esta función modifica directamente la superficie y no devuelve ningún valor. También modifica el grupo de sprites en su lugar.
fr: **Retourne** Aucun; Cette fonction modifie directement la surface et ne retourne aucune valeur. Elle modifie également le groupe de sprites en place.

source: Rebuild a Pygame surface from a group of sprites (inplace).
es: Reconstruir una superficie de Pygame a partir de un grupo de sprites (en su lugar).
fr: Reconstruire une surface Pygame à partir d'un groupe de sprites (en place).

source: This function takes a group of sprites and blits their images onto the specified surface at their respective positions, updating the surface in place. The process modifies the surface directly without creating a new one.
es: Esta función toma un grupo de sprites y transfiere sus imágenes a la superficie especificada en sus respectivas posiciones, actualizando la superficie en su lugar. El proceso modifica directamente la superficie sin crear una nueva.
fr: Cette fonction prend un groupe de sprites et place leurs images sur la surface spécifiée à leurs positions respectives, en mettant à jour la surface en place. Le processus modifie directement la surface sans en créer une nouvelle.

source: It delegates the task to the `build_surface_inplace_c` function, which is written in C for improved performance.
es: Delegada la tarea a la función `build_surface_inplace_c`, que está escrita en C para mejorar el rendimiento.
fr: Elle délègue la tâche à la fonction `build_surface_inplace_c`, qui est écrite en C pour de meilleures performances.

source: Pygame.Surface; The surface that will be updated by blitting the sprites onto it. The original surface is modified directly, and no new surface is created.
es: Pygame.Surface; La superficie que será actualizada al transferir los sprites a ella. La superficie original se modifica directamente, y no se crea una superficie nueva.
fr: Pygame.Surface; La surface qui sera mise à jour en plaçant les sprites dessus. La surface originale est modifiée directement, et aucune nouvelle surface n'est créée.

source: Pygame.sprite.Group; A group of sprites to be blitted onto the surface. Each sprite's position is determined by its `rect` attribute.
es: Pygame.sprite.Group; Un grupo de sprites que serán transferidos a la superficie. La posición de cada sprite está determinada por su atributo `rect`.
fr: Pygame.sprite.Group; Un groupe de sprites à placer sur la surface. La position de chaque sprite est déterminée par son attribut `rect`.

source: unsigned int; The width of the block used for the tiling or reconstruction process. It can influence how the surface is rebuilt.
es: unsigned int; El ancho del bloque utilizado para el proceso de mosaico o reconstrucción. Puede influir en cómo se reconstruye la superficie.
fr: unsigned int; La largeur du bloc utilisé pour le processus de carrelage ou de reconstruction. Cela peut influencer la façon dont la surface est reconstruite.

source: unsigned int; The height of the block used for the tiling or reconstruction process. It works in conjunction with `block_width` to determine the surface layout.
es: unsigned int; La altura del bloque utilizado para el proceso de mosaico o reconstrucción. Trabaja junto con `block_width` para determinar la disposición de la superficie.
fr: unsigned int; La hauteur du bloc utilisé pour le processus de carrelage ou de reconstruction. Elle fonctionne conjointement avec `block_width` pour déterminer la disposition de la surface.

source: **Returns** None; This function modifies the surface directly and does not return any value.
es: **Returns** Ninguno; Esta función modifica directamente la superficie y no devuelve ningún valor.
fr: **Retourne** Aucun; Cette fonction modifie directement la surface et ne retourne aucune valeur.

source: Efficiently rebuild a Pygame surface from a group of sprites (inplace).
es: Reconstruir eficientemente una superficie de Pygame a partir de un grupo de sprites (en su lugar).
fr: Reconstruire efficacement une surface Pygame à partir d'un groupe de sprites (en place).

source: This function rapidly constructs a surface by blitting individual sprite images onto the given surface at their respective positions. The process is performed in place, meaning the surface is directly updated without creating a new surface.
es: Esta función construye rápidamente una superficie al transferir las imágenes de los sprites individuales a la superficie dada en sus respectivas posiciones. El proceso se realiza en su lugar, lo que significa que la superficie se actualiza directamente sin crear una nueva superficie.
fr: Cette fonction construit rapidement une surface en plaçant les images des sprites individuels sur la surface donnée à leurs positions respectives. Le processus est effectué en place, ce qui signifie que la surface est directement mise à jour sans créer une nouvelle surface.

source: It delegates the actual work to the optimized `build_surface_inplace_fast_c` function for performance.
es: Delegada la tarea real a la función optimizada `build_surface_inplace_fast_c` para mejorar el rendimiento.
fr: Elle délègue le travail réel à la fonction optimisée `build_surface_inplace_fast_c` pour des performances améliorées.

source: Pygame.Surface; The surface to which the sprites will be blitted. This surface is modified directly.
es: Pygame.Surface; La superficie a la que se transferirán los sprites. Esta superficie se modifica directamente.
fr: Pygame.Surface; La surface sur laquelle les sprites seront placés. Cette surface est modifiée directement.

source: Pygame.sprite.Group; The group of sprites whose images will be blitted onto the surface. Each sprite's position is taken from its `rect` attribute.
es: Pygame.sprite.Group; El grupo de sprites cuyas imágenes serán transferidas a la superficie. La posición de cada sprite se toma de su atributo `rect`.
fr: Pygame.sprite.Group; Le groupe de sprites dont les images seront placées sur la surface. La position de chaque sprite est déterminée par son attribut `rect`.

source: unsigned int; The width of the blocks that will be used to build the surface. This is important for any tiling logic and might impact performance depending on the block size.
es: unsigned int; El ancho de los bloques que se utilizarán para construir la superficie. Esto es importante para cualquier lógica de mosaico y podría afectar el rendimiento dependiendo del tamaño del bloque.
fr: unsigned int; La largeur des blocs qui seront utilisés pour construire la surface. Cela est important pour toute logique de carrelage et pourrait impacter les performances selon la taille des blocs.

source: unsigned int; The height of the blocks that will be used to build the surface. Similar to `block_width`, it affects how the surface is reconstructed.
es: unsigned int; La altura de los bloques que se utilizarán para construir la superficie. Similar a `block_width`, afecta cómo se reconstruye la superficie.
fr: unsigned int; La hauteur des blocs qui seront utilisés pour construire la surface. Semblable à `block_width`, elle affecte la façon dont la surface est reconstruite.

source: **Returns** None; The surface is modified directly, so there is no return value.
es: **Returns** Ninguno; La superficie se modifica directamente, por lo que no hay valor de retorno.
fr: **Retourne** Aucun; La surface est modifiée directement, donc il n'y a pas de valeur retournée.

source: **list**
fr: **liste**
