Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/BurstSurface.po
Languages: es, fr

source: 1. Cython Burst Surface Library
es: 1. Biblioteca de Superficie de Explosión en Cython
fr: 1. Bibliothèque Cython Burst Surface

source: 2. Key Features
es: 2. Características Clave
fr: 2. Caractéristiques principales

source: This library provides advanced tools for image manipulation and rendering in graphical applications. Built on pygame and other low-level rendering techniques, it enables efficient handling of surfaces, sprites, and pixel-based effects. The key features include:
es: Esta biblioteca proporciona herramientas avanzadas para la manipulación y renderizado de imágenes en aplicaciones gráficas. Construida sobre pygame y otras técnicas de renderizado de bajo nivel, permite un manejo eficiente de superficies, sprites y efectos basados en píxeles. Las características clave incluyen:
fr: Cette bibliothèque fournit des outils avancés pour la manipulation et le rendu des images dans les applications graphiques. Basée sur pygame et d'autres techniques de rendu bas niveau, elle permet une gestion efficace des surfaces, des sprites et des effets basés sur les pixels. Les principales caractéristiques incluent :

source: Splitting images into smaller blocks for sprite sheets and tile maps.
es: Dividir imágenes en bloques más pequeños para hojas de sprites y mapas de mosaicos.
fr: Diviser les images en blocs plus petits pour les feuilles de sprites et les cartes de tuiles.

source: Applying dynamic effects like bursts and controlled rebuilding of images.
es: Aplicar efectos dinámicos como explosiones y reconstrucción controlada de imágenes.
fr: Appliquer des effets dynamiques comme les explosions et la reconstruction contrôlée des images.

source: Storing and manipulating graphical elements in memory for optimized rendering.
es: Almacenar y manipular elementos gráficos en memoria para un renderizado optimizado.
fr: Stocker et manipuler les éléments graphiques en mémoire pour un rendu optimisé.

source: Enhancing performance in real-time applications through optimized functions.
es: Mejorar el rendimiento en aplicaciones en tiempo real mediante funciones optimizadas.
fr: Améliorer les performances dans les applications en temps réel grâce à des fonctions optimisées.

source: Supporting experimental features for advanced graphical effects and debugging.
es: Soporte para funciones experimentales para efectos gráficos avanzados y depuración.
fr: Soutenir des fonctionnalités expérimentales pour des effets graphiques avancés et le débogage.

source: 3. Library Functional Overview
es: 3. Resumen Funcional de la Biblioteca
fr: 3. Aperçu fonctionnel de la bibliothèque

source: The library consists of a set of functions that facilitate various graphical transformations and effects. It focuses on the efficient handling of pixel-based surfaces, allowing developers to create complex visual effects such as explosions, dynamic surface reconstruction, and optimized sprite manipulations.
es: La biblioteca consta de un conjunto de funciones que facilitan diversas transformaciones y efectos gráficos. Se centra en el manejo eficiente de superficies basadas en píxeles, permitiendo a los desarrolladores crear efectos visuales complejos como explosiones, reconstrucción dinámica de superficies y manipulaciones optimizadas de sprites.
fr: La bibliothèque se compose d'un ensemble de fonctions qui facilitent diverses transformations et effets graphiques. Elle se concentre sur la gestion efficace des surfaces basées sur les pixels, permettant aux développeurs de créer des effets visuels complexes tels que des explosions, la reconstruction dynamique de surfaces et des manipulations optimisées de sprites.

source: 4. Target Applications
es: 4. Aplicaciones Objetivo
fr: 4. Applications cibles

source: This library is particularly useful for:
es: Esta biblioteca es particularmente útil para:
fr: Cette bibliothèque est particulièrement utile pour :

source: Game development: Enabling real-time effects like explosions, animations, and sprite transformations.
es: Desarrollo de juegos: Habilitar efectos en tiempo real como explosiones, animaciones y transformaciones de sprites.
fr: Développement de jeux : Permettre des effets en temps réel comme des explosions, des animations, et des transformations de sprites.

source: Graphics simulations: Creating dynamic visual effects that require image manipulation.
es: Simulaciones gráficas: Crear efectos visuales dinámicos que requieren manipulación de imágenes.
fr: Simulations graphiques : Créer des effets visuels dynamiques nécessitant la manipulation d'images.

source: Image processing: Splitting, reconstructing, and modifying images for artistic or technical purposes.
es: Procesamiento de imágenes: Dividir, reconstruir y modificar imágenes con fines artísticos o técnicos.
fr: Traitement d'image : Diviser, reconstruire et modifier des images à des fins artistiques ou techniques.

source: Research and experimentation: Testing new graphical rendering techniques and optimization strategies.
es: Investigación y experimentación: Probar nuevas técnicas de renderizado gráfico y estrategias de optimización.
fr: Recherche et expérimentation : Tester de nouvelles techniques de rendu graphique et des stratégies d'optimisation.

source: 5. Cython Functions
es: 5. Funciones de Cython
fr: 5. Fonctions Cython

source: 6. Summary
es: 6. Resumen
fr: 6. Résumé

source: This library is designed to enhance the capabilities of graphical applications, particularly in game development and advanced image manipulation. By offering optimized functions for handling surfaces, splitting images, applying burst effects, and rebuilding images, it provides a flexible and efficient toolset for developers. Experimental functions add further possibilities for exploring novel rendering techniques. The library is a valuable resource for those looking to implement complex graphical transformations efficiently.
es: Esta biblioteca está diseñada para mejorar las capacidades de las aplicaciones gráficas, particularmente en el desarrollo de juegos y la manipulación avanzada de imágenes. Al ofrecer funciones optimizadas para manejar superficies, dividir imágenes, aplicar efectos de explosión y reconstruir imágenes, proporciona un conjunto de herramientas flexible y eficiente para los desarrolladores. Las funciones experimentales añaden más posibilidades para explorar técnicas de renderizado novedosas. La biblioteca es un recurso valioso para aquellos que buscan implementar transformaciones gráficas complejas de manera eficiente.
fr: Cette bibliothèque est conçue pour améliorer les capacités des applications graphiques, en particulier dans le développement de jeux et la manipulation avancée d'images. En offrant des fonctions optimisées pour la gestion des surfaces, le découpage d'images, l'application d'effets d'explosion et la reconstruction d'images, elle fournit un ensemble d'outils flexible et efficace pour les développeurs. Les fonctions expérimentales offrent des possibilités supplémentaires pour explorer de nouvelles techniques de rendu. La bibliothèque est une ressource précieuse pour ceux qui cherchent à implémenter des transformations graphiques complexes de manière efficace.

source: 7. Cython method list
es: 7. Lista de métodos de Cython
fr: 7. Liste des méthodes Cython

source: **Extract a block of pixels from a larger 2D array representing an image.**
es: **Extraer un bloque de píxeles de un arreglo 2D más grande que representa una imagen.**
fr: **Extraire un bloc de pixels d'un tableau 2D plus grand représentant une image.**

source: This function retrieves a rectangular block of pixels from a larger image (or sprite sheet) and stores it into a smaller block array. The function delegates the actual pixel extraction to the `pixel_block_rgb_c` helper function for performance optimization.
es: Esta función recupera un bloque rectangular de píxeles de una imagen más grande (o hoja de sprites) y lo almacena en un arreglo de bloques más pequeño. La función delega la extracción real de píxeles a la función auxiliar `pixel_block_rgb_c` para optimizar el rendimiento.
fr: Cette fonction récupère un bloc rectangulaire de pixels d'une image plus grande (ou d'une feuille de sprites) et le stocke dans un tableau de blocs plus petit. La fonction délègue l'extraction réelle des pixels à la fonction auxiliaire `pixel_block_rgb_c` pour l'optimisation des performances.

source: **Parameters**
es: **Parámetros**
fr: **Paramètres**

source: unsigned char; A 3D array representing the full image (height x width x 3). This is the source from which the pixel block will be extracted.
es: unsigned char; Un arreglo 3D que representa la imagen completa (altura x ancho x 3). Esta es la fuente de la cual se extraerá el bloque de píxeles.
fr: unsigned char ; Un tableau 3D représentant l'image complète (hauteur x largeur x 3). Il s'agit de la source à partir de laquelle le bloc de pixels sera extrait.

source: int; The x-coordinate of the top-left corner of the block to extract. This defines where the block starts in the source image.
es: int; La coordenada x de la esquina superior izquierda del bloque a extraer. Esto define dónde comienza el bloque en la imagen de origen.
fr: int ; La coordonnée x du coin supérieur gauche du bloc à extraire. Cela définit où le bloc commence dans l'image source.

source: int; The y-coordinate of the top-left corner of the block to extract. This defines where the block starts in the source image.
es: int; La coordenada y de la esquina superior izquierda del bloque a extraer. Esto define dónde comienza el bloque en la imagen de origen.
fr: int ; La coordonnée y du coin supérieur gauche du bloc à extraire. Cela définit où le bloc commence dans l'image source.

source: int; The width of the block to extract. The block will be `w` pixels wide.
es: int; El ancho del bloque a extraer. El bloque tendrá `w` píxeles de ancho.
fr: int ; La largeur du bloc à extraire. Le bloc aura `w` pixels de large.

source: int; The height of the block to extract. The block will be `h` pixels tall.
es: int; La altura del bloque a extraer. El bloque tendrá `h` píxeles de alto.
fr: int ; La hauteur du bloc à extraire. Le bloc aura `h` pixels de haut.

source: unsigned char; A pre-allocated empty block of size `w x h x 3`. This array will be filled with the pixel data from the source image.
es: unsigned char; Un bloque vacío preasignado de tamaño `w x h x 3`. Este arreglo se llenará con los datos de píxeles de la imagen de origen.
fr: unsigned char ; Un bloc vide pré-alloué de taille `w x h x 3`. Ce tableau sera rempli avec les données de pixels de l'image source.

source: **Returns**
es: **Devuelve**
fr: **Retourne**

source: A 3D array (height x width x 3) representing the extracted pixel block. The block is stored in the `block` parameter.
es: Un arreglo 3D (altura x ancho x 3) que representa el bloque de píxeles extraído. El bloque se almacena en el parámetro `block`.
fr: Un tableau 3D (hauteur x largeur x 3) représentant le bloc de pixels extrait. Le bloc est stocké dans le paramètre `block`.

source: **Split a pygame.Surface into smaller subsurfaces.**
es: **Dividir una superficie de pygame en subsuperficies más pequeñas.**
fr: **Diviser une pygame.Surface en sous-surfaces plus petites.**

source: This function divides a larger surface into smaller subsurfaces (blocks) based on the specified size, number of rows, and columns. It delegates the actual splitting to the `surface_split_c` helper function for efficient processing.
es: Esta función divide una superficie más grande en subsuperficies más pequeñas (bloques) según el tamaño, número de filas y columnas especificados. Delega la división real a la función auxiliar `surface_split_c` para un procesamiento eficiente.
fr: Cette fonction divise une surface plus grande en sous-surfaces (blocs) en fonction de la taille spécifiée, du nombre de lignes et de colonnes. Elle délègue la division réelle à la fonction auxiliaire `surface_split_c` pour un traitement efficace.

source: pygame.Surface; The surface to be split into smaller subsurfaces.
es: pygame.Surface; La superficie que se dividirá en subsuperficies más pequeñas.
fr: pygame.Surface ; La surface à diviser en sous-surfaces plus petites.

source: int; The size (width and height) of each subsurface. The resulting subsurfaces will be square with dimensions `size_ x size_`.
es: int; El tamaño (ancho y alto) de cada subsuperficie. Las subsuperficies resultantes serán cuadradas con dimensiones `size_ x size_`.
fr: int ; La taille (largeur et hauteur) de chaque sous-surface. Les sous-surfaces résultantes seront carrées avec des dimensions de `size_ x size_`.

source: int; The number of rows of subsurfaces to create. This determines how many horizontal blocks will be extracted from the original surface.
es: int; El número de filas de subsuperficies a crear. Esto determina cuántos bloques horizontales se extraerán de la superficie original.
fr: int ; Le nombre de lignes de sous-surfaces à créer. Cela détermine combien de blocs horizontaux seront extraits de la surface d'origine.

source: int; The number of columns of subsurfaces to create. This determines how many vertical blocks will be extracted from the original surface.
es: int; El número de columnas de subsuperficies a crear. Esto determina cuántos bloques verticales se extraerán de la superficie original.
fr: int ; Le nombre de colonnes de sous-surfaces à créer. Cela détermine combien de blocs verticaux seront extraits de la surface d'origine.

source: A list of pygame.Surface objects, each representing a smaller block of the original surface.
es: Una lista de objetos pygame.Surface, cada uno representando un bloque más pequeño de la superficie original.
fr: Une liste d'objets pygame.Surface, chacun représentant un bloc plus petit de la surface d'origine.

source: **Simulate an explosion effect on a surface by splitting it into smaller subsurfaces or pixels.**
es: **Simular un efecto de explosión en una superficie dividiéndola en subsuperficies o píxeles más pequeños.**
fr: **Simuler un effet d'explosion sur une surface en la divisant en sous-surfaces plus petites ou en pixels.**

source: This function breaks a given surface into multiple smaller blocks or pixels and applies an explosion effect, projecting them in random directions. The subsurfaces or pixels are placed at specified positions and can be projected at different angles.
es: Esta función divide una superficie dada en múltiples bloques o píxeles más pequeños y aplica un efecto de explosión, proyectándolos en direcciones aleatorias. Las subsuperficies o píxeles se colocan en posiciones especificadas y pueden proyectarse en diferentes ángulos.
fr: Cette fonction divise une surface donnée en plusieurs blocs ou pixels plus petits et applique un effet d'explosion, les projetant dans des directions aléatoires. Les sous-surfaces ou pixels sont placés à des positions spécifiées et peuvent être projetés à différents angles.

source: pygame.Surface; The surface to be split into smaller subsurfaces or pixels.
es: pygame.Surface; La superficie que se dividirá en subsuperficies o píxeles más pequeños.
fr: pygame.Surface ; La surface à diviser en sous-surfaces ou en pixels plus petits.

source: list; A list that will be populated with the created sprites, each representing a smaller subsurface or pixel. These sprites will have attributes like position, velocity (vector), and other states related to the explosion.
es: list; Una lista que se llenará con los sprites creados, cada uno representando una subsuperficie o píxel más pequeño. Estos sprites tendrán atributos como posición, velocidad (vector) y otros estados relacionados con la explosión.
fr: liste ; Une liste qui sera remplie avec les sprites créés, chacun représentant une sous-surface ou un pixel plus petit. Ces sprites auront des attributs comme la position, la vélocité (vecteur) et d'autres états liés à l'explosion.

source: int; The size of each block (subsurface). If set to 1, each block will be a single pixel.
es: int; El tamaño de cada bloque (subsuperficie). Si se establece en 1, cada bloque será un solo píxel.
fr: int ; La taille de chaque bloc (sous-surface). Si défini à 1, chaque bloc sera un pixel unique.

source: int; The number of rows of subsurfaces or pixels to create. Determines how many horizontal blocks will be created.
es: int; El número de filas de subsuperficies o píxeles a crear. Determina cuántos bloques horizontales se crearán.
fr: int ; Le nombre de lignes de sous-surfaces ou de pixels à créer. Cela détermine combien de blocs horizontaux seront créés.

source: int; The number of columns of subsurfaces or pixels to create. Determines how many vertical blocks will be created.
es: int; El número de columnas de subsuperficies o píxeles a crear. Determina cuántos bloques verticales se crearán.
fr: int ; Le nombre de colonnes de sous-surfaces ou de pixels à créer. Cela détermine combien de blocs verticaux seront créés.

source: int; The x-coordinate of the top-left corner of the surface before the explosion effect.
es: int; La coordenada x de la esquina superior izquierda de la superficie antes del efecto de explosión.
fr: int ; La coordonnée x du coin supérieur gauche de la surface avant l'effet d'explosion.

source: int; The y-coordinate of the top-left corner of the surface before the explosion effect.
es: int; La coordenada y de la esquina superior izquierda de la superficie antes del efecto de explosión.
fr: int ; La coordonnée y du coin supérieur gauche de la surface avant l'effet d'explosion.

source: int, optional; The maximum angle (in degrees) at which each subsurface/pixel will be projected. If not provided, defaults to 0 (no angle applied)
es: int, opcional; El ángulo máximo (en grados) en el que cada subsuperficie/píxel será proyectado. Si no se proporciona, el valor predeterminado es 0 (sin ángulo aplicado).
fr: int, optionnel ; L'angle maximal (en degrés) auquel chaque sous-surface/pixel sera projeté. Si non fourni, la valeur par défaut est 0 (aucun angle appliqué).

source: Display an explosion effect on the screen by rendering the burst of sprites.
es: Mostrar un efecto de explosión en la pantalla renderizando la explosión de sprites.
fr: Affichez un effet d'explosion à l'écran en rendant l'éclatement des sprites.

source: This function iterates through the list of sprites (created by the burst effect), rendering each sprite onto the provided screen surface. The sprites are drawn with optional blending effects for smoother transitions, such as additive blending.
es: Esta función itera a través de la lista de sprites (creados por el efecto de explosión), renderizando cada sprite sobre la superficie de la pantalla proporcionada. Los sprites se dibujan con efectos de mezcla opcionales para transiciones más suaves, como la mezcla aditiva.
fr: Cette fonction itère à travers la liste des sprites (créés par l'effet d'explosion), rendant chaque sprite sur la surface de l'écran fournie. Les sprites sont dessinés avec des effets de fusion optionnels pour des transitions plus fluides, tels que la fusion additive.

source: **screen_**:
es: **pantalla_**:

source: pygame.Surface; The screen (or rendering surface) where the explosion effect (burst of sprites) will be drawn.
es: pygame.Surface; La pantalla (o superficie de renderizado) donde el efecto de explosión (explosión de sprites) será dibujado.
fr: pygame.Surface ; L'écran (ou la surface de rendu) où l'effet d'explosion (éclatement des sprites) sera dessiné.

source: **vertex_array_**:
es: **array_de_vertices_**:

source: list; A list of sprite objects that represent the subsurfaces or pixels created during the explosion effect. These sprites will be rendered on the screen.
es: lista; Una lista de objetos sprite que representan las subsuperficies o píxeles creados durante el efecto de explosión. Estos sprites serán renderizados en la pantalla.
fr: liste ; Une liste d'objets sprite représentant les sous-surfaces ou les pixels créés lors de l'effet d'explosion. Ces sprites seront rendus à l'écran.

source: **blend_**:
es: **mezcla_**:

source: unsigned char, optional; The blending mode to apply when drawing the sprites. Default is 0 (no blending). A non-zero value may specify an additive or other blending mode depending on how it's defined.
es: unsigned char, opcional; El modo de mezcla a aplicar al dibujar los sprites. El valor predeterminado es 0 (sin mezcla). Un valor distinto de cero puede especificar un modo de mezcla aditiva u otro, dependiendo de cómo se defina.
fr: unsigned char, optionnel ; Le mode de fusion à appliquer lors du dessin des sprites. La valeur par défaut est 0 (pas de fusion). Une valeur non nulle peut spécifier un mode de fusion additive ou un autre mode de fusion selon la manière dont il est défini.

source: **Returns** void; The function draws each sprite from `vertex_array_` to the `screen_` surface.
es: **Returns** void; La función dibuja cada sprite de `array_de_vertices_` a la superficie `pantalla_`.
fr: **Retour** void ; La fonction dessine chaque sprite depuis `vertex_array_` jusqu'à la surface `screen_`.

source: Rebuild and render an explosion effect from a specific frame.
es: Reconstruir y renderizar un efecto de explosión desde un fotograma específico.
fr: Reconstruire et afficher un effet d'explosion à partir d'un cadre spécifique.

source: This function rebuilds and renders an explosion effect (created from sprites) on the screen starting from a specified frame number. The sprites are progressively re-rendered from their original positions and updated based on the `current_frame_`. The function also supports blending for smoother visual transitions during the effect.
es: Esta función reconstruye y renderiza un efecto de explosión (creado a partir de sprites) en la pantalla comenzando desde un número de fotograma especificado. Los sprites se vuelven a renderizar progresivamente desde sus posiciones originales y se actualizan en función de `current_frame_`. La función también admite mezcla para transiciones visuales más suaves durante el efecto.
fr: Cette fonction reconstruit et affiche un effet d'explosion (créé à partir de sprites) à l'écran, en commençant à partir d'un numéro de cadre spécifié. Les sprites sont progressivement redessinés à partir de leurs positions d'origine et mis à jour en fonction du `current_frame_`. La fonction prend également en charge la fusion pour des transitions visuelles plus fluides pendant l'effet.

source: pygame.Surface; The surface (or screen) where the rebuilt explosion effect will be drawn.
es: pygame.Surface; La superficie (o pantalla) donde se dibujará el efecto de explosión reconstruido.
fr: pygame.Surface ; La surface (ou écran) où l'effet d'explosion reconstruit sera dessiné.

source: **current_frame_**:
es: **frame_actual_**:

source: unsigned int; The current frame number, used to control the timing and progression of the explosion effect.
es: unsigned int; El número del fotograma actual, utilizado para controlar el tiempo y la progresión del efecto de explosión.
fr: unsigned int ; Le numéro du cadre actuel, utilisé pour contrôler le timing et la progression de l'effet d'explosion.

source: **start_frame**:
es: **frame_inicial**:

source: unsigned int; The frame number at which to start rebuilding the explosion effect. The process will only begin after the `current_frame_` exceeds this value.
es: unsigned int; El número de fotograma en el que comenzar a reconstruir el efecto de explosión. El proceso solo comenzará después de que `frame_actual_` supere este valor.
fr: unsigned int ; Le numéro du cadre auquel commencer à reconstruire l'effet d'explosion. Le processus ne commencera que lorsque le `current_frame_` dépassera cette valeur.
