Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Fire.po
Languages: es, fr

source: 1. Purpose of the Library
es: 1. Propósito de la Biblioteca
fr: 1. Objectif de la bibliothèque

source: The library provides tools to generate dynamic fire and cloud effects that can be rendered in real-time. These effects are highly customizable, allowing developers to control aspects such as:
es: La biblioteca proporciona herramientas para generar efectos dinámicos de fuego y nubes que pueden renderizarse en tiempo real. Estos efectos son altamente personalizables, permitiendo a los desarrolladores controlar aspectos como:
fr: La bibliothèque fournit des outils pour générer des effets dynamiques de feu et de nuages qui peuvent être rendus en temps réel. Ces effets sont hautement personnalisables, permettant aux développeurs de contrôler des aspects tels que :

source: **Size and shape** of the effect (e.g., width, height, intensity).
es: **Tamaño y forma** del efecto (por ejemplo, ancho, alto, intensidad).
fr: **Taille et forme** de l'effet (par exemple, largeur, hauteur, intensité).

source: **Color palettes** for the fire or cloud.
es: **Paletas de colores** para el fuego o las nubes.
fr: **Palettes de couleurs** pour le feu ou le nuage.

source: **Post-processing effects** like bloom, blur, brightness adjustment, and smoothing.
es: **Efectos de post-procesamiento** como bloom, desenfoque, ajuste de brillo y suavizado.
fr: **Effets de post-traitement** tels que le bloom, le flou, l'ajustement de la luminosité, et le lissage.

source: **Performance optimization** through texture resolution reduction and fast algorithms.
es: **Optimización del rendimiento** mediante la reducción de la resolución de texturas y algoritmos rápidos.
fr: **Optimisation des performances** par la réduction de la résolution des textures et des algorithmes rapides.

source: The library is optimized for performance, making it suitable for real-time applications like games. It uses **Cython** for speed and integrates with **Pygame** for rendering.
es: La biblioteca está optimizada para el rendimiento, lo que la hace adecuada para aplicaciones en tiempo real como juegos. Utiliza **Cython** para la velocidad y se integra con **Pygame** para el renderizado.
fr: La bibliothèque est optimisée pour les performances, ce qui la rend adaptée aux applications en temps réel comme les jeux. Elle utilise **Cython** pour la rapidité et s'intègre avec **Pygame** pour le rendu.

source: 2. Key Functions
es: 2. Funciones Clave
fr: 2. Fonctions principales

source: Fire Effect Functions
es: Funciones de Efectos de Fuego
fr: Fonctions d'effet de feu

source: These functions generate procedural fire effects.
es: Estas funciones generan efectos de fuego procedurales.
fr: Ces fonctions génèrent des effets de feu procéduraux.

source: Generates a fire effect with an optional border.
es: Genera un efecto de fuego con un borde opcional.
fr: Génère un effet de feu avec une bordure optionnelle.

source: A helper function for generating fire effects. It processes the fire intensity array and applies the color palette.
es: Una función auxiliar para generar efectos de fuego. Procesa el array de intensidad del fuego y aplica la paleta de colores.
fr: Une fonction d'aide pour générer des effets de feu. Elle traite le tableau d'intensité du feu et applique la palette de couleurs.

source: Similar to ``fire_surface24_c_border`` but without the border option. It generates a fire effect with customizable intensity and horizontal limits.
es: Similar a ``fire_surface24_c_border`` pero sin la opción de borde. Genera un efecto de fuego con intensidad y límites horizontales personalizables.
fr: Semblable à ``fire_surface24_c_border`` mais sans l'option de bordure. Elle génère un effet de feu avec une intensité personnalisable et des limites horizontales.

source: The main Python-callable function for generating fire effects.
es: La función principal en Python para generar efectos de fuego.
fr: La fonction principale appelable en Python pour générer des effets de feu.

source: Includes options for post-processing (bloom, blur, brightness adjustment) and performance optimization (``reduce_factor_``).
es: Incluye opciones para post-procesamiento (bloom, desenfoque, ajuste de brillo) y optimización del rendimiento (``reduce_factor_``).
fr: Comprend des options pour le post-traitement (bloom, flou, ajustement de la luminosité) et l'optimisation des performances (``reduce_factor_``).

source: The Cython-optimized core function for generating fire effects. It is called internally by ``fire_effect``.
es: La función central optimizada con Cython para generar efectos de fuego. Es llamada internamente por ``fire_effect``.
fr: La fonction principale optimisée en Cython pour générer des effets de feu. Elle est appelée en interne par ``fire_effect``.

source: Cloud Effect Functions
es: Funciones de Efectos de Nubes
fr: Fonctions d'effet de nuage

source: These functions generate procedural cloud or smoke effects.
es: Estas funciones generan efectos de nubes o humo procedurales.
fr: Ces fonctions génèrent des effets de nuage ou de fumée procéduraux.

source: Generates a cloud effect as a 24-bit RGB pixel array.
es: Genera un efecto de nube como un array de píxeles RGB de 24 bits.
fr: Génère un effet de nuage sous forme de tableau de pixels RGB 24 bits.

source: The main Python-callable function for generating cloud effects.
es: La función principal en Python para generar efectos de nubes.
fr: La fonction principale appelable en Python pour générer des effets de nuage.

source: The Cython-optimized core function for generating cloud effects. It is called internally by ``cloud_effect``.
es: La función central optimizada con Cython para generar efectos de nubes. Es llamada internamente por ``cloud_effect``.
fr: La fonction principale optimisée en Cython pour générer des effets de nuage. Elle est appelée en interne par ``cloud_effect``.

source: 3. Core Features
es: 3. Características Principales
fr: 3. Fonctionnalités principales

source: Customizable Effects
es: Efectos Personalizables
fr: Effets personnalisables

source: Control the size, intensity, and shape of fire and cloud effects using parameters like ``factor``, ``intensity``, ``low``, and ``high``.
es: Controla el tamaño, intensidad y forma de los efectos de fuego y nubes utilizando parámetros como ``factor``, ``intensity``, ``low`` y ``high``.
fr: Contrôlez la taille, l'intensité et la forme des effets de feu et de nuage à l'aide de paramètres comme ``factor``, ``intensity``, ``low`` et ``high``.

source: Color Palettes
es: Paletas de Colores
fr: Palettes de couleurs

source: Use custom color palettes (``palette_``) to define the colors of the fire or cloud.
es: Utiliza paletas de colores personalizadas (``palette_``) para definir los colores del fuego o las nubes.
fr: Utilisez des palettes de couleurs personnalisées (``palette_``) pour définir les couleurs du feu ou du nuage.

source: Post-Processing
es: Post-Procesamiento
fr: Post-traitement

source: **Bloom**: Adds a glowing effect to bright areas.
es: **Bloom**: Añade un efecto de resplandor a las áreas brillantes.
fr: **Bloom** : Ajoute un effet lumineux aux zones claires.

source: **Blur**: Softens the edges of the effect for a more realistic appearance.
es: **Blur**: Suaviza los bordes del efecto para una apariencia más realista.
fr: **Flou** : Adoucit les bords de l'effet pour un aspect plus réaliste.

source: **Brightness Adjustment**: Increases or decreases the brightness of the effect.
es: **Ajuste de Brillo**: Aumenta o disminuye el brillo del efecto.
fr: **Ajustement de la luminosité** : Augmente ou diminue la luminosité de l'effet.

source: **Smoothing**: Applies bi-linear filtering for smoother textures.
es: **Suavizado**: Aplica filtrado bilineal para texturas más suaves.
fr: **Lissage** : Applique un filtrage bi-linéaire pour des textures plus lisses.

source: Performance Optimization
es: Optimización del Rendimiento
fr: Optimisation des performances

source: **Reduce Factor**: Reduces the resolution of the texture for faster processing.
es: **Factor de Reducción**: Reduce la resolución de la textura para un procesamiento más rápido.
fr: **Facteur de réduction** : Réduit la résolution de la texture pour un traitement plus rapide.

source: **Fast Algorithms**: Options like ``fast_bloom_`` provide a balance between performance and visual quality.
es: **Algoritmos Rápidos**: Opciones como ``fast_bloom_`` proporcionan un equilibrio entre rendimiento y calidad visual.
fr: **Algorithmes rapides** : Des options comme ``fast_bloom_`` offrent un équilibre entre les performances et la qualité visuelle.

source: Flexible Rendering
es: Renderizado Flexible
fr: Rendu flexible

source: Supports optional Pygame surfaces (``surface_``) for reusing textures and improving performance.
es: Soporta superficies de Pygame opcionales (``surface_``) para reutilizar texturas y mejorar el rendimiento.
fr: Prend en charge des surfaces Pygame optionnelles (``surface_``) pour réutiliser les textures et améliorer les performances.

source: Allows transposing the effect (``transpose_``) to change its orientation.
es: Permite transponer el efecto (``transpose_``) para cambiar su orientación.
fr: Permet de transposer l'effet (``transpose_``) pour changer son orientation.

source: Typical Workflow
es: Flujo de Trabajo Típico
fr: Flux de travail typique

source: **Initialize Parameters**: - Set the dimensions (``width_``, ``height_``), intensity, and other parameters for the effect. - Define a color palette (``palette_``) and intensity array (``fire_`` or ``cloud_``).
es: **Inicializar Parámetros**: - Establece las dimensiones (``width_``, ``height_``), intensidad y otros parámetros para el efecto. - Define una paleta de colores (``palette_``) y un array de intensidad (``fire_`` o ``cloud_``).
fr: **Initialiser les paramètres** : - Définissez les dimensions (``width_``, ``height_``), l'intensité et les autres paramètres pour l'effet. - Définissez une palette de couleurs (``palette_``) et un tableau d'intensité (``fire_`` ou ``cloud_``).

source: **Generate the Effect**: - Call the main functions (``fire_effect`` or ``cloud_effect``) to generate the effect. - Use optional parameters to customize the appearance and performance.
es: **Generar el Efecto**: - Llama a las funciones principales (``fire_effect`` o ``cloud_effect``) para generar el efecto. - Utiliza parámetros opcionales para personalizar la apariencia y el rendimiento.
fr: **Générer l'effet** : - Appelez les fonctions principales (``fire_effect`` ou ``cloud_effect``) pour générer l'effet. - Utilisez des paramètres optionnels pour personnaliser l'apparence et les performances.

source: **Render the Effect**: - The function returns a Pygame surface that can be blitted directly to the game display.
es: **Renderizar el Efecto**: - La función devuelve una superficie de Pygame que puede ser bliteada directamente en la pantalla del juego.
fr: **Rendre l'effet** : - La fonction retourne une surface Pygame qui peut être blittée directement sur l'affichage du jeu.

source: 4. Example Use Cases
es: 4. Casos de Uso Ejemplares
fr: 4. Cas d'utilisation exemples

source: Game Effects
es: Efectos de Juegos
fr: Effets de jeu

source: Create realistic fire effects for torches, explosions, or burning objects.
es: Crea efectos de fuego realistas para antorchas, explosiones u objetos en llamas.
fr: Créez des effets de feu réalistes pour des torches, des explosions ou des objets en feu.

source: Generate dynamic cloud or smoke effects for weather, magic spells, or environmental ambiance.
es: Genera efectos dinámicos de nubes o humo para clima, hechizos mágicos o ambiente ambiental.
fr: Générez des effets dynamiques de nuages ou de fumée pour le temps, les sorts magiques ou l'ambiance environnementale.

source: Simulations
es: Simulaciones

source: Use the library to simulate fire and smoke in scientific or educational applications.
es: Utiliza la biblioteca para simular fuego y humo en aplicaciones científicas o educativas.
fr: Utilisez la bibliothèque pour simuler le feu et la fumée dans des applications scientifiques ou éducatives.

source: Art and Animation
es: Arte y Animación
fr: Art et Animation

source: Generate procedural fire and cloud textures for use in animations or digital art.
es: Genera texturas de fuego y nubes procedurales para usar en animaciones o arte digital.
fr: Générez des textures procédurales de feu et de nuage pour une utilisation dans des animations ou de l'art numérique.

source: 5. Summary
es: 5. Resumen
fr: 5. Résumé

source: This library is a powerful tool for generating procedural fire and cloud effects in real-time applications. It combines flexibility, performance, and ease of use, making it suitable for game development, simulations, and artistic projects. The functions are highly customizable, allowing developers to fine-tune the appearance and behavior of the effects while maintaining optimal performance.
es: Esta biblioteca es una herramienta poderosa para generar efectos de fuego y nubes procedurales en aplicaciones en tiempo real. Combina flexibilidad, rendimiento y facilidad de uso, lo que la hace adecuada para el desarrollo de juegos, simulaciones y proyectos artísticos. Las funciones son altamente personalizables, permitiendo a los desarrolladores ajustar finamente la apariencia y comportamiento de los efectos mientras mantienen un rendimiento óptimo.
fr: Cette bibliothèque est un outil puissant pour générer des effets procéduraux de feu et de nuage pour les applications en temps réel. Elle combine flexibilité, performance et facilité d'utilisation, la rendant adaptée au développement de jeux, aux simulations et aux projets artistiques. Les fonctions sont hautement personnalisables, permettant aux développeurs de peaufiner l'apparence et le comportement des effets tout en maintenant des performances optimales.

source: 6. Video samples
es: 6. Muestras de Video
fr: 6. Exemples vidéo
