Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/GaussianBlur5x5.po
Languages: es, fr

source: Handles **edge pixels** by setting them to the nearest edge values.
es: Maneja los **píxeles de borde** asignándoles los valores del borde más cercano.
fr: Gère les **pixels de bord** en les définissant aux valeurs de bord les plus proches.

source: Allows **multiple blur passes** (`npass > 1`) for increased smoothing.
es: Permite **múltiples pasadas de desenfoque** (`npass > 1`) para un suavizado aumentado.
fr: Permet **plusieurs passes de flou** (`npass > 1`) pour un lissage accru.

source: **rgb_array** (*numpy.ndarray* or *memoryview slice*): A **3D array** of shape `(w, h, n)`, containing **uint8** values representing the image in **RGB(A) format**. The function modifies this array in-place.
es: **rgb_array** (*numpy.ndarray* o *memoryview slice*): Un **array 3D** de forma `(w, h, n)`, que contiene valores **uint8** que representan la imagen en **formato RGB(A)**. La función modifica este array in-place.
fr: **rgb_array** (*numpy.ndarray* ou *memoryview slice*): Un **tableau 3D** de forme `(w, h, n)`, contenant des valeurs **uint8** représentant l'image en **format RGB(A)**. La fonction modifie ce tableau sur place.

source: **npass** (*int*, optional): The number of blur passes to apply. **Default is `1`**. Higher values will **increase blur strength** but require more processing time.
es: **npass** (*int*, opcional): El número de pasadas de desenfoque a aplicar. **Por defecto es `1`**. Valores más altos **aumentarán la fuerza del desenfoque**, pero requerirán más tiempo de procesamiento.
fr: **npass** (*int*, optionnel) : Le nombre de passes de flou à appliquer. **La valeur par défaut est `1`**. Des valeurs plus élevées **augmenteront la force du flou** mais requerront plus de temps de traitement.

source: **None** – The function modifies `rgb_array` in place and does not return anything.
es: **Ninguno** – La función modifica `rgb_array` in-place y no devuelve nada.
fr: **Aucun** – La fonction modifie `rgb_array` en place et ne renvoie rien.

source: The function applies a **5x5 Gaussian blur** using the kernel:
es: La función aplica un **desenfoque Gaussiano de 5x5** utilizando el kernel:
fr: La fonction applique un **flou gaussien 5x5** en utilisant le noyau :

source: Uses **two-pass convolution** (horizontal and vertical) to apply the blur efficiently.
es: Usa **convolución en dos pasos** (horizontal y vertical) para aplicar el desenfoque de manera eficiente.
fr: Utilise une **convolution à deux passes** (horizontale et verticale) pour appliquer le flou de manière efficace.

source: Handles **edge pixels** by assigning the **nearest edge values** to prevent artifacts.
es: Maneja los **píxeles en los bordes** asignando los **valores de borde más cercanos** para prevenir artefactos.
fr: Gère les **pixels de bordure** en assignant les **valeurs de bordure les plus proches** pour prévenir les artefacts.

source: Optimized for **image processing**, **real-time rendering**, and **graphics effects**.
es: Optimizado para **procesamiento de imágenes**, **renderizado en tiempo real**, y **efectos gráficos**.
fr: Optimisé pour le **traitement d'images**, le **rendu en temps réel** et les **effets graphiques**.

source: Operates **directly on the image buffer**, avoiding extra memory allocations.
es: Opera **directamente sobre el búfer de la imagen**, evitando asignaciones adicionales de memoria.
fr: Fonctionne **directement sur le tampon d'image**, évitant ainsi des allocations de mémoire supplémentaires.

source: Can be used on large images without significant memory overhead.
es: Puede usarse en imágenes grandes sin sobrecargar significativamente la memoria.
fr: Peut être utilisé sur de grandes images sans une surcharge mémoire significative.

source: Optimized using **Cython** for high performance.
es: Optimizado usando **Cython** para un alto rendimiento.
fr: Optimisé avec **Cython** pour des performances élevées.

source: **Use Cases**
es: **Casos de uso**
fr: **Cas d'utilisation**

source: **Computer Vision** → Preprocessing for image segmentation and object detection.
es: **Visión por Computadora** → Preprocesamiento para segmentación de imágenes y detección de objetos.
fr: **Vision par ordinateur** → Prétraitement pour la segmentation d'images et la détection d'objets.

source: **Graphics & Gaming** → Motion blur, bloom effects, and real-time rendering.
es: **Gráficos y Videojuegos** → Desenfoque de movimiento, efectos de resplandor, y renderizado en tiempo real.
fr: **Graphismes et jeux** → Flou de mouvement, effets de bloom et rendu en temps réel.

source: **Image Processing Pipelines** → Reducing noise and enhancing visual quality.
es: **Pipelines de Procesamiento de Imágenes** → Reducir el ruido y mejorar la calidad visual.
fr: **Pipelines de traitement d'images** → Réduction du bruit et amélioration de la qualité visuelle.

source: **Medical Imaging** → Smoothing image data before feature extraction.
es: **Imágenes Médicas** → Suavizar los datos de imagen antes de la extracción de características.
fr: **Imagerie médicale** → Lissage des données d'image avant l'extraction des caractéristiques.

source: `blur` → Blurs a Pygame surface directly.
es: `blur` → Desenfoca directamente una superficie de Pygame.
fr: `flou` → Floute directement une surface Pygame.

source: `gauss_filter24` → Applies Gaussian filtering to a 24-bit image.
es: `gauss_filter24` → Aplica filtrado gaussiano a una imagen de 24 bits.
fr: `gauss_filter24` → Applique un filtrage gaussien sur une image de 24 bits.

source: `canny3d` → Performs edge detection on an RGB image.
es: `canny3d` → Realiza detección de bordes en una imagen RGB.
fr: `canny3d` → Effectue une détection des bords sur une image RGB.

source: **Apply an in-place Gaussian blur to a 1D array or memoryview slice representing pixel data.**
es: **Aplica un desenfoque gaussiano en el lugar a un arreglo 1D o una porción de memoria que representa los datos de los píxeles.**
fr: **Applique un flou gaussien en place sur un tableau 1D ou un tranche de memoryview représentant les données des pixels.**

source: This function applies a **Gaussian blur** on a 1D array (or memoryview slice) with shape `(w,)`, where `w` is the number of pixels. The array can represent either **BGR** (24-bit) or **BGRA** (32-bit) pixel formats or any other format compatible with the `uint8` data type. The blur operation is performed **in-place** on the provided array.
es: Esta función aplica un **desenfoque gaussiano** sobre un arreglo 1D (o una porción de memoria) con forma `(w,)`, donde `w` es el número de píxeles. El arreglo puede representar ya sea formatos de píxeles **BGR** (24 bits) o **BGRA** (32 bits) o cualquier otro formato compatible con el tipo de datos `uint8`. La operación de desenfoque se realiza **en el lugar** sobre el arreglo proporcionado.
fr: Cette fonction applique un **flou gaussien** sur un tableau 1D (ou une tranche de memoryview) de forme `(w,)`, où `w` est le nombre de pixels. Le tableau peut représenter des formats de pixels **BGR** (24 bits) ou **BGRA** (32 bits) ou tout autre format compatible avec le type de données `uint8`. L'opération de flou est effectuée **en place** sur le tableau fourni.

source: The function performs **npass** passes of convolution using a **5x5 Gaussian kernel**. This can be useful for image processing tasks where you need to apply a blur effect, especially on pixel data represented as a 1D array (such as when the image data is flattened).
es: La función realiza **npass** pasadas de convolución utilizando un **núcleo gaussiano de 5x5**. Esto puede ser útil para tareas de procesamiento de imágenes donde necesitas aplicar un efecto de desenfoque, especialmente sobre datos de píxeles representados como un arreglo 1D (como cuando los datos de la imagen están aplanados).
fr: La fonction effectue **npass** passes de convolution en utilisant un **noyau gaussien 5x5**. Cela peut être utile pour les tâches de traitement d'images où vous devez appliquer un effet de flou, en particulier sur des données de pixels représentées sous forme de tableau 1D (comme lorsque les données de l'image sont aplaties).

source: **Parameters:**
es: **Parámetros:**
fr: **Paramètres :**

source: **bgr_array** (*1D numpy.ndarray* or *memoryview slice*): A 1D array or memoryview slice with shape `(w,)` containing pixel data (e.g., in **BGR(A)** or any other pixel format). The array should be of type **uint8**.
es: **bgr_array** (*1D numpy.ndarray* o *porción de memoria*): Un arreglo 1D o una porción de memoria con forma `(w,)` que contiene los datos de los píxeles (por ejemplo, en **BGR(A)** o cualquier otro formato de píxeles). El arreglo debe ser de tipo **uint8**.
fr: **bgr_array** (*1D numpy.ndarray* ou *tranche memoryview*) : Un tableau 1D ou une tranche de memoryview de forme `(w,)` contenant les données des pixels (par exemple, en **BGR(A)** ou tout autre format de pixel). Le tableau doit être de type **uint8**.

source: **width** (*int*): The width (`w`) of the original image. Used for proper handling during the blur operation.
es: **ancho** (*int*): El ancho (`w`) de la imagen original. Se usa para un manejo correcto durante la operación de desenfoque.
fr: **largeur** (*int*) : La largeur (`w`) de l'image originale. Utilisé pour un traitement correct lors de l'opération de flou.

source: **height** (*int*): The height (`h`) of the original image. Required for correct image processing.
es: **altura** (*int*): La altura (`h`) de la imagen original. Requerida para un procesamiento correcto de la imagen.
fr: **hauteur** (*int*) : La hauteur (`h`) de l'image originale. Nécessaire pour un traitement correct de l'image.

source: **npass** (*int*, optional): The number of blur passes to apply. **Default is 1 pass**. More passes result in a stronger blur.
es: **npass** (*int*, opcional): El número de pasadas de desenfoque a aplicar. **El valor predeterminado es 1 pasada**. Más pasadas resultan en un desenfoque más fuerte.
fr: **npass** (*int*, optionnel) : Le nombre de passes de flou à appliquer. **La valeur par défaut est 1 passe**. Plus de passes donnent un flou plus fort.

source: **format_32** (*bool*): A flag indicating whether the pixel format is **BGR (24-bit)** or **BGRA (32-bit)**. `False` for **BGR (24-bit)** (3 channels) and `True` for **BGRA (32-bit)** (4 channels).
es: **format_32** (*bool*): Un indicador de si el formato de píxeles es **BGR (24 bits)** o **BGRA (32 bits)**. `False` para **BGR (24 bits)** (3 canales) y `True` para **BGRA (32 bits)** (4 canales).
fr: **format_32** (*bool*) : Un indicateur pour savoir si le format des pixels est **BGR (24 bits)** ou **BGRA (32 bits)**. `False` pour **BGR (24 bits)** (3 canaux) et `True` pour **BGRA (32 bits)** (4 canaux).

source: **Returns:**
es: **Retorna:**
fr: **Renvoie :**

source: **None**: The function performs the blur in-place on `bgr_array` and does not return a value.
es: **Ninguno**: La función realiza el desenfoque en el lugar sobre `bgr_array` y no retorna un valor.
fr: **Aucun** : La fonction effectue le flou en place sur `bgr_array` et ne renvoie pas de valeur.

source: The function uses **Gaussian convolution** with a 5x5 kernel used in two passes.
es: La función usa **convolución gaussiana** con un núcleo de 5x5 utilizado en dos pasadas.
fr: La fonction utilise la **convolution gaussienne** avec un noyau 5x5 utilisé en deux passes.

source: The image is processed in two passes (horizontal and vertical) for efficiency.
es: La imagen se procesa en dos pasadas (horizontal y vertical) para eficiencia.
fr: L'image est traitée en deux passes (horizontale et verticale) pour plus d'efficacité.

source: **Edge handling**: Pixels outside the image boundaries are replaced by adjacent edge values.
es: **Manejo de bordes**: Los píxeles fuera de los límites de la imagen se reemplazan por los valores adyacentes de los bordes.
fr: **Gestion des bords** : Les pixels en dehors des limites de l'image sont remplacés par les valeurs des bords adjacents.

source: The function operates **in-place**, meaning the original `bgr_array` is modified directly.
es: La función opera **in-place**, lo que significa que el `bgr_array` original se modifica directamente.
fr: La fonction fonctionne **en place**, ce qui signifie que le tableau `bgr_array` original est directement modifié.

source: This function is compatible with **BGR** and **BGRA** pixel formats (or other formats with the same shape and data type).
es: Esta función es compatible con los formatos de píxeles **BGR** y **BGRA** (o cualquier otro formato con la misma forma y tipo de datos).
fr: Cette fonction est compatible avec les formats de pixels **BGR** et **BGRA** (ou d'autres formats ayant la même forme et le même type de données).

source: Apply a blur effect to a 1D buffer (memoryview slice) and return a copy.
es: Aplica un efecto de desenfoque a un búfer 1D (rebanada de memoria) y devuelve una copia.
fr: Applique un effet de flou à un tampon 1D (tranche de memoryview) et renvoie une copie.

source: This function takes a **1D buffer or memoryview slice** containing pixel data in **BGR(A)** format (or any other compatible pixel format) and applies a **Gaussian blur**. The blurred result is returned as a new array, leaving the original buffer unmodified.
es: Esta función toma un **búfer 1D o rebanada de memoria** que contiene datos de píxeles en formato **BGR(A)** (o cualquier otro formato de píxeles compatible) y aplica un **desenfoque Gaussiano**. El resultado desenfocado se devuelve como una nueva matriz, dejando el búfer original sin modificar.
fr: Cette fonction prend un **tampon 1D ou une tranche de memoryview** contenant les données des pixels au format **BGR(A)** (ou tout autre format de pixel compatible) et applique un **flou gaussien**. Le résultat flouté est renvoyé comme un nouveau tableau, laissant le tampon original inchangé.

source: The function supports both **24-bit (BGR)** and **32-bit (BGRA)** pixel formats. The `format_32` flag must be set accordingly:
es: La función es compatible con los formatos de píxeles **24-bit (BGR)** y **32-bit (BGRA)**. El indicador `format_32` debe configurarse de acuerdo con ello:
fr: La fonction prend en charge les formats de pixels **24 bits (BGR)** et **32 bits (BGRA)**. Le paramètre `format_32` doit être défini en conséquence :

source: **`format_32=False`** → for **BGR (24-bit)** format.
es: **`format_32=False`** → para formato **BGR (24 bits)**.
fr: **`format_32=False`** → pour le format **BGR (24 bits)**.

source: **`format_32=True`** → for **BGRA (32-bit)** format (includes an alpha channel).
es: **`format_32=True`** → para formato **BGRA (32 bits)** (incluye un canal alfa).
fr: **`format_32=True`** → pour le format **BGRA (32 bits)** (inclut un canal alpha).

source: **Example Usage:**
es: **Ejemplo de uso:**
fr: **Exemple d'utilisation :**

source: **For a 24-bit image (BGR format):**
es: **Para una imagen de 24 bits (formato BGR):**
fr: **Pour une image 24 bits (format BGR) :**

source: **For a 32-bit image (BGRA format):**
es: **Para una imagen de 32 bits (formato BGRA):**
fr: **Pour une image 32 bits (format BGRA) :**

source: **bgr_array** (*C-buffer, numpy.ndarray, or memoryview slice*): A **1D array** with shape `(w,)` containing **BGR(A)** pixel data (or any compatible format).
es: **bgr_array** (*C-buffer, numpy.ndarray o rebanada de memoria*): Un **array 1D** con forma `(w,)` que contiene datos de píxeles **BGR(A)** (o cualquier formato compatible).
fr: **bgr_array** (*C-buffer, numpy.ndarray, ou tranche de memoryview*): Un **tableau 1D** de forme `(w,)` contenant des données de pixels **BGR(A)** (ou tout format compatible).

source: **width** (*int*): The width of the original image in pixels.
es: **width** (*int*): El ancho de la imagen original en píxeles.
fr: **width** (*int*): La largeur de l'image originale en pixels.

source: **height** (*int*): The height of the original image in pixels.
es: **height** (*int*): La altura de la imagen original en píxeles.
fr: **height** (*int*): La hauteur de l'image originale en pixels.

source: **npass** (*int*, optional): The number of blur passes to apply (**default is 1**). Increasing this value intensifies the blur effect.
es: **npass** (*int*, opcional): El número de pasadas de desenfoque a aplicar (**el valor predeterminado es 1**). Aumentar este valor intensifica el efecto de desenfoque.
fr: **npass** (*int*, optionnel): Le nombre de passes de flou à appliquer (**par défaut, 1**). Augmenter cette valeur intensifie l'effet de flou.

source: **format_32** (*bool*): - `True` → **BGRA (32-bit)** format (includes an alpha channel). - `False` → **BGR (24-bit)** format.
es: **format_32** (*bool*): - `True` → formato **BGRA (32 bits)** (incluye un canal alfa). - `False` → formato **BGR (24 bits)**.
fr: **format_32** (*bool*): - `True` → format **BGRA (32 bits)** (inclut un canal alpha). - `False` → format **BGR (24 bits)**.

source: **numpy.ndarray** or **memoryview slice** (`shape (w,)`, `dtype=uint8`): A **blurred copy** of the input array, maintaining the original pixel format.
es: **numpy.ndarray** o **rebanada de memoria** (`shape (w,)`, `dtype=uint8`): Una **copia desenfocada** del array de entrada, manteniendo el formato de píxeles original.
fr: **numpy.ndarray** ou **tranche de memoryview** (`shape (w,)`, `dtype=uint8`): Une **copie floutée** du tableau d'entrée, maintenant le format de pixel original.

source: This function does **not modify the input buffer**; it returns a **new** blurred array.
es: Esta función **no modifica el búfer de entrada**; devuelve un **nuevo** array desenfocado.
fr: Cette fonction **ne modifie pas le tampon d'entrée**; elle renvoie un **nouveau** tableau flouté.

source: The blur operation uses **Gaussian convolution** in multiple passes.
es: La operación de desenfoque utiliza **convolución gaussiana** en varias pasadas.
fr: L'opération de flou utilise la **convolution gaussienne** en plusieurs passes.

source: The **pixel format of the output array is identical** to the input buffer.
es: El **formato de píxeles del array de salida es idéntico** al del búfer de entrada.
fr: Le **format de pixel du tableau de sortie est identique** à celui du tampon d'entrée.

source: Providing an appropriate `format_32` flag ensures correct handling of alpha transparency.
es: Proporcionar un indicador `format_32` adecuado asegura el manejo correcto de la transparencia alfa.
fr: Fournir un indicateur `format_32` approprié garantit une gestion correcte de la transparence alpha.

source: Apply a 5x5 Gaussian filter to smooth an image or surface. This function performs Gaussian blurring using a 5x5 convolution kernel, which helps reduce noise and detail in an image. It is particularly useful for preprocessing images before edge detection or other computer vision tasks.
es: Aplica un filtro Gaussiano de 5x5 para suavizar una imagen o superficie. Esta función realiza un desenfoque Gaussiano utilizando un núcleo de convolución 5x5, lo que ayuda a reducir el ruido y los detalles en una imagen. Es especialmente útil para el preprocesamiento de imágenes antes de la detección de bordes u otras tareas de visión por computadora.
fr: Appliquez un filtre gaussien 5x5 pour lisser une image ou une surface. Cette fonction effectue un flou gaussien à l'aide d'un noyau de convolution 5x5, ce qui aide à réduire le bruit et les détails dans une image. Il est particulièrement utile pour le prétraitement des images avant la détection des bords ou d'autres tâches de vision par ordinateur.

source: **5x5 Gaussian Kernel:**
es: **Núcleo Gaussiano 5x5:**
fr: **Noyau Gaussien 5x5 :**

source: The kernel values are normalized internally to ensure proper smoothing.
es: Los valores del núcleo se normalizan internamente para asegurar un suavizado adecuado.
fr: Les valeurs du noyau sont normalisées en interne pour garantir un lissage approprié.

source: The filtering process preserves edges better than a simple average blur.
es: El proceso de filtrado preserva mejor los bordes que un desenfoque promedio simple.
fr: Le processus de filtrage préserve mieux les bords qu'un simple flou moyen.

source: **surface_ (pygame.Surface, 24-bit or 32-bit image):**
es: **surface_ (pygame.Surface, imagen de 24 o 32 bits):**
fr: **surface_ (pygame.Surface, image 24 bits ou 32 bits) :**

source: The input image or surface to be blurred.
es: La imagen o superficie de entrada a ser desenfocada.
fr: L'image ou la surface d'entrée à flouter.

source: If a 32-bit surface (with an alpha channel) is provided, the alpha layer is ignored in the output, resulting in a 24-bit image.
es: Si se proporciona una superficie de 32 bits (con un canal alfa), la capa alfa se ignora en la salida, resultando en una imagen de 24 bits.
fr: Si une surface 32 bits (avec un canal alpha) est fournie, le canal alpha est ignoré dans la sortie, ce qui donne une image 24 bits.

source: **pygame.Surface (24-bit filtered image):** - A new blurred surface with reduced noise and smoothed pixel transitions. - The output image is always 24-bit, even if the input was 32-bit.
es: **pygame.Surface (imagen filtrada de 24 bits):** - Una nueva superficie desenfocada con ruido reducido y transiciones de píxeles suavizadas. - La imagen de salida es siempre de 24 bits, incluso si la entrada era de 32 bits.
fr: **pygame.Surface (image filtrée 24 bits) :** - Une nouvelle surface floutée avec moins de bruit et des transitions de pixels lissées. - L'image de sortie est toujours en 24 bits, même si l'entrée était en 32 bits.

source: Gaussian blur is widely used in computer vision and graphics for reducing high-frequency noise.
es: El desenfoque gaussiano se utiliza ampliamente en visión por computadora y gráficos para reducir el ruido de alta frecuencia.
fr: Le flou gaussien est largement utilisé en vision par ordinateur et en graphisme pour réduire le bruit haute fréquence.

source: This method is optimized for performance and maintains image integrity.
es: Este método está optimizado para el rendimiento y mantiene la integridad de la imagen.
fr: Cette méthode est optimisée pour la performance et préserve l'intégrité de l'image.

source: Apply a 5x5 Gaussian blur filter to an image or pygame surface. This function smooths an image by convolving it with a 5x5 Gaussian kernel, reducing noise and fine details while preserving essential structures. 5x5 Gaussian Kernel:
es: Aplica un filtro de desenfoque gaussiano 5x5 a una imagen o superficie de pygame. Esta función suaviza una imagen al convolucionarla con un núcleo gaussiano 5x5, reduciendo el ruido y los detalles finos mientras preserva las estructuras esenciales. Núcleo Gaussiano 5x5:
fr: Appliquez un filtre de flou gaussien 5x5 à une image ou une surface pygame. Cette fonction lisse une image en la convoluant avec un noyau gaussien 5x5, réduisant le bruit et les détails fins tout en préservant les structures essentielles. Noyau Gaussien 5x5 :

source: This method helps remove high-frequency noise while retaining important image structures.
es: Este método ayuda a eliminar el ruido de alta frecuencia mientras retiene las estructuras importantes de la imagen.
fr: Cette méthode aide à éliminer le bruit haute fréquence tout en conservant les structures importantes de l'image.

source: **surface_ (pygame.Surface, 32-bit or 24-bit image):**
es: **superficie_ (pygame.Surface, imagen de 32 bits o 24 bits):**
fr: **surface_ (pygame.Surface, image 32 bits ou 24 bits) :**

source: Both 24-bit (RGB) and 32-bit (RGBA) surfaces are supported.
es: Se admiten superficies de 24 bits (RGB) y de 32 bits (RGBA).
fr: Les surfaces 24 bits (RGB) et 32 bits (RGBA) sont toutes deux prises en charge.

source: pygame.Surface (32-bit filtered image):
es: pygame.Surface (imagen filtrada de 32 bits):
fr: pygame.Surface (image filtrée 32 bits) :
