Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/GaussianBlur5x5.po
Languages: es, fr

source: :mod:`GaussianBlur5x5.pyx`
fr: :mod:`FlouGaussien5x5.pyx`

source: 1. Summary of the Library
es: 1. Resumen de la Biblioteca
fr: 1. Résumé de la bibliothèque

source: This Python library provides fast and efficient **image processing** functions, focusing on **blurring**, **Gaussian filtering**, and **edge detection**. It is implemented in **Cython** for high performance, making it ideal for applications in **computer vision**, **graphics**, and **image preprocessing**.
es: Esta biblioteca de Python proporciona funciones rápidas y eficientes de **procesamiento de imágenes**, centrándose en **desenfoque**, **filtrado Gaussiano** y **detección de bordes**. Está implementada en **Cython** para un alto rendimiento, lo que la hace ideal para aplicaciones en **visión por computadora**, **gráficos** y **preprocesamiento de imágenes**.
fr: Cette bibliothèque Python fournit des fonctions de **traitement d'images** rapides et efficaces, se concentrant sur **le flou**, **le filtrage gaussien**, et **la détection de bords**. Elle est implémentée en **Cython** pour des performances élevées, ce qui la rend idéale pour les applications en **vision par ordinateur**, **graphisme**, et **prétraitement d'images**.

source: 2. Purpose
es: 2. Propósito
fr: 2. Objectif

source: The library is designed to perform fast blurring and edge detection, which are essential for:
es: La biblioteca está diseñada para realizar desenfoque y detección de bordes rápidos, que son esenciales para:
fr: La bibliothèque est conçue pour effectuer des flous rapides et la détection de bords, ce qui est essentiel pour :

source: **Noise reduction** (smoothing images).
es: **Reducción de ruido** (suavizado de imágenes).
fr: **Réduction du bruit** (lissage des images).

source: **Edge detection** (for object recognition and feature extraction).
es: **Detección de bordes** (para reconocimiento de objetos y extracción de características).
fr: **Détection de bords** (pour la reconnaissance d'objets et l'extraction de caractéristiques).

source: **Graphics effects** (motion blur, bloom effects).
es: **Efectos gráficos** (desenfoque de movimiento, efectos de bloom).
fr: **Effets graphiques** (flou de mouvement, effets de lueur).

source: **Preprocessing for computer vision tasks** (image segmentation, filtering).
es: **Preprocesamiento para tareas de visión por computadora** (segmentación de imágenes, filtrado).
fr: **Prétraitement pour les tâches de vision par ordinateur** (segmentation d'images, filtrage).

source: 3. Main Features
es: 3. Características Principales
fr: 3. Fonctionnalités principales

source: **Blurring Functions**
es: **Funciones de Desenfoque**
fr: **Fonctions de flou**

source: These functions apply various types of blurring to smooth images:
es: Estas funciones aplican varios tipos de desenfoque para suavizar imágenes:
fr: Ces fonctions appliquent différents types de flou pour lisser les images :

source: **`blur(surface_, npass)`**:
fr: **`flou(surface_, npass)`** :

source: Blurs an image surface, where `npass` controls intensity.
es: Desenfoca una superficie de imagen, donde `npass` controla la intensidad.
fr: Applique un flou à une surface d'image, où `npass` contrôle l'intensité.

source: **`blur3d(rgb_array, npass)`**:
fr: **`flou3d(rgb_array, npass)`** :

source: Blurs a 3D (RGB) image array.
es: Desenfoca un array de imagen 3D (RGB).
fr: Applique un flou à un tableau d'image 3D (RGB).

source: **`blur1d(bgr_array, width, height, npass, format_32)`**:
fr: **`flou1d(bgr_array, width, height, npass, format_32)`** :

source: Optimized 1D blurring for efficiency.
es: Desenfoque 1D optimizado para eficiencia.
fr: Flou 1D optimisé pour l'efficacité.

source: **`blur1d_cp(bgr_array, width, height, npass, format_32)`**:
fr: **`flou1d_cp(bgr_array, width, height, npass, format_32)`** :

source: Returns a new blurred array instead of modifying in-place.
es: Devuelve un nuevo array desenfocado en lugar de modificarlo en el lugar.
fr: Retourne un nouveau tableau flouté au lieu de modifier l'original.

source: **`blur4bloom_c(surface_, npass, tmp_array)`**:
fr: **`flou4bloom_c(surface_, npass, tmp_array)`** :

source: Likely used for bloom effects, enhancing bright areas.
es: Probablemente utilizado para efectos de bloom, mejorando las áreas brillantes.
fr: Probablement utilisé pour des effets de lueur, en renforçant les zones lumineuses.

source: Several internal **Cython-optimized** versions (`blur3d_c`, `blur1d_c`, etc.) run without the **Global Interpreter Lock (GIL)** for multi-threading support.
es: Varias versiones internas **optimizadas con Cython** (`blur3d_c`, `blur1d_c`, etc.) se ejecutan sin el **Global Interpreter Lock (GIL)** para soportar multi-hilos.
fr: Plusieurs versions internes **optimisées en Cython** (`blur3d_c`, `blur1d_c`, etc.) fonctionnent sans le **Global Interpreter Lock (GIL)** pour le support du multithreading.

source: **Gaussian Filtering**
es: **Filtrado Gaussiano**
fr: **Filtrage Gaussien**

source: **`gauss_filter24(surface_)`**:
fr: **`filtre_gaussien24(surface_)`** :

source: Applies Gaussian blur to a 24-bit image.
es: Aplica un desenfoque Gaussiano a una imagen de 24 bits.
fr: Applique un flou gaussien à une image 24 bits.

source: **`gauss_filter32(surface_)`**:
fr: **`filtre_gaussien32(surface_)`** :

source: Applies Gaussian blur to a 32-bit image.
es: Aplica un desenfoque Gaussiano a una imagen de 32 bits.
fr: Applique un flou gaussien à une image 32 bits.

source: 📌 **Why Gaussian Blur?**
es: 📌 **¿Por qué Desenfoque Gaussiano?**
fr: 📌 **Pourquoi le flou gaussien ?**

source: It helps smooth images before edge detection, reducing false edges caused by noise.
es: Ayuda a suavizar las imágenes antes de la detección de bordes, reduciendo los bordes falsos causados por el ruido.
fr: Il aide à lisser les images avant la détection des bords, réduisant les faux bords causés par le bruit.

source: **Edge Detection (Canny Algorithm)**
es: **Detección de Bordes (Algoritmo de Canny)**
fr: **Détection des bords (Algorithme de Canny)**

source: The **Canny algorithm** is widely used in computer vision to detect object boundaries.
es: El **algoritmo de Canny** es ampliamente utilizado en visión por computadora para detectar límites de objetos.
fr: L'**algorithme de Canny** est largement utilisé en vision par ordinateur pour détecter les contours des objets.

source: **`canny3d(rgb_array, threshold, low, high)`**:
fr: **`canny3d(rgb_array, seuil, bas, haut)`** :

source: Detects edges in an RGB image.
es: Detecta bordes en una imagen RGB.
fr: Détecte les bords dans une image RGB.

source: **`canny1d(bgr_array, width, height, format_32, threshold)`**:
fr: **`canny1d(bgr_array, largeur, hauteur, format_32, seuil)`** :

source: Detects edges in a linear 1D image representation for efficiency.
es: Detecta bordes en una representación lineal 1D de la imagen para mayor eficiencia.
fr: Détecte les bords dans une représentation linéaire 1D de l'image pour plus d'efficacité.

source: There are also **Cython-optimized** versions (`canny3d_c`, `canny1d_c`) that improve performance using multi-threading.
es: También hay versiones **optimizadas con Cython** (`canny3d_c`, `canny1d_c`) que mejoran el rendimiento utilizando multi-hilos.
fr: Il existe également des versions **optimisées en Cython** (`canny3d_c`, `canny1d_c`) qui améliorent les performances en utilisant le multi-threading.

source: **Optimization Features**
es: **Características de Optimización**
fr: **Fonctionnalités d'optimisation**

source: **Cython-based** (`cdef`, `cpdef`, `nogil`) → Direct C-level performance.
es: **Basado en Cython** (`cdef`, `cpdef`, `nogil`) → Rendimiento directo a nivel C.
fr: **Basé sur Cython** (`cdef`, `cpdef`, `nogil`) → Performances au niveau C direct.

source: **In-place operations** (`blur1d`, `blur3d`) → Saves memory.
es: **Operaciones in-place** (`blur1d`, `blur3d`) → Ahorra memoria.
fr: **Opérations sur place** (`flou1d`, `flou3d`) → Économise de la mémoire.

source: **Multi-threading** (`nogil`) → Faster execution on multi-core processors.
es: **Multi-hilos** (`nogil`) → Ejecución más rápida en procesadores multi-núcleo.
fr: **Multi-threading** (`nogil`) → Exécution plus rapide sur des processeurs multicœurs.

source: **Optimized memory handling** (`[::1]` memory views) → Reduces Python overhead.
es: **Manejo optimizado de memoria** (`[::1]` vistas de memoria) → Reduce la sobrecarga de Python.
fr: **Gestion optimisée de la mémoire** (`[::1]` vues mémoire) → Réduit la surcharge Python.

source: 4. Use Cases
es: 4. Casos de Uso
fr: 4. Cas d'utilisation

source: **Computer Vision** → Object recognition, feature extraction.
es: **Visión por Computadora** → Reconocimiento de objetos, extracción de características.
fr: **Vision par ordinateur** → Reconnaissance d'objets, extraction de caractéristiques.

source: **Graphics & Gaming** → Motion blur, bloom effects.
es: **Gráficos y Juegos** → Desenfoque de movimiento, efectos de bloom.
fr: **Graphismes et jeux** → Flou de mouvement, effets de lueur.

source: **Image Processing Pipelines** → Preprocessing before machine learning models.
es: **Procesamiento de Imágenes** → Preprocesamiento antes de modelos de aprendizaje automático.
fr: **Pipelines de traitement d'images** → Prétraitement avant les modèles d'apprentissage automatique.

source: **Medical Imaging** → Enhancing and detecting features in scans.
es: **Imágenes Médicas** → Mejora y detección de características en escaneos.
fr: **Imagerie médicale** → Amélioration et détection de caractéristiques dans les scans.

source: This library is highly optimized for fast blurring, Gaussian filtering, and edge detection, making it a great choice for **computer vision**, **graphics**, and **machine learning applications** where speed is critical.
es: Esta biblioteca está altamente optimizada para desenfoque rápido, filtrado Gaussiano y detección de bordes, lo que la convierte en una excelente opción para **visión por computadora**, **gráficos** y **aplicaciones de aprendizaje automático** donde la velocidad es crítica.
fr: Cette bibliothèque est hautement optimisée pour un flou rapide, un filtrage gaussien et la détection de bords, ce qui en fait un excellent choix pour la **vision par ordinateur**, les **graphismes** et les **applications d'apprentissage automatique** où la vitesse est cruciale.

source: 6. Cython list methods
es: 6. Métodos de listas en Cython
fr: 6. Méthodes de liste Cython

source: **Parameters**: - `surface_` (*pygame.Surface*): A Pygame surface object (24-bit or 32-bit). - `npass` (*int*, optional): The number of blur passes to apply (default is 1). Must be a positive integer.
es: **Parámetros**: - `surface_` (*pygame.Surface*): Un objeto de superficie de Pygame (24 bits o 32 bits). - `npass` (*int*, opcional): El número de pasadas de desenfoque a aplicar (por defecto es 1). Debe ser un entero positivo.
fr: **Paramètres** : - `surface_` (*pygame.Surface*): Un objet surface Pygame (24 bits ou 32 bits). - `npass` (*int*, optionnel): Le nombre de passes de flou à appliquer (la valeur par défaut est 1). Doit être un entier positif.

source: **Returns**: None
es: **Devuelve**: Ninguno
fr: **Retourne** : Rien

source: **Description**: Apply an in-place Gaussian blur effect to a Pygame surface.
es: **Descripción**: Aplica un efecto de desenfoque Gaussiano in-place a una superficie de Pygame.
fr: **Description** : Applique un effet de flou gaussien sur place à une surface Pygame.

source: This function performs a **two-pass convolution** using a **5x5 Gaussian kernel** to blur the input surface. The first pass applies the blur horizontally, and the second pass applies the blur vertically. For pixels outside the image boundaries, the function assigns the nearest edge value to reduce visual artifacts.
es: Esta función realiza una **convolución de dos pasadas** utilizando un **kernel Gaussiano de 5x5** para desenfocar la superficie de entrada. La primera pasada aplica el desenfoque horizontalmente, y la segunda pasada lo aplica verticalmente. Para los píxeles fuera de los límites de la imagen, la función asigna el valor del borde más cercano para reducir artefactos visuales.
fr: Cette fonction effectue une **convolution à deux passes** en utilisant un **noyau gaussien 5x5** pour flouter la surface d'entrée. La première passe applique le flou horizontalement, et la deuxième passe applique le flou verticalement. Pour les pixels en dehors des limites de l'image, la fonction attribue la valeur du bord le plus proche pour réduire les artefacts visuels.

source: **Features**
es: **Características**
fr: **Caractéristiques**

source: Supports **24-bit (RGB)** and **32-bit (RGBA)** Pygame surfaces.
es: Soporta superficies de Pygame de **24 bits (RGB)** y **32 bits (RGBA)**.
fr: Prend en charge les surfaces Pygame **24 bits (RGB)** et **32 bits (RGBA)**.

source: Uses a **5x5 Gaussian kernel** for smoothing the image.
es: Utiliza un **kernel Gaussiano de 5x5** para suavizar la imagen.
fr: Utilise un **noyau gaussien 5x5** pour lisser l'image.

source: Allows **multiple passes** (`npass > 1`) for enhanced blur intensity.
es: Permite **múltiples pasadas** (`npass > 1`) para una intensidad de desenfoque mejorada.
fr: Permet **plusieurs passes** (`npass > 1`) pour une intensité de flou améliorée.

source: Ignores the **alpha channel** during processing to avoid altering transparency.
es: Ignora el **canal alfa** durante el procesamiento para evitar alterar la transparencia.
fr: Ignore le **canal alpha** pendant le traitement afin d'éviter d'altérer la transparence.

source: **Parameters**
es: **Parámetros**
fr: **Paramètres**

source: **surface_** (*pygame.Surface*): A Pygame surface object to which the blur effect will be applied. It must be either **24-bit RGB** or **32-bit RGBA**. The function modifies the surface in-place.
es: **surface_** (*pygame.Surface*): Un objeto de superficie de Pygame al que se aplicará el efecto de desenfoque. Debe ser de **24 bits RGB** o **32 bits RGBA**. La función modifica la superficie in-place.
fr: **surface_** (*pygame.Surface*): Un objet surface Pygame auquel l'effet de flou sera appliqué. Il doit être soit en **RGB 24 bits**, soit en **RGBA 32 bits**. La fonction modifie la surface sur place.

source: **npass** (*int*, optional): The number of blur passes to apply. Default is **1**. Must be a **positive integer** (`npass > 0`). Multiple passes result in a stronger blur effect but may increase processing time.
es: **npass** (*int*, opcional): El número de pasadas de desenfoque a aplicar. Por defecto es **1**. Debe ser un **entero positivo** (`npass > 0`). Múltiples pasadas resultan en un efecto de desenfoque más fuerte, pero pueden aumentar el tiempo de procesamiento.
fr: **npass** (*int*, optionnel) : Le nombre de passes de flou à appliquer. La valeur par défaut est **1**. Doit être un **entier positif** (`npass > 0`). Plus de passes entraînent un effet de flou plus fort, mais peuvent augmenter le temps de traitement.

source: **Returns**
es: **Devuelve**
fr: **Retourne**

source: **None** – The function modifies `surface_` in place, with no return value.
es: **Ninguno** – La función modifica `surface_` in-place, sin devolver ningún valor.
fr: **Rien** – La fonction modifie `surface_` sur place, sans valeur de retour.

source: **Raises**
es: **Lanza**
fr: **Lève**

source: **TypeError**: If `surface_` is not a valid `pygame.Surface` object.
es: **TypeError**: Si `surface_` no es un objeto válido de `pygame.Surface`.
fr: **TypeError** : Si `surface_` n'est pas un objet `pygame.Surface` valide.

source: **ValueError**: If the surface format is incompatible (e.g., non-24-bit or non-32-bit format) or cannot be processed.
es: **ValueError**: Si el formato de la superficie es incompatible (por ejemplo, no es de 24 bits o 32 bits) o no puede ser procesado.
fr: **ValueError** : Si le format de la surface est incompatible (par exemple, format non 24 bits ou non 32 bits) ou ne peut pas être traité.

source: **ValueError**: If `npass` is not a positive integer (`npass <= 0`).
es: **ValueError**: Si `npass` no es un entero positivo (`npass <= 0`).
fr: **ValueError** : Si `npass` n'est pas un entier positif (`npass <= 0`).

source: **Implementation Details**
es: **Detalles de Implementación**
fr: **Détails de l'implémentation**

source: The function accesses the pixel buffer of the surface directly using `get_view('3')`, which allows it to process **only the RGB channels**, ignoring the alpha channel.
es: La función accede directamente al búfer de píxeles de la superficie utilizando `get_view('3')`, lo que le permite procesar **solo los canales RGB**, ignorando el canal alfa.
fr: La fonction accède directement au tampon des pixels de la surface en utilisant `get_view('3')`, ce qui lui permet de traiter **uniquement les canaux RGB**, en ignorant le canal alpha.

source: It calls an optimized Cython function, `blur3d_c()`, to perform the in-place blurring with minimal overhead.
es: Llama a una función optimizada de Cython, `blur3d_c()`, para realizar el desenfoque in-place con un mínimo de sobrecarga.
fr: Elle appelle une fonction Cython optimisée, `blur3d_c()`, pour effectuer le flou sur place avec un minimum de frais généraux.

source: If `npass > 1`, multiple blur passes are applied for a stronger effect, but this increases the processing time.
es: Si `npass > 1`, se aplican múltiples pasadas de desenfoque para un efecto más fuerte, pero esto aumenta el tiempo de procesamiento.
fr: Si `npass > 1`, plusieurs passes de flou sont appliquées pour un effet plus fort, mais cela augmente le temps de traitement.

source: **Memory Efficiency**
es: **Eficiencia de Memoria**
fr: **Efficacité mémoire**

source: This function is **memory-efficient**, as it operates directly on the surface buffer without creating additional copies of the image data.
es: Esta función es **eficiente en memoria**, ya que opera directamente en el búfer de la superficie sin crear copias adicionales de los datos de la imagen.
fr: Cette fonction est **efficace en mémoire**, car elle opère directement sur le tampon de la surface sans créer de copies supplémentaires des données de l'image.

source: If the surface has an **alpha channel**, it is **ignored** during processing, meaning any transparency information will remain unchanged.
es: Si la superficie tiene un **canal alfa**, este es **ignorado** durante el procesamiento, lo que significa que cualquier información de transparencia permanecerá sin cambios.
fr: Si la surface possède un **canal alpha**, il est **ignoré** pendant le traitement, ce qui signifie que toute information de transparence restera inchangée.

source: **Performance Considerations**
es: **Consideraciones de Rendimiento**
fr: **Considérations sur les performances**

source: The function is optimized using Cython to minimize overhead and improve performance.
es: La función está optimizada utilizando Cython para minimizar la sobrecarga y mejorar el rendimiento.
fr: La fonction est optimisée en utilisant Cython pour minimiser les frais généraux et améliorer les performances.

source: It supports **multi-threading** when using Cython's `nogil` feature for enhanced execution speed on multi-core systems.
es: Soporta **multi-hilos** cuando se utiliza la función `nogil` de Cython para una velocidad de ejecución mejorada en sistemas multi-núcleo.
fr: Elle prend en charge le **multi-threading** lorsqu'elle utilise la fonctionnalité `nogil` de Cython pour améliorer la vitesse d'exécution sur des systèmes multi-cœurs.

source: **Example Usage**
es: **Ejemplo de Uso**
fr: **Exemple d'utilisation**

source: **See Also**
es: **Ver También**
fr: **Voir aussi**

source: `blur3d_c`: Optimized Cython function for 3D image blurring.
es: `blur3d_c`: Función optimizada de Cython para desenfoque de imágenes 3D.
fr: `blur3d_c`: Fonction Cython optimisée pour le flou d'images 3D.

source: `gaussian_filter`: Applies a Gaussian blur with more control over the kernel size.
es: `gaussian_filter`: Aplica un desenfoque Gaussiano con más control sobre el tamaño del kernel.
fr: `gaussian_filter`: Applique un flou gaussien avec plus de contrôle sur la taille du noyau.

source: **Parameters**: - `rgb_array` (*numpy.ndarray* or *memoryview slice*): A 3D array of shape `(w, h, n)`, representing an image in RGB(A) format. - `npass` (*int*, optional): The number of blur passes to apply (**default is `1`**). More passes result in a stronger blur.
es: **Parámetros**: - `rgb_array` (*numpy.ndarray* o *memoryview slice*): Un array 3D de forma `(w, h, n)`, que representa una imagen en formato RGB(A). - `npass` (*int*, opcional): El número de pasadas de desenfoque a aplicar (**por defecto es `1`**). Más pasadas resultan en un desenfoque más fuerte.
fr: **Paramètres** : - `rgb_array` (*numpy.ndarray* ou *memoryview slice*): Un tableau 3D de forme `(w, h, n)`, représentant une image au format RGB(A). - `npass` (*int*, optionnel) : Le nombre de passes de flou à appliquer (**la valeur par défaut est `1`**). Plus de passes entraînent un flou plus fort.

source: Apply an in-place Gaussian blur to a **3D image array or memoryview slice**.
es: Aplica un desenfoque Gaussiano in-place a un **array 3D de imagen o un segmento de memoryview**.
fr: Applique un flou gaussien sur place à un **tableau d'image 3D ou un segment de mémoire**.

source: This function performs a **Gaussian blur** on an image represented as a 3D array with shape `(w, h, n)`, where `w` and `h` are the width and height, and `n` is the number of color channels (typically **3 for RGB** or **4 for RGBA**). It uses a **5x5 Gaussian kernel** for smoothing, applied through **two-pass convolution** (horizontal + vertical). The function modifies the input array in-place, avoiding unnecessary memory allocation.
es: Esta función realiza un **desenfoque Gaussiano** en una imagen representada como un array 3D de forma `(w, h, n)`, donde `w` y `h` son el ancho y el alto, y `n` es el número de canales de color (típicamente **3 para RGB** o **4 para RGBA**). Utiliza un **kernel Gaussiano de 5x5** para suavizar, aplicado mediante **convolución de dos pasadas** (horizontal + vertical). La función modifica el array de entrada in-place, evitando asignaciones de memoria innecesarias.
fr: Cette fonction applique un **flou gaussien** sur une image représentée sous la forme d'un tableau 3D de forme `(w, h, n)`, où `w` et `h` sont la largeur et la hauteur, et `n` est le nombre de canaux de couleur (généralement **3 pour RGB** ou **4 pour RGBA**). Elle utilise un **noyau gaussien 5x5** pour le lissage, appliqué par **convolution à deux passes** (horizontale + verticale). La fonction modifie le tableau d'entrée sur place, évitant toute allocation mémoire inutile.

source: Supports **RGB(A) image data** with any number of channels (`n = 3` for RGB, `n = 4` for RGBA).
es: Soporta **datos de imagen RGB(A)** con cualquier número de canales (`n = 3` para RGB, `n = 4` para RGBA).
fr: Prend en charge les **données d'image RGB(A)** avec n'importe quel nombre de canaux (`n = 3` pour RGB, `n = 4` pour RGBA).

source: Performs **Gaussian blur** using a **5x5 convolution kernel**.
es: Realiza un **desenfoque Gaussiano** utilizando un **kernel de convolución de 5x5**.
fr: Effectue un **flou gaussien** en utilisant un **noyau de convolution 5x5**.

source: Uses **two-pass convolution** (horizontal and vertical) for an efficient blur.
es: Utiliza **convolución de dos pasadas** (horizontal y vertical) para un desenfoque eficiente.
fr: Utilise une **convolution à deux passes** (horizontale et verticale) pour un flou efficace.
