Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/GaussianBlur5x5.po
Languages: es, fr

source: A new blurred surface where pixel transitions are smoothed.
es: Una nueva superficie desenfocada donde las transiciones de píxeles están suavizadas.
fr: Une nouvelle surface floutée où les transitions de pixels sont lissées.

source: If the original surface includes per-pixel transparency (alpha channel), it is preserved in the output.
es: Si la superficie original incluye transparencia por píxel (canal alfa), se preserva en la salida.
fr: Si la surface d'origine inclut une transparence par pixel (canal alpha), elle est préservée dans la sortie.

source: Gaussian blur is commonly used in image preprocessing, noise reduction, and artistic effects.
es: El desenfoque gaussiano se utiliza comúnmente en el preprocesamiento de imágenes, reducción de ruido, y efectos artísticos.
fr: Le flou gaussien est couramment utilisé dans le prétraitement d'images, la réduction du bruit, et les effets artistiques.

source: The filtering process is optimized for performance while maintaining high image fidelity.
es: El proceso de filtrado está optimizado para el rendimiento mientras mantiene una alta fidelidad de la imagen.
fr: Le processus de filtrage est optimisé pour la performance tout en maintenant une haute fidélité de l'image.

source: Apply Canny edge detection to a 3D array or memoryview slice. The Canny edge detection algorithm is a multi-stage process that identifies edges in an image by detecting areas with significant intensity changes. It was developed by John F. Canny (1986) and remains widely used in computer vision.
es: Aplica la detección de bordes Canny a un arreglo 3D o una sección de memoryview. El algoritmo de detección de bordes Canny es un proceso multietapa que identifica los bordes en una imagen mediante la detección de áreas con cambios significativos en la intensidad. Fue desarrollado por John F. Canny (1986) y sigue siendo ampliamente utilizado en visión por computadora.
fr: Appliquez la détection de bords de Canny à un tableau 3D ou un tranche de mémoire. L'algorithme de détection de bords de Canny est un processus multi-étapes qui identifie les bords dans une image en détectant les zones avec des changements d'intensité significatifs. Il a été développé par John F. Canny (1986) et reste largement utilisé en vision par ordinateur.

source: **Steps of the Canny Algorithm:**
es: **Pasos del Algoritmo Canny:**
fr: **Étapes de l'algorithme de Canny :**

source: Gradient Computation – Detects intensity changes.
es: Cálculo del gradiente – Detecta cambios de intensidad.
fr: Calcul du gradient – Détecte les changements d'intensité.

source: Non-Maximum Suppression – Removes non-edge pixels.
es: Supresión no máxima – Elimina los píxeles no bordes.
fr: Suppression non maximale – Supprime les pixels non-bords.

source: Double Thresholding – Filters weak edges.
es: Umbralización doble – Filtra los bordes débiles.
fr: Double seuillage – Filtre les bords faibles.

source: Edge Tracking by Hysteresis – Retains strong edges.
es: Seguimiento de bordes por histéresis – Retiene los bordes fuertes.
fr: Suivi des bords par hystérésis – Conserve les bords forts.

source: **rgb_array** (numpy.ndarray or memoryviewslice, shape (w, h, n), dtype uint8): Input image as a 3D array with RGB(A), BGRA, or other pixel formats.
es: **rgb_array** (numpy.ndarray o memoryviewslice, forma (w, h, n), tipo de dato uint8): Imagen de entrada como un arreglo 3D con RGB(A), BGRA, u otros formatos de píxel.
fr: **rgb_array** (numpy.ndarray ou memoryviewslice, forme (w, h, n), dtype uint8) : Image d'entrée sous forme de tableau 3D avec RGB(A), BGRA ou d'autres formats de pixels.

source: **threshold** (unsigned char, default = 50): Lower-bound threshold to suppress weak edges in gradient magnitude.
es: **umbral** (carácter sin signo, por defecto = 50): Umbral inferior para sprimir los bordes débiles en la magnitud del gradiente.
fr: **seuil** (char non signé, par défaut = 50) : Seuil inférieur pour supprimer les bords faibles dans la magnitude du gradient.

source: **low** (unsigned char, default = 0): Lower hysteresis threshold for edge tracking. Weak edges below this value are discarded.
es: **bajo** (carácter sin signo, por defecto = 0): Umbral inferior para el seguimiento de bordes de histéresis. Los bordes débiles por debajo de este valor se descartan.
fr: **low** (char non signé, par défaut = 0) : Seuil inférieur d'hystérésis pour le suivi des bords. Les bords faibles en dessous de cette valeur sont éliminés.

source: **high** (unsigned char, default = 20): Upper hysteresis threshold for edge tracking. Strong edges above this value are retained.
es: **alto** (carácter sin signo, por defecto = 20): Umbral superior para el seguimiento de bordes por histéresis. Los bordes fuertes por encima de este valor se mantienen.
fr: **high** (char non signé, par défaut = 20) : Seuil supérieur d'hystérésis pour le suivi des bords. Les bords forts au-dessus de cette valeur sont conservés.

source: pygame.Surface – A new surface/image with detected edges.
es: pygame.Surface – Una nueva superficie/imagen con bordes detectados.
fr: pygame.Surface – Une nouvelle surface/image avec les bords détectés.

source: Higher `threshold` values produce fewer edges (less noise).
es: Valores más altos de `umbral` producen menos bordes (menos ruido).
fr: Des valeurs `threshold` plus élevées produisent moins de bords (moins de bruit).

source: Hysteresis (`low`, `high`) ensures only meaningful edges are kept.
es: La histéresis (`bajo`, `alto`) asegura que solo se mantengan bordes significativos.
fr: L'hystérésis (`low`, `high`) garantit que seuls les bords significatifs sont conservés.

source: This function supports multiple pixel formats and operates on 3D arrays directly.
es: Esta función admite varios formatos de píxel y opera directamente sobre arreglos 3D.
fr: Cette fonction prend en charge plusieurs formats de pixels et fonctionne directement sur des tableaux 3D.

source: Apply Canny edge detection to a 1D buffer, NumPy array, or memoryview slice. This function processes a flat (1D) image buffer representing a grayscale or color image and applies the Canny edge detection algorithm to highlight edges.
es: Aplica la detección de bordes Canny a un búfer 1D, arreglo NumPy o sección de memoryview. Esta función procesa un búfer de imagen plano (1D) que representa una imagen en escala de grises o en color y aplica el algoritmo de detección de bordes Canny para resaltar los bordes.
fr: Appliquez la détection de bords de Canny à un tampon 1D, un tableau NumPy, ou une tranche de mémoire. Cette fonction traite un tampon d'image plat (1D) représentant une image en niveaux de gris ou en couleur et applique l'algorithme de détection de bords de Canny pour mettre en évidence les bords.

source: **bgr_array** (numpy.ndarray or memoryviewslice, shape (w,), dtype uint8): 1D buffer containing pixel data in BGR(A), BGR, or other formats.
es: **bgr_array** (numpy.ndarray o memoryviewslice, forma (w,), tipo de dato uint8): Búfer 1D que contiene datos de píxeles en BGR(A), BGR, u otros formatos.
fr: **bgr_array** (numpy.ndarray ou memoryviewslice, forme (w,), dtype uint8) : Tampon 1D contenant des données de pixels en BGR(A), BGR ou d'autres formats.

source: **width** (int): Width of the original image in pixels.
es: **ancho** (int): Ancho de la imagen original en píxeles.
fr: **largeur** (int) : Largeur de l'image originale en pixels.

source: **height** (int): Height of the original image in pixels.
es: **alto** (int): Altura de la imagen original en píxeles.
fr: **hauteur** (int) : Hauteur de l'image originale en pixels.

source: **format_32** (bool): True for 32-bit buffers (BGRA, BGRA). False for 24-bit buffers (BGR, BGR).
es: **format_32** (bool): Verdadero para búferes de 32 bits (BGRA, BGRA). Falso para búferes de 24 bits (BGR, BGR).
fr: **format_32** (bool) : True pour les tampons 32 bits (BGRA, BGRA). False pour les tampons 24 bits (BGR, BGR).

source: **threshold** (int, default = 70): Gradient magnitude threshold for edge detection. Higher values suppress weaker edges and reduce noise.
es: **umbral** (int, por defecto = 70): Umbral de magnitud de gradiente para detección de bordes. Valores más altos suprimen los bordes más débiles y reducen el ruido.
fr: **seuil** (int, par défaut = 70) : Seuil de magnitude du gradient pour la détection des bords. Des valeurs plus élevées suppriment les bords plus faibles et réduisent le bruit.

source: pygame.Surface – A new image with Canny edge detection applied.
es: pygame.Surface – Una nueva imagen con la detección de bordes Canny aplicada.
fr: pygame.Surface – Une nouvelle image avec détection de bords de Canny appliquée.

source: This function supports various pixel formats (e.g., RGB, BGR, RGBA, BGRA).
es: Esta función admite varios formatos de píxel (por ejemplo, RGB, BGR, RGBA, BGRA).
fr: Cette fonction prend en charge divers formats de pixels (par exemple, RGB, BGR, RGBA, BGRA).

source: Thresholding affects edge strength—adjust for optimal results.
es: La umbralización afecta la intensidad de los bordes—ajústela para obtener los mejores resultados.
fr: Le seuillage affecte la force des bords — ajustez-le pour des résultats optimaux.

source: Operates directly on a 1D buffer, making it memory-efficient.
es: Opera directamente sobre un búfer 1D, lo que lo hace eficiente en memoria.
fr: Fonctionne directement sur un tampon 1D, ce qui le rend efficace en termes de mémoire.

source: Apply a blur effect to a 3D numpy array or memoryviewslice (returns a copy). This function performs a blur operation on a 3D array, such as an image, and returns a blurred copy. It supports RGB(A) or other pixel formats, maintaining the original format in the returned array.
es: Aplica un efecto de desenfoque a un arreglo numpy 3D o una sección de memoryviewslice (devuelve una copia). Esta función realiza una operación de desenfoque en un arreglo 3D, como una imagen, y devuelve una copia desenfocada. Admite RGB(A) u otros formatos de píxel, manteniendo el formato original en el arreglo devuelto.
fr: Appliquez un effet de flou à un tableau numpy 3D ou à une tranche de mémoire (renvoie une copie). Cette fonction effectue une opération de flou sur un tableau 3D, comme une image, et renvoie une copie floutée. Elle prend en charge les formats RGB(A) ou d'autres formats de pixels, tout en maintenant le format d'origine dans le tableau renvoyé.

source: **rgb_array** (numpy.ndarray or memoryviewslice, shape (w, h, n), dtype uint8): 3D array containing pixel data in RGB(A) or any compatible pixel format (e.g., BGRA). The shape should be (width, height, channels) where channels typically represent color components (3 for RGB, 4 for RGBA, etc.).
es: **rgb_array** (numpy.ndarray o memoryviewslice, forma (w, h, n), tipo de dato uint8): Arreglo 3D que contiene datos de píxeles en RGB(A) o cualquier formato compatible de píxeles (por ejemplo, BGRA). La forma debe ser (ancho, alto, canales) donde los canales generalmente representan componentes de color (3 para RGB, 4 para RGBA, etc.).
fr: **rgb_array** (numpy.ndarray ou memoryviewslice, forme (w, h, n), dtype uint8) : Tableau 3D contenant des données de pixels en RGB(A) ou tout format compatible (par exemple, BGRA). La forme doit être (largeur, hauteur, canaux) où les canaux représentent typiquement les composants de couleur (3 pour RGB, 4 pour RGBA, etc.).

source: numpy.ndarray: A new array (blurred copy) with the same shape and pixel format as `rgb_array`. The returned array will have the same width, height, and pixel format as the input, but with the blur effect applied.
es: numpy.ndarray: Un nuevo arreglo (copia desenfocada) con la misma forma y formato de píxel que `rgb_array`. El arreglo devuelto tendrá el mismo ancho, alto y formato de píxel que la entrada, pero con el efecto de desenfoque aplicado.
fr: numpy.ndarray : Un nouveau tableau (copie floutée) avec la même forme et le même format de pixel que `rgb_array`. Le tableau renvoyé aura la même largeur, hauteur et format de pixel que l'entrée, mais avec l'effet de flou appliqué.

source: The function does not modify the input array in-place; it returns a new blurred array.
es: La función no modifica el arreglo de entrada en el lugar; devuelve un nuevo arreglo desenfocado.
fr: La fonction ne modifie pas le tableau d'entrée sur place ; elle renvoie un nouveau tableau flouté.

source: The output will preserve the same color channels (e.g., RGB or RGBA).
es: La salida preservará los mismos canales de color (por ejemplo, RGB o RGBA).
fr: La sortie conservera les mêmes canaux de couleur (par exemple, RGB ou RGBA).

source: 5. Conclusion
es: 5. Conclusión

source: \text{Horizontal pass: } \begin{bmatrix} \frac{1}{16} & \frac{4}{16} & \frac{6}{16} & \frac{4}{16} & \frac{1}{16} \end{bmatrix}
es: \text{Pasada horizontal: } \begin{bmatrix} \frac{1}{16} & \frac{4}{16} & \frac{6}{16} & \frac{4}{16} & \frac{1}{16} \end{bmatrix}

source: \text{Vertical pass: } \begin{bmatrix} \frac{1}{16} \\ \frac{4}{16} \\ \frac{6}{16} \\ \frac{4}{16} \\ \frac{1}{16} \end{bmatrix}
es: \text{Pasada vertical: } \begin{bmatrix} \frac{1}{16} \\ \frac{4}{16} \\ \frac{6}{16} \\ \frac{4}{16} \\ \frac{1}{16} \end{bmatrix}

source: **Description**
es: **Descripción**

source: **Notes:**
es: **Notas:**
