Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: es

source: Welcome to PygameShader's documentation!
es: ¡Bienvenido a la documentación de PygameShader!

source: 1. Pygame Shader Project
es: 1. Proyecto Pygame Shader

source: **PygameShader** is a **wrapper around the Pygame library**, written in **Python**, **Cython** and **C**, designed to add **advanced** **visual effects** to multimedia applications, including **2D Indie video games, arcade games, and real-time image processing** for video and camera feeds.
es: **PygameShader** es un **envoltorio alrededor de la biblioteca Pygame**, escrito en **Python**, **Cython** y **C**, diseñado para agregar **efectos visuales avanzados** a aplicaciones multimedia, incluyendo **juegos de video indie en 2D, juegos de arcade y procesamiento de imágenes en tiempo real** para videos y transmisiones de cámaras.

source: This library extends **Pygame** by enabling developers to apply **shaders** or texture processor to **sprite textures**, **SDL surfaces, and the entire game display**, significantly enhancing the visual experience with minimal performance overhead.
es: Esta biblioteca extiende **Pygame** permitiendo a los desarrolladores aplicar **shaders** o procesadores de texturas a **texturas de sprites**, **superficies SDL**, y a **la pantalla completa del juego**, mejorando significativamente la experiencia visual con una sobrecarga mínima de rendimiento.

source: **Supported Surface/Image Formats**
es: **Formatos de Superficie/Imagen Soportados**

source: PygameShader supports multiple image formats, including **BMP, GIF (non-animated), JPEG, and PNG**. However, Pygame may not always be built with support for all formats. At a minimum, **BMP** is always available.
es: PygameShader soporta múltiples formatos de imagen, incluyendo **BMP, GIF (no animado), JPEG y PNG**. Sin embargo, Pygame puede no estar siempre compilado con soporte para todos los formatos. Al menos, **BMP** siempre está disponible.

source: To check if additional image formats are supported, run:
es: Para comprobar si se soportan formatos adicionales de imagen, ejecuta:

source: If it returns ``True``, then **PNG, JPG, and GIF** formats are also supported.
es: Si devuelve ``True``, entonces los formatos **PNG, JPG y GIF** también están soportados.

source: **Performance & Optimization**
es: **Rendimiento y Optimización**

source: PygameShader is optimized for **real-time rendering at 60 FPS**, particularly for **medium resolutions (1024x768)**. However, performance depends on the complexity of the shader.
es: PygameShader está optimizado para **renderizado en tiempo real a 60 FPS**, particularmente para **resoluciones medias (1024x768)**. Sin embargo, el rendimiento depende de la complejidad del shader.

source: Some effects, like **median filtering, predator vision and cartoon effect**, require multiple shaders to create composite effects, making them computationally more demanding. Most shaders will maintain **smooth performance at medium resolutions**, but higher resolutions may affect frame rates.
es: Algunos efectos, como **filtros medianos, visión de depredador y efecto de dibujo animado**, requieren múltiples shaders para crear efectos compuestos, lo que los hace más exigentes computacionalmente. La mayoría de los shaders mantendrán **un rendimiento fluido a resoluciones medias**, pero resoluciones más altas pueden afectar las tasas de fotogramas.

source: For **sprite texturing and special effects**, PygameShader remains **extremely fast**, thanks to **Cython-based optimizations**. To maintain a high frame rate, it's recommended to keep SDL sprite texture sizes within **200x200 pixels** to avoid unnecessary processing overhead.
es: Para **texturización de sprites y efectos especiales**, PygameShader sigue siendo **extremadamente rápido**, gracias a las **optimizaciones basadas en Cython**. Para mantener una tasa de fotogramas alta, se recomienda mantener el tamaño de las texturas de los sprites SDL dentro de **200x200 píxeles** para evitar sobrecargas de procesamiento innecesarias.

source: **Features**
es: **Características**

source: **Shader Effects** – Enhance your game's visuals with advanced shading techniques.
es: **Efectos de Shader** – Mejora los visuales de tu juego con técnicas de sombreamiento avanzadas.

source: **Real-time Rendering** – Apply effects to the entire game display at high frame rates.
es: **Renderizado en tiempo real** – Aplica efectos a la pantalla completa del juego a altas tasas de fotogramas.

source: **Optimized for Speed** – Efficient **Cython** implementation ensures smooth performance.
es: **Optimizado para Velocidad** – La implementación eficiente de **Cython** asegura un rendimiento fluido.

source: **Sprite & Surface Customization** – Modify textures and surfaces dynamically.
es: **Personalización de Sprites y Superficies** – Modifica texturas y superficies dúctilmente.

source: PygameShader provides powerful tools to **improve the visual appeal** of your game, whether by enhancing sprite textures or applying full-screen visual effects.
es: PygameShader proporciona herramientas poderosas para **mejorar el atractivo visual** de tu juego, ya sea mejorando texturas de sprites o aplicando efectos visuales a pantalla completa.

source: 2. GPU Shaders with CuPy & CUDA
es: 2. Shaders de GPU con CuPy y CUDA

source: Some scripts have been ported to the **GPU** using **CuPy** and **CUDA raw kernels**, allowing them to run on **NVIDIA graphics cards (Compute Capability 3.0 or higher)**.
es: Algunos scripts han sido portados a la **GPU** usando **CuPy** y **kernels crudos de CUDA**, permitiendo que se ejecuten en **tarjetas gráficas NVIDIA (capacidad de computación 3.0 o superior)**.

source: These shaders are compatible **only with NVIDIA chipsets**.
es: Estos shaders son compatibles **solo con chipsets NVIDIA**.

source: **Requirements**
es: **Requisitos**

source: To use GPU shaders, you must have:
es: Para usar los shaders de GPU, debes tener:

source: The **CuPy** library installed.
es: La biblioteca **CuPy** instalada.

source: The **CUDA Toolkit** installed (supported versions: ``v10.2 - v11.6``).
es: El **CUDA Toolkit** instalado (versiones soportadas: ``v10.2 - v11.6``).

source: For installation instructions, see the `CuPy installation guide <https://docs.cupy.dev/en/stable/install.html>`_.
es: Para instrucciones de instalación, consulta la `guía de instalación de CuPy <https://docs.cupy.dev/en/stable/install.html>`_.

source: **Experimental Status & Performance Considerations**
es: **Estado Experimental y Consideraciones de Rendimiento**

source: The **GPU shaders are experimental** and may be **limited by PCI Express bandwidth**, especially for **real-time rendering**.
es: Los **shaders de GPU son experimentales** y pueden estar **limitados por el ancho de banda PCI Express**, especialmente para **renderizado en tiempo real**.

source: For an example of real-time GPU rendering of a ``pygame.Surface``, check out:
es: Para un ejemplo de renderizado en tiempo real de GPU de un ``pygame.Surface``, consulta:

source: **Comparison: GLSL vs. CUDA**
es: **Comparación: GLSL vs. CUDA**

source: While **GLSL** outperforms CuPy/CUDA in raw graphics performance, CUDA excels at **accelerating general-purpose parallel computations** originally designed for **CPU architectures** (Python & Cython).
es: Si bien **GLSL** supera a CuPy/CUDA en el rendimiento gráfico bruto, CUDA sobresale en **acelerar cálculos paralelos de propósito general** originalmente pensados para **arquitecturas de CPU** (Python y Cython).

source: Feature
es: Característica

source: GLSL (Shading Language)
es: GLSL (Lenguaje de Sombreamiento)

source: **Primary Use**
es: **Uso Principal**

source: Graphics Rendering
es: Renderizado Gráfico

source: Compute Shaders
es: Shaders de Cálculo

source: **Compilation**
es: **Compilación**

source: Shader Code
es: Código de Shader

source: PTX (NVIDIA Assembly)
es: PTX (Ensamblador NVIDIA)

source: **Flexibility**
es: **Flexibilidad**

source: Requires Graphics API
es: Requiere API Gráfica

source: Independent Execution
es: Ejecución Independiente

source: For further insights, check this `GPU programming guide <https://carpentries-incubator.github.io/lesson-gpu-programming/aio/index.html>`_.
es: Para más información, consulta esta `guía de programación de GPU <https://carpentries-incubator.github.io/lesson-gpu-programming/aio/index.html>`_.

source: **Usage in Python**
es: **Uso en Python**

source: To import GPU shaders:
es: Para importar shaders de GPU:

source: **Demo**
es: **Demostración**

source: To run demos from the ``Demo`` directory (Press ``ESC`` to quit):
es: Para ejecutar demostraciones desde el directorio ``Demo`` (Presiona ``ESC`` para salir):

source: **CPU Shader Demos**
es: **Demostraciones de Shaders de CPU**

source: **GPU Shader Demos (Requires CuPy & CUDA)**
es: **Demostraciones de Shaders de GPU (Requiere CuPy & CUDA)**

source: **Easy integration with various library such as Pillow, OpenCV, Scikit-image**
es: **Fácil integración con varias bibliotecas como Pillow, OpenCV, Scikit-image**

source: 3. Installation
es: 3. Instalación

source: **Install via pip**
es: **Instalar vía pip**

source: Check the latest version: `PygameShader on PyPI <https://pypi.org/project/PygameShader/>`_
es: Verifica la última versión: `PygameShader en PyPI <https://pypi.org/project/PygameShader/>`_

source: **Supported Python Versions:** ``3.6 - 3.11`` **Platforms:** Windows & Linux (``x86``, ``x86_64``)
es: **Versiones de Python soportadas:** ``3.6 - 3.11`` **Plataformas:** Windows & Linux (``x86``, ``x86_64``)

source: Check installed version:
es: Verifica la versión instalada:

source: **Install from Source**
es: **Instalar desde el código fuente**

source: **Building Cython & C Code**
es: **Compilando Cython y Código C**

source: **When Should You Compile Cython Code?**
es: **¿Cuándo debes compilar el código Cython?**

source: If you modify any ``.pyx`` or ``.pxd`` files (e.g., ``shader.pyx``, ``shader.pxd``, ``__init__.pxd``), recompile using:
es: Si modificas algún archivo ``.pyx`` o ``.pxd`` (por ejemplo, ``shader.pyx``, ``shader.pxd``, ``__init__.pxd``), recompila usando:

source: For a specific Python version, use:
es: Para una versión específica de Python, usa:

source: If compilation fails, ensure:
es: Si la compilación falla, asegúrate de:

source: **Cython & a C-compiler** (MSVC, MinGW, GCC) are installed.
es: **Cython y un compilador C** (MSVC, MinGW, GCC) están instalados.

source: **Python development headers** are available.
es: **Los encabezados de desarrollo de Python** están disponibles.

source: For Windows users, refer to this guide: `VC++ Compiler Setup <https://devblogs.microsoft.com/python/unable-to-find-vcvarsall-bat/>`_.
es: Para usuarios de Windows, consulta esta guía: `Configuración del compilador VC++ <https://devblogs.microsoft.com/python/unable-to-find-vcvarsall-bat/>`_.

source: 4. OpenMP for Multi-threaded Processing
es: 4. OpenMP para procesamiento multihilo

source: By default, PygameShader is built with **multi-processing support (OpenMP)**.
es: Por defecto, PygameShader se compila con **soporte para multiprocesamiento (OpenMP)**.

source: To **disable OpenMP**, update ``config.py``:
es: Para **deshabilitar OpenMP**, actualiza ``config.py``:

source: Then rebuild:
es: Luego reconstruye:

source: 5. Credits
es: 5. Créditos

source: **Author:** Yoann Berenguer
es: **Autor:** Yoann Berenguer

source: 6. Dependencies
es: 6. Dependencias

source: 7. License
es: 7. Licencia

source: **GNU General Public License Version 3 (GPLv3)**
es: **Licencia Pública General GNU Versión 3 (GPLv3)**

source: 8. Running Tests
es: 8. Ejecutando Pruebas

source: 9. Libraries
es: 9. Bibliotecas
