Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Misc.po
Languages: fr

source: 1. Python Library Summary
fr: 1. Résumé de la bibliothèque Python

source: This library is part of a Python module for image manipulation and processing, focusing on **gradient generation**, **image channel manipulation**, **color space calculations**, and **sorting algorithms**. Below is a breakdown of the key functionality and purpose of the different functions and methods in the module:
fr: Cette bibliothèque fait partie d'un module Python pour la manipulation et le traitement d'images, axé sur la **génération de gradients**, la **manipulation des canaux d'images**, les **calculs de l'espace colorimétrique**, et les **algorithmes de tri**. Voici un aperçu des principales fonctionnalités et objectifs des différentes fonctions et méthodes du module :

source: **Gradient Generation Functions**
fr: **Fonctions de génération de gradients**

source: These functions create various types of gradients, which are often used in graphical applications for creating smooth transitions between colors.
fr: Ces fonctions créent divers types de gradients, souvent utilisés dans les applications graphiques pour créer des transitions douces entre les couleurs.

source: **`create_line_gradient_rgb`**: Generates a linear gradient of RGB values between two specified colors (`start_rgb` and `end_rgb`).
fr: **`create_line_gradient_rgb`** : Génère un gradient linéaire de valeurs RGB entre deux couleurs spécifiées (`start_rgb` et `end_rgb`).

source: **`create_line_gradient_rgba`**: Similar to the above, but for RGBA colors (adds an alpha channel for transparency).
fr: **`create_line_gradient_rgba`** : Similaire à la précédente, mais pour les couleurs RGBA (ajoute un canal alpha pour la transparence).

source: **`horizontal_rgb_gradient`**: Creates a horizontal gradient in RGB color space.
fr: **`horizontal_rgb_gradient`** : Crée un gradient horizontal dans l'espace colorimétrique RGB.

source: **`horizontal_rgba_gradient`**: Creates a horizontal gradient in RGBA color space.
fr: **`horizontal_rgba_gradient`** : Crée un gradient horizontal dans l'espace colorimétrique RGBA.

source: **`create_radial_gradient`**: Creates a radial gradient that radiates outward from a point, with customizable start and end colors and offsets. A precomputed gradient can be provided to optimize performance.
fr: **`create_radial_gradient`** : Crée un gradient radial qui rayonne à partir d'un point, avec des couleurs de début et de fin personnalisables et des décalages. Un gradient pré-calculé peut être fourni pour optimiser les performances.

source: **`create_radial_gradient_alpha`**: Similar to `create_radial_gradient`, but specifically for handling RGBA with transparency.
fr: **`create_radial_gradient_alpha`** : Similaire à `create_radial_gradient`, mais spécifiquement pour gérer les RGBA avec transparence.

source: **`create_quarter_radial_gradient`** and **`create_quarter_radial_gradient_alpha`**: These create gradients for a quarter of a circle (sector-based gradients), useful for specialized visual effects.
fr: **`create_quarter_radial_gradient`** et **`create_quarter_radial_gradient_alpha`** : Ces fonctions créent des gradients pour un quart de cercle (gradients sectoriels), utiles pour des effets visuels spécialisés.

source: **Color Space and Color Matching Functions**
fr: **Fonctions de manipulation d'espace colorimétrique et d'appariement de couleurs**

source: These functions are used to work with different color spaces (HSV, HSL, RGB) and find closest color matches, which is useful for color-based image processing or palette generation.
fr: Ces fonctions sont utilisées pour travailler avec différents espaces colorimétriques (HSV, HSL, RGB) et trouver les couleurs les plus proches, ce qui est utile pour le traitement d'images basé sur les couleurs ou la génération de palettes.

source: **`color_dist_hsv`**: Calculates the distance between two colors in the HSV color space.
fr: **`color_dist_hsv`** : Calcule la distance entre deux couleurs dans l'espace colorimétrique HSV.

source: **`color_dist_hsl`**: Calculates the distance between two colors in the HSL color space.
fr: **`color_dist_hsl`** : Calcule la distance entre deux couleurs dans l'espace colorimétrique HSL.

source: **`closest_hsv_color`** and **`closest_hsl_color`**: Find the closest color in a given palette to a target color, using the HSV or HSL color space respectively.
fr: **`closest_hsv_color`** et **`closest_hsl_color`** : Trouve la couleur la plus proche dans une palette donnée par rapport à une couleur cible, en utilisant respectivement les espaces colorimétriques HSV ou HSL.

source: **`close_color`**: Finds a color in a palette that is close to a given color (presumably using RGB space).
fr: **`close_color`** : Trouve une couleur dans une palette proche d'une couleur donnée (probablement en utilisant l'espace RGB).

source: **`use_palette`**: Similar to `close_color`, but selects colors from a palette based on a defined selection criterion.
fr: **`use_palette`** : Similaire à `close_color`, mais sélectionne des couleurs dans une palette basée sur un critère de sélection défini.

source: **Image Manipulation Functions**
fr: **Fonctions de manipulation d'image**

source: These functions focus on manipulating images or buffers, particularly for scrolling, blending, and combining channels.
fr: Ces fonctions se concentrent sur la manipulation d'images ou de tampons, en particulier pour le défilement, le mélange et la combinaison des canaux.

source: **`swap_image_channels`**: Swaps color channels (such as RGB) in an image surface, useful when working with different color formats or performing transformations.
fr: **`swap_image_channels`** : Échange les canaux de couleur (comme RGB) sur une surface d'image, utile lorsqu'on travaille avec différents formats de couleur ou qu'on effectue des transformations.

source: **`scroll_surface_24bit`**, **`scroll24_inplace`**, **`scroll_rgb_array_inplace`**, **`scroll_alpha_inplace`**: These functions allow for scrolling of an image or image channels in the x and y directions, which can be used for animations or visual effects. The `c` versions are likely optimized implementations written in C for performance.
fr: **`scroll_surface_24bit`**, **`scroll24_inplace`**, **`scroll_rgb_array_inplace`**, **`scroll_alpha_inplace`** : Ces fonctions permettent de faire défiler une image ou des canaux d'image dans les directions x et y, ce qui peut être utilisé pour des animations ou des effets visuels. Les versions `c` sont probablement des implémentations optimisées écrites en C pour les performances.

source: **`combine_rgba_buffers`**: Combines a BGR image buffer and an alpha channel into a single RGBA image buffer. This is useful for working with images that have separate color and alpha channels.
fr: **`combine_rgba_buffers`** : Combine un tampon d'image BGR et un canal alpha en un seul tampon d'image RGBA. Cela est utile pour travailler avec des images ayant des canaux de couleur et alpha séparés.

source: **`normalize_2d_array`**: Normalizes a 2D array, possibly for color or pixel intensity normalization.
fr: **`normalize_2d_array`** : Normalise un tableau 2D, probablement pour la normalisation des couleurs ou de l'intensité des pixels.

source: **Utility Functions**
fr: **Fonctions utilitaires**

source: These functions perform a variety of utility tasks, including sorting and random number generation.
fr: Ces fonctions accomplissent diverses tâches utilitaires, y compris le tri et la génération de nombres aléatoires.

source: **`rgb_to_int`** and **`int_to_rgb`**: Convert between RGB values and their integer representation (often used for packing/unpacking colors).
fr: **`rgb_to_int`** et **`int_to_rgb`** : Convertit entre les valeurs RGB et leur représentation entière (souvent utilisée pour l'emballage/déballage des couleurs).

source: **`_randf`**, **`_randi`**: Generate random float and integer values within a specified range, likely for random color or pixel generation.
fr: **`_randf`**, **`_randi`** : Génère des valeurs aléatoires en float et en entier dans une plage spécifiée, probablement pour la génération aléatoire de couleurs ou de pixels.

source: **`bubble_sort`**, **`insertion_sort`**, **`quick_sort`**, **`heap_sort`**: These are different sorting algorithms implemented for sorting arrays of pixel or image data. `heap_sort` and `quick_sort` are especially useful for sorting large datasets or pixel values efficiently.
fr: **`bubble_sort`**, **`insertion_sort`**, **`quick_sort`**, **`heap_sort`** : Ce sont différents algorithmes de tri implémentés pour trier des tableaux de données de pixels ou d'images. `heap_sort` et `quick_sort` sont particulièrement utiles pour trier de grands ensembles de données ou des valeurs de pixels de manière efficace.

source: **`partition_cython`**, **`_quick_sort`**, **`heapify`**: These are helper functions for sorting algorithms like Quick Sort and Heap Sort, optimized for performance in Cython.
fr: **`partition_cython`**, **`_quick_sort`**, **`heapify`** : Ce sont des fonctions d'aide pour les algorithmes de tri comme QuickSort et HeapSort, optimisées pour les performances en Cython.

source: **Image Format and Type Checking**
fr: **Vérification du format et du type d'image**

source: These functions help determine the type of image data or buffers.
fr: Ces fonctions aident à déterminer le type de données ou de tampons d'image.

source: **`get_image_format`**: Likely checks the format of an image (whether it is in RGBA, RGB, etc.).
fr: **`get_image_format`** : Vérifie probablement le format d'une image (si elle est en RGBA, RGB, etc.).

source: **`is_type_memoryview`**, **`is_uint8`**, **`is_float64`**, **`is_int32`**: These functions check the type and datatype of a given image array or buffer, useful for validating input and ensuring the correct data format.
fr: **`is_type_memoryview`**, **`is_uint8`**, **`is_float64`**, **`is_int32`** : Ces fonctions vérifient le type et le format des données d'un tableau ou tampon d'image donné, utile pour valider l'entrée et garantir le bon format de données.

source: 2. Overall Purpose of the Library
fr: 2. Objectif global de la bibliothèque

source: The library is designed for **image processing** and **graphical operations**, with a strong emphasis on **gradient creation**, **image channel manipulation**, **color transformations**, **sorting algorithms**, and **optimization**. It provides functions to create smooth color transitions (gradients), manipulate pixel data, check image formats, and optimize computationally expensive operations using algorithms like QuickSort and HeapSort. The functions are highly optimized with `cpdef` and `cdef` to allow seamless integration between Python and C for performance-critical tasks.
fr: La bibliothèque est conçue pour le **traitement d'images** et les **opérations graphiques**, en mettant l'accent sur la **création de gradients**, la **manipulation des canaux d'image**, les **transformations de couleurs**, les **algorithmes de tri**, et **l'optimisation**. Elle fournit des fonctions pour créer des transitions de couleurs douces (gradients), manipuler les données de pixels, vérifier les formats d'images, et optimiser les opérations coûteuses en calcul en utilisant des algorithmes comme QuickSort et HeapSort. Les fonctions sont fortement optimisées avec `cpdef` et `cdef` pour permettre une intégration fluide entre Python et C pour les tâches critiques en termes de performance.

source: 3. Use Cases
fr: 3. Cas d'utilisation

source: **Image Processing**: Manipulating and transforming images, handling RGBA/BGR channels, scrolling image pixels, and applying color transformations.
fr: **Traitement d'image** : Manipulation et transformation des images, gestion des canaux RGBA/BGR, défilement des pixels d'image et application de transformations de couleur.

source: **Graphics Rendering**: Generating gradients (linear, radial, quarter radial) for background effects or visual transitions.
fr: **Rendu graphique** : Génération de gradients (linéaires, radiaux, quart de cercle) pour des effets de fond ou des transitions visuelles.

source: **Color Matching**: Finding the closest matching colors in a given color palette based on various color spaces (HSV, HSL).
fr: **Correspondance des couleurs** : Trouver les couleurs les plus proches dans une palette donnée en fonction de différents espaces colorimétriques (HSV, HSL).

source: **Performance Optimization**: Utilizing sorting and color manipulation algorithms to efficiently process large images or datasets, with performance improvements using Cython (`cpdef`/`cdef`).
fr: **Optimisation des performances** : Utilisation d'algorithmes de tri et de manipulation des couleurs pour traiter efficacement de grandes images ou ensembles de données, avec des améliorations de performance grâce à Cython (`cpdef`/`cdef`).

source: This library would be useful in applications like **image editors**, **graphic design tools**, **data visualization**, or **real-time graphical applications**.
fr: Cette bibliothèque serait utile dans des applications telles que les **éditeurs d'images**, les **outils de conception graphique**, la **visualisation de données** ou les **applications graphiques en temps réel**.

source: 5. Cython list methods
fr: 5. Méthodes de liste Cython

source: **Summary**: Swaps or nullifies the channels of an image based on the specified channel order string. The function allows you to swap the color channels (RGB) of an image represented as a pygame.Surface. You can specify the new channel order using a string where each letter represents a color channel (R, G, B) or '0' to nullify a channel (remove it).
fr: **Résumé** : Échange ou annule les canaux d'une image en fonction de la chaîne d'ordre des canaux spécifiée. La fonction permet d'échanger les canaux de couleur (RGB) d'une image représentée comme un pygame.Surface. Vous pouvez spécifier le nouvel ordre des canaux à l'aide d'une chaîne où chaque lettre représente un canal de couleur (R, G, B) ou '0' pour annuler un canal (le supprimer).

source: **Example Usage**:
fr: **Exemple d'utilisation** :

source: **Parameters**:
fr: **Paramètres** :

source: The image (pygame Surface) whose channels are to be swapped.
fr: L'image (pygame Surface) dont les canaux doivent être échangés.

source: A string representing the desired channel order. It must contain exactly 3 characters, where 'R', 'G', and 'B' represent the respective color channels, and '0' nullifies a channel. Example values: 'RGB', 'RBG', 'GRB', 'BGR', 'BRG', 'R0B', etc.
fr: Une chaîne représentant l'ordre souhaité des canaux. Elle doit contenir exactement 3 caractères, où 'R', 'G', et 'B' représentent les canaux de couleur respectifs, et '0' annule un canal. Exemples de valeurs : 'RGB', 'RBG', 'GRB', 'BGR', 'BRG', 'R0B', etc.

source: **Returns**: A new 24-bit pygame surface with the swapped channels.
fr: **Retourne** : Une nouvelle surface pygame 24 bits avec les canaux échangés.

source: **Raises**: - **ValueError**:
fr: **Lève** : - **ValueError** :

source: If the channel order string is not valid or if the surface format is incompatible.
fr: Si la chaîne d'ordre des canaux n'est pas valide ou si le format de la surface est incompatible.

source: **Summary**: Generates a 2D horizontal gradient of RGB colors from a start color to an end color. The function creates an array of RGB values representing a smooth horizontal gradient transitioning from the specified `start_rgb` to the `end_rgb`. The gradient consists of `num_pixels` number of pixels, with the color gradually changing from the start color to the end color across the 1D array.
fr: **Résumé** : Génère un gradient horizontal 2D de couleurs RGB allant d'une couleur de départ à une couleur de fin. La fonction crée un tableau de valeurs RGB représentant un gradient horizontal lisse transitionnant de `start_rgb` à `end_rgb`. Le gradient consiste en `num_pixels` pixels, avec la couleur changeant progressivement de la couleur de départ à la couleur de fin à travers le tableau 1D.

source: The number of pixels in the gradient (must be > 0). Determines the length of the gradient in the horizontal direction.
fr: Le nombre de pixels dans le gradient (doit être > 0). Détermine la longueur du gradient dans la direction horizontale.

source: **start_rgb** (tuple, optional):
fr: **start_rgb** (tuple, optionnel) :

source: A tuple representing the RGB values of the starting color (default is red: (255, 0, 0)).
fr: Un tuple représentant les valeurs RGB de la couleur de départ (par défaut, rouge : (255, 0, 0)).

source: **end_rgb** (tuple, optional):
fr: **end_rgb** (tuple, optionnel) :

source: A tuple representing the RGB values of the ending color (default is green: (0, 255, 0)).
fr: Un tuple représentant les valeurs RGB de la couleur de fin (par défaut, vert : (0, 255, 0)).

source: **Returns**: - **numpy.ndarray**:
fr: **Retourne** : - **numpy.ndarray** :

source: A 2D numpy array of shape (num_pixels, 3), where each row represents an RGB color. The array contains the pixel values of the gradient, with the color transitioning from the `start_rgb` to the `end_rgb`.
fr: Un tableau numpy 2D de forme (num_pixels, 3), où chaque ligne représente une couleur RGB. Le tableau contient les valeurs des pixels du gradient, avec la couleur transitionnant de `start_rgb` à `end_rgb`.

source: If the `num_pixels` is less than or equal to 0. If `start_rgb` or `end_rgb` are not valid RGB tuples of length 3, or if any of the color values are out of the valid RGB range [0, 255]. If `num_pixels` is not a positive integer.
fr: Si `num_pixels` est inférieur ou égal à 0. Si `start_rgb` ou `end_rgb` ne sont pas des tuples RGB valides de longueur 3, ou si l'une des valeurs de couleur est en dehors de la plage RGB valide [0, 255]. Si `num_pixels` n'est pas un entier positif.

source: If `start_rgb` or `end_rgb` are not tuples, or if they contain non-integer values.
fr: Si `start_rgb` ou `end_rgb` ne sont pas des tuples, ou s'ils contiennent des valeurs non entières.

source: **Summary**: Generates a 2D horizontal gradient of RGB(A) colors from a start color to an end color. The function creates an array of RGBA values representing a smooth horizontal gradient transitioning from the specified `start_rgba` to the `end_rgba`. The gradient consists of `num_pixels` number of pixels, with the color gradually changing from the start color to the end color across the 1D array.
fr: **Résumé** : Génère un gradient horizontal 2D de couleurs RGB(A) allant d'une couleur de départ à une couleur de fin. La fonction crée un tableau de valeurs RGBA représentant un gradient horizontal lisse transitionnant de `start_rgba` à `end_rgba`. Le gradient consiste en `num_pixels` pixels, avec la couleur changeant progressivement de la couleur de départ à la couleur de fin à travers le tableau 1D.

source: **start_rgba** (tuple, optional):
fr: **start_rgba** (tuple, optionnel) :

source: A tuple representing the RGBA values of the starting color (default is red: (255, 0, 0, 255)).
fr: Un tuple représentant les valeurs RGBA de la couleur de départ (par défaut, rouge : (255, 0, 0, 255)).

source: **end_rgba** (tuple, optional):
fr: **end_rgba** (tuple, optionnel) :

source: A tuple representing the RGBA values of the ending color (default is green: (0, 255, 0, 0)).
fr: Un tuple représentant les valeurs RGBA de la couleur de fin (par défaut, vert : (0, 255, 0, 0)).

source: A 2D numpy array of shape (num_pixels, 4), where each row represents an RGBA color. The array contains the pixel values of the gradient, with the color transitioning from the `start_rgba` to the `end_rgba`.
fr: Un tableau numpy 2D de forme (num_pixels, 4), où chaque ligne représente une couleur RGBA. Le tableau contient les valeurs des pixels du gradient, avec la couleur transitionnant de `start_rgba` à `end_rgba`.

source: If the `num_pixels` is less than or equal to 0. If `start_rgba` or `end_rgba` are not valid RGBA tuples of length 4, or if any of the color values are out of the valid RGBA range [0, 255]. If `num_pixels` is not a positive integer.
fr: Si `num_pixels` est inférieur ou égal à 0. Si `start_rgba` ou `end_rgba` ne sont pas des tuples RGBA valides de longueur 4, ou si l'une des valeurs de couleur est en dehors de la plage RGBA valide [0, 255]. Si `num_pixels` n'est pas un entier positif.

source: If `start_rgba` or `end_rgba` are not tuples, or if they contain non-integer values.
fr: Si `start_rgba` ou `end_rgba` ne sont pas des tuples, ou s'ils contiennent des valeurs non entières.

source: **Summary**: Generates a 24-bit horizontal gradient between two RGB colors. The function creates a smooth transition from `color_start` to `color_end` across a surface of the specified dimensions.
fr: **Résumé** : Génère un gradient horizontal 24 bits entre deux couleurs RGB. La fonction crée une transition douce de `color_start` à `color_end` à travers une surface de dimensions spécifiées.

source: The width of the gradient surface in pixels (must be > 1).
fr: La largeur de la surface du gradient en pixels (doit être > 1).

source: The height of the gradient surface in pixels (must be > 0).
fr: La hauteur de la surface du gradient en pixels (doit être > 0).

source: **color_start** (tuple, optional):
fr: **color_start** (tuple, optionnel) :

source: The starting color as an (R, G, B) tuple, where each value is in the range [0, 255]. The default is (255, 0, 0), which represents red.
fr: La couleur de départ sous forme de tuple (R, G, B), où chaque valeur est dans la plage [0, 255]. La valeur par défaut est (255, 0, 0), représentant le rouge.

source: The ending color as an (R, G, B) tuple, where each value is in the range [0, 255]. The default is (0, 255, 0), which represents green.
fr: La couleur finale sous forme de tuple (R, G, B), où chaque valeur est dans l'intervalle [0, 255]. La valeur par défaut est (0, 255, 0), ce qui représente le vert.

source: **Returns**: - **pygame.Surface**:
fr: **Retour** : - **pygame.Surface** :

source: A 24-bit RGB pygame.Surface object of size (`w`, `h`) with the gradient applied.
fr: Un objet pygame.Surface RGB 24 bits de taille (`w`, `h`) avec le dégradé appliqué.

source: If `w` or `h` is not valid. If `color_start` or `color_end` is not a valid RGB tuple.
fr: Si `w` ou `h` n'est pas valide. Si `color_start` ou `color_end` n'est pas un tuple RGB valide.

source: **Summary**: Generates a 32-bit horizontal gradient with transparency between two RGBA colors. The function creates a smooth horizontal transition from `color_start` to `color_end` across the given width while maintaining the specified height.
fr: **Résumé** : Génère un dégradé horizontal 32 bits avec transparence entre deux couleurs RGBA. La fonction crée une transition horizontale fluide de `color_start` à `color_end` à travers la largeur donnée tout en maintenant la hauteur spécifiée.

source: The starting color in RGBA format, where each component (R, G, B, A) is in the range 0-255. Default: (255, 0, 0, 255) (opaque red).
fr: La couleur de départ au format RGBA, où chaque composant (R, G, B, A) est dans l'intervalle 0-255. Par défaut : (255, 0, 0, 255) (rouge opaque).

source: The ending color in RGBA format, where each component (R, G, B, A) is in the range 0-255. Default: (0, 255, 0, 0) (transparent green).
fr: La couleur de fin au format RGBA, où chaque composant (R, G, B, A) est dans l'intervalle 0-255. Par défaut : (0, 255, 0, 0) (vert transparent).

source: A 32-bit per pixel `pygame.Surface` with dimensions (w, h), containing the generated gradient with an alpha channel.
fr: Un `pygame.Surface` 32 bits par pixel avec les dimensions (w, h), contenant le dégradé généré avec un canal alpha.

source: If `w` or `h` is not a valid positive integer.
fr: Si `w` ou `h` n'est pas un entier positif valide.
