Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Misc.po
Languages: fr

source: **surface** (pygame.Surface): - A `pygame.Surface` object with a **32-bit pixel format**. - The surface's pixel data will be **modified directly**.
fr: **surface** (pygame.Surface) : - Un objet `pygame.Surface` avec un format de pixel **32 bits**. - Les données de pixels de la surface seront **modifiées directement**.

source: **Returns**: - **None** (modifies `surface` **in place**).
fr: **Retourne** : - **None** (modifie `surface` **sur place**).

source: **Exceptions**: - **TypeError**: If `surface` is not a valid `pygame.Surface`.
fr: **Exceptions** : - **TypeError** : Si `surface` n'est pas une `pygame.Surface` valide.

source: This function ensures **efficient, in-place modification** without copying data.
fr: Cette fonction garantit une **modification efficace sur place** sans copier de données.

source: Scrolling is **cyclic (toroidal wrap-around)**, meaning pixels that exit one edge **reappear** on the opposite edge.
fr: Le défilement est **cyclique (bouclage toroïdal)**, ce qui signifie que les pixels qui sortent par un bord **réapparaissent** sur le bord opposé.

source: **Summary**: Convert RGB color values into a single 32-bit integer, similar to pygame's map_rgb() function.
fr: **Résumé** : Convertit les valeurs de couleur RGB en un seul entier 32 bits, similaire à la fonction `pygame.map_rgb()`.

source: This Cython `cpdef` function allows direct calls without requiring a Python hook function. It efficiently encodes red, green, and blue values into a packed integer representation.
fr: Cette fonction `cpdef` Cython permet des appels directs sans nécessiter une fonction d'accroche Python. Elle encode efficacement les valeurs rouges, vertes et bleues en une représentation d'entier compactée.

source: **red** (unsigned char): - Red color component (0-255).
fr: **rouge** (char non signé) : - Composant de couleur rouge (0-255).

source: **green** (unsigned char): - Green color component (0-255).
fr: **vert** (char non signé) : - Composant de couleur verte (0-255).

source: **blue** (unsigned char): - Blue color component (0-255).
fr: **bleu** (char non signé) : - Composant de couleur bleue (0-255).

source: **unsigned int**: - A 32-bit unsigned integer representing the combined RGB color.
fr: **entier non signé** : - Un entier non signé de 32 bits représentant la couleur RGB combinée.

source: **Summary**: Converts a **32-bit unsigned integer** into an **RGB color representation**.
fr: **Résumé** : Convertit un **entier non signé de 32 bits** en une **représentation de couleur RGB**.

source: This function extracts the **red, green, and blue** components from a **packed integer format** (similar to `pygame.Color.unmap_rgb()`) and returns them as a **tuple** containing **values in the range [0, 255]**.
fr: Cette fonction extrait les composants **rouge, vert et bleu** d'un **format d'entier compacté** (similaire à `pygame.Color.unmap_rgb()`) et les renvoie sous la forme d'un **tuple** contenant des **valeurs dans la plage [0, 255]**.

source: **n** (int): - A **32-bit unsigned integer** representing an **RGB color**.
fr: **n** (int) : - Un **entier non signé de 32 bits** représentant une **couleur RGB**.

source: **tuple (unsigned char, unsigned char, unsigned char)**: - A tuple containing the **extracted** `(red, green, blue)` **values**.
fr: **tuple (char non signé, char non signé, char non signé)** : - Un tuple contenant les **valeurs extraites** `(rouge, vert, bleu)`.

source: **Summary**:
fr: **Résumé** :

source: Generates a **random floating-point number** in the range **[lower, upper)**.
fr: Génère un **nombre à virgule flottante aléatoire** dans la plage **[inférieur, supérieur)**.

source: This function is an **optimized alternative** to `random.uniform(lower, upper)`, leveraging an **external C function** (`randRangeFloat`) for improved performance.
fr: Cette fonction est une **alternative optimisée** à `random.uniform(lower, upper)`, utilisant une **fonction C externe** (`randRangeFloat`) pour améliorer les performances.

source: This function operates **without the Python GIL (`nogil`)**, making it **safe for parallel execution in Cython**.
fr: Cette fonction fonctionne **sans le GIL Python (`nogil`)**, ce qui la rend **sûre pour une exécution parallèle en Cython**.

source: **lower** (float):
fr: **inférieur** (float) :

source: The **lower bound** of the range (**inclusive**).
fr: La **borne inférieure** de la plage (**incluse**).

source: **upper** (float):
fr: **supérieur** (float) :

source: The **upper bound** of the range (**exclusive**).
fr: La **borne supérieure** de la plage (**exclusive**).

source: **Returns**: - **float**:
fr: **Retourne** : - **float** :

source: A **random float value** in the range **[lower, upper)**.
fr: Une **valeur flottante aléatoire** dans la plage **[inférieur, supérieur)**.

source: **Summary**: Generates a **random integer** in the range **[lower, upper]**.
fr: **Résumé** : Génère un **entier aléatoire** dans la plage **[inférieur, supérieur]**.

source: This function is an **optimized alternative** to `random.randint(lower, upper)`, leveraging an **external C function** (`randRange`) for improved performance.
fr: Cette fonction est une **alternative optimisée** à `random.randint(lower, upper)`, utilisant une **fonction C externe** (`randRange`) pour améliorer les performances.

source: **Performance Notes**:
fr: **Remarques de performance** :

source: Declared as **`inline`** for **faster execution**.
fr: Déclarée comme **`inline`** pour **une exécution plus rapide**.

source: Operates **without the Python Global Interpreter Lock (`nogil`)**, making it **safe for parallel execution in Cython**.
fr: Fonctionne **sans le verrou global de l'interpréteur Python (`nogil`)**, ce qui la rend **sûre pour une exécution parallèle en Cython**.

source: **lower** (int): - The **lower bound** of the range (**inclusive**).
fr: **inférieur** (int) : - La **borne inférieure** de la plage (**incluse**).

source: **upper** (int): - The **upper bound** of the range (**inclusive**).
fr: **supérieur** (int) : - La **borne supérieure** de la plage (**incluse**).

source: **int**: - A **random integer** in the range **[lower, upper]**.
fr: **int** : - Un **entier aléatoire** dans la plage **[inférieur, supérieur]**.

source: **Important Notes**:
fr: **Notes importantes** :

source: The function **does not check** whether `lower <= upper`. **Incorrect usage** may result in **undefined behavior**, depending on the `randRange` implementation.
fr: La fonction **ne vérifie pas** si `inférieur <= supérieur`. **Une utilisation incorrecte** peut entraîner un **comportement indéfini**, selon l'implémentation de `randRange`.

source: **Summary**: Combines separate **BGR** and **Alpha** memory buffers into a single **RGBA** buffer.
fr: **Résumé** : Combine des tampons mémoire séparés **BGR** et **Alpha** en un seul tampon **RGBA**.

source: This function takes **separate BGR** (Blue-Green-Red) and **Alpha** memory buffers, stacks them together into a single **RGBA buffer**, and optionally transposes the result. It is optimized using **Cython** and parallelized with **OpenMP** for improved performance.
fr: Cette fonction prend des tampons mémoire **séparés BGR** (Bleu-Vert-Rouge) et **Alpha**, les empile dans un seul **tampon RGBA**, et transpose éventuellement le résultat. Elle est optimisée à l'aide de **Cython** et parallélisée avec **OpenMP** pour améliorer les performances.

source: If `transpose_output` is **True**, the output memory view is flipped by swapping rows and columns.
fr: Si `transpose_output` est **True**, la vue mémoire de sortie est inversée en échangeant les lignes et les colonnes.

source: **w** (int): - The **width** of the texture.
fr: **w** (int) : - La **largeur** de la texture.

source: **h** (int): - The **height** of the texture.
fr: **h** (int) : - La **hauteur** de la texture.

source: **bgr_buffer** (memoryview [unsigned char [::1]]): - A **1D contiguous memory view** containing packed **BGR values** (uint8). - Expected size: `width * height * 3`.
fr: **bgr_buffer** (memoryview [char non signé [::1]]): - Une **vue mémoire 1D continue** contenant les **valeurs BGR** packagées (uint8). - Taille attendue : `largeur * hauteur * 3`.

source: **alpha_channel** (memoryview [unsigned char [::1]]): - A **1D contiguous memory view** containing **alpha values** (uint8). - Expected size: `width * height`.
fr: **alpha_channel** (memoryview [char non signé [::1]]): - Une **vue mémoire 1D continue** contenant les **valeurs alpha** (uint8). - Taille attendue : `largeur * hauteur`.

source: **output_rgba_buffer** (memoryview [unsigned char [::1]]): - A pre-allocated **1D memory view** to store the resulting **RGBA values** (uint8). - Expected size: `width * height * 4`.
fr: **output_rgba_buffer** (memoryview [char non signé [::1]]): - Une **vue mémoire 1D préallouée** pour stocker les **valeurs RGBA** résultantes (uint8). - Taille attendue : `largeur * hauteur * 4`.

source: **transpose_output** (bool, optional, default=False): - If **True**, the resulting **RGBA buffer** is transposed (flipped).
fr: **transpose_output** (booléen, optionnel, par défaut=False) : - Si **True**, le **tampon RGBA résultant** est transposé (retourné).

source: **Returns**: - **memoryview [unsigned char [::1]]**:
fr: **Retourne** : - **memoryview [char non signé [::1]]** :

source: A contiguous **memory view** containing the combined **RGBA pixel values** (uint8).
fr: Une **vue mémoire continue** contenant les **valeurs de pixels RGBA** combinées (uint8).

source: If `w` or `h` is **non-positive**.
fr: Si `w` ou `h` est **non positif**.

source: If `bgr_buffer` size does not match `width * height * 3`.
fr: Si la taille de `bgr_buffer` ne correspond pas à `largeur * hauteur * 3`.

source: If `alpha_channel` size does not match `width * height`.
fr: Si la taille de `alpha_channel` ne correspond pas à `largeur * hauteur`.

source: If `output_rgba_buffer` is not large enough to store `width * height * 4`.
fr: Si `output_rgba_buffer` n'est pas suffisamment grand pour stocker `largeur * hauteur * 4`.

source: Uses **`memcpy`** for **efficient memory copying**.
fr: Utilise **`memcpy`** pour **un copier de mémoire efficace**.

source: Supports optional **transposition** of the buffer.
fr: Prend en charge la **transposition** optionnelle du tampon.

source: Designed for **performance-critical applications**.
fr: Conçu pour des **applications nécessitant des performances critiques**.

source: **Summary**: Normalize a **2D array** of unsigned 8-bit integers (**uint8**) to floating-point values in the range **[0, 1]**.
fr: **Résumé** : Normalise un **tableau 2D** d'entiers non signés de 8 bits (**uint8**) en valeurs flottantes dans la plage **[0, 1]**.

source: This function takes a **2D array** with shape `(width, height)` containing **uint8 values** (0-255) and converts it into a **MemoryViewSlice (2D array)** of floats, where each value is rescaled to the range **[0, 1]**.
fr: Cette fonction prend un **tableau 2D** de forme `(largeur, hauteur)` contenant des **valeurs uint8** (0-255) et le convertit en un **MemoryViewSlice (tableau 2D)** de nombres à virgule flottante, où chaque valeur est mise à l'échelle dans la plage **[0, 1]**.

source: **array2d** (memoryview [unsigned char[:, :]]): - A **2D array** of shape `(width, height)` containing **uint8 values** representing pixel intensities.
fr: **array2d** (memoryview [unsigned char[:, :]]): - Un **tableau 2D** de forme `(largeur, hauteur)` contenant des **valeurs uint8** représentant l'intensité des pixels.

source: **Returns**: - **memoryview [float[:, :]]**:
fr: **Retourne** : - **memoryview [float[:, :]]** :

source: A **2D array** of shape `(width, height)` with **float values** normalized to the range [0, 1].
fr: Un **tableau 2D** de forme `(largeur, hauteur)` avec des **valeurs flottantes** normalisées dans la plage [0, 1].

source: **ValueError**: - If the input array does not have **exactly two dimensions**.
fr: **ValueError** : - Si le tableau d'entrée n'a pas **exactement deux dimensions**.

source: **Notes**: - Uses **`prange`** with **OpenMP** for **parallelized operations** to improve performance. - Performs element-wise normalization using the constant `ONE_255 = 1/255.0`. - Designed for **fast image processing** and **machine learning applications**.
fr: **Notes** : - Utilise **`prange`** avec **OpenMP** pour des **opérations parallélisées** afin d'améliorer les performances. - Effectue une normalisation élément par élément en utilisant la constante `ONE_255 = 1/255.0`. - Conçu pour un **traitement d'image rapide** et des **applications d'apprentissage automatique**.

source: **Summary**: Create a **pygame surface** displaying the **light spectrum** ranging from **380-750 nm**.
fr: **Résumé** : Crée une **surface pygame** affichant le **spectre lumineux** allant de **380 à 750 nm**.

source: The function visualizes the light spectrum by displaying colors corresponding to specific wavelengths. The spectrum includes the following color regions:
fr: La fonction visualise le spectre lumineux en affichant les couleurs correspondant à des longueurs d'onde spécifiques. Le spectre comprend les zones de couleur suivantes :

source: **Red**: 620-750 nm, 484-400 THz
fr: **Rouge** : 620-750 nm, 484-400 THz

source: **Yellow**: 570-590 nm, 526-508 THz
fr: **Jaune** : 570-590 nm, 526-508 THz

source: **Green**: 495-570 nm, 606-526 THz
fr: **Vert** : 495-570 nm, 606-526 THz

source: **Blue**: 450-495 nm, 668-606 THz
fr: **Bleu** : 450-495 nm, 668-606 THz

source: **width** (int): - The width of the surface (image) in pixels.
fr: **largeur** (int) : - La largeur de la surface (image) en pixels.

source: **height** (int): - The height of the surface (image) in pixels.
fr: **hauteur** (int) : - La hauteur de la surface (image) en pixels.

source: **gamma** (float, optional, default=1.0): - The gamma value for color adjustment.
fr: **gamma** (float, optionnel, par défaut=1.0) : - La valeur gamma pour ajuster la couleur.

source: A **24-bit pygame surface** with shape `(width, height)` containing the light spectrum. It is optimized for fast **blit** operations.
fr: Une **surface pygame de 24 bits** de forme `(largeur, hauteur)` contenant le spectre lumineux. Elle est optimisée pour des opérations **blit** rapides.

source: Sorts an array of **unsigned chars** (e.g., bytes or pixel values) using the **bubble sort algorithm**.
fr: Trie un tableau de **caractères non signés** (par exemple, octets ou valeurs de pixels) en utilisant l'**algorithme de tri à bulles**.

source: Bubble sort iteratively compares adjacent elements in the array and swaps them if they are in the wrong order. The process continues until the array is fully sorted. The algorithm stops when no swaps are made during a complete pass.
fr: Le tri à bulles compare itérativement les éléments adjacents dans le tableau et les échange si nécessaire. Le processus continue jusqu'à ce que le tableau soit entièrement trié. L'algorithme s'arrête lorsqu'aucun échange n'est effectué pendant un passage complet.

source: **nums** (unsigned char [::1]): - A one-dimensional memoryview or array of unsigned char values to be sorted. Typically, this array represents byte values or pixel data (e.g., RGB values).
fr: **nums** (unsigned char [::1]) : - Une vue mémoire ou un tableau unidimensionnel de valeurs de caractères non signés à trier. Typiquement, ce tableau représente des valeurs d'octets ou des données de pixels (par exemple, valeurs RVB).

source: **size** (int): - The number of elements in the `nums` array to sort.
fr: **taille** (int) : - Le nombre d'éléments dans le tableau `nums` à trier.

source: **None**: - This function sorts the array **in place**. No value is returned; the input array is modified directly.
fr: **None** : - Cette fonction trie le tableau **sur place**. Aucune valeur n'est retournée ; le tableau d'entrée est modifié directement.

source: **Notes**: - This is an **in-place sorting algorithm**, meaning it modifies the original array. - Bubble sort is not the most efficient sorting algorithm, but it is simple to implement. - The algorithm runs in **O(n^2)** time in the worst and average cases, which makes it less efficient for large datasets.
fr: **Notes** : - Il s'agit d'un **algorithme de tri sur place**, ce qui signifie qu'il modifie le tableau d'origine. - Le tri à bulles n'est pas l'algorithme de tri le plus efficace, mais il est simple à implémenter. - L'algorithme fonctionne en **O(n^2)** dans les pires et moyennes situations, ce qui le rend moins efficace pour de grands ensembles de données.

source: **Summary**: Sorts an array of **unsigned char** elements using the **Insertion Sort algorithm**.
fr: **Résumé** : Trie un tableau d'éléments de **caractères non signés** en utilisant l'**algorithme de tri par insertion**.

source: Insertion sort iterates through the array, picking each element one by one, and inserts it into the sorted portion of the array while shifting the other elements accordingly. This implementation uses **parallel processing** for improved performance.
fr: Le tri par insertion parcourt le tableau, prend chaque élément un par un, et l'insère dans la portion triée du tableau en déplaçant les autres éléments en conséquence. Cette implémentation utilise le **traitement parallèle** pour améliorer les performances.

source: **nums** (unsigned char [::1]): - A 1D numpy array or memory view of unsigned char (uint8) elements, representing the array to be sorted.
fr: **nums** (unsigned char [::1]) : - Un tableau numpy 1D ou une vue mémoire de caractères non signés (uint8), représentant le tableau à trier.

source: **size** (int): - The size of the array `nums`. It specifies the number of elements in the array.
fr: **taille** (int) : - La taille du tableau `nums`. Elle spécifie le nombre d'éléments dans le tableau.

source: **Notes**: - The algorithm runs in **O(n^2)** time complexity in the worst and average cases, making it less efficient for large datasets. - Insertion sort is particularly efficient for small datasets or arrays that are already nearly sorted. - Parallel processing is utilized in this implementation to improve performance.
fr: **Notes** : - L'algorithme fonctionne avec une complexité temporelle de **O(n^2)** dans les pires et moyennes situations, ce qui le rend moins efficace pour de grands ensembles de données. - Le tri par insertion est particulièrement efficace pour les petits ensembles de données ou les tableaux déjà presque triés. - Le traitement parallèle est utilisé dans cette implémentation pour améliorer les performances.

source: **Summary**: Partition function for the **quicksort algorithm**.
fr: **Résumé** : Fonction de partition pour l'**algorithme de tri rapide**.

source: This function selects a pivot element and partitions the input array `nums` such that all elements less than the pivot are moved to its left, and all elements greater than the pivot are moved to its right. It returns the index of the partition point.
fr: Cette fonction sélectionne un élément pivot et partitionne le tableau d'entrée `nums` de sorte que tous les éléments inférieurs au pivot sont déplacés vers la gauche, et tous les éléments supérieurs au pivot sont déplacés vers la droite. Elle retourne l'indice du point de partition.

source: **nums** (unsigned char [::1]): - A 1D memoryview of unsigned char values, representing the input array to be partitioned.
fr: **nums** (unsigned char [::1]) : - Une vue mémoire 1D de valeurs de caractères non signés, représentant le tableau d'entrée à partitionner.

source: **low** (int): - The starting index of the subarray to be partitioned.
fr: **low** (int) : - L'indice de début du sous-tableau à partitionner.

source: **high** (int): - The ending index of the subarray to be partitioned.
fr: **high** (int) : - L'indice de fin du sous-tableau à partitionner.

source: **int**: - The index of the partition point in the array.
fr: **int** : - L'indice du point de partition dans le tableau.

source: **Notes**: - This function is used as part of the quicksort algorithm. - It ensures that elements less than the pivot are on the left, and elements greater than the pivot are on the right.
fr: **Notes** : - Cette fonction est utilisée dans le cadre de l'algorithme de tri rapide. - Elle garantit que les éléments inférieurs au pivot sont à gauche, et les éléments supérieurs au pivot sont à droite.

source: **Summary**: In-place quicksort implementation for an array of unsigned char values.
fr: **Résumé** : Implémentation du tri rapide **sur place** pour un tableau de valeurs de caractères non signés.

source: This function recursively sorts the array `items` by selecting a pivot and partitioning the array such that elements smaller than the pivot move to the left and larger elements move to the right. It is optimized to reduce recursion depth by sorting the smaller partition first.
fr: Cette fonction trie récursivement le tableau `items` en sélectionnant un pivot et partitionnant le tableau de sorte que les éléments plus petits que le pivot se déplacent vers la gauche et les éléments plus grands se déplacent vers la droite. Elle est optimisée pour réduire la profondeur de récursion en triant d'abord la plus petite partition.

source: **items** (unsigned char [::1]): - A 1D memoryview of unsigned char values, representing the input array to be sorted.
fr: **items** (unsigned char [::1]) : - Une vue mémoire 1D de valeurs de caractères non signés, représentant le tableau d'entrée à trier.

source: **low** (unsigned int): - The starting index of the subarray to be sorted.
fr: **low** (unsigned int) : - L'indice de début du sous-tableau à trier.

source: **high** (unsigned int): - The ending index of the subarray to be sorted.
fr: **high** (unsigned int) : - L'indice de fin du sous-tableau à trier.

source: **Summary**: Ultra-optimized iterative heapify function for maintaining the max heap property.
fr: **Résumé** : Fonction `heapify` itérative ultra-optimisée pour maintenir la propriété de tas maximal.

source: This function “sifts down” the value at the given root index so that the subtree rooted at that index becomes a valid max heap. It is assumed that the subtrees below are already valid heaps. For full heapsort, make sure to build the heap by calling this function on all non-leaf nodes in reverse order.
fr: Cette fonction « filtre vers le bas » la valeur à l'indice de racine donné afin que le sous-arbre ancré à cet indice devienne un tas maximal valide. On suppose que les sous-arbres en dessous sont déjà des tas valides. Pour un tri par tas complet, assurez-vous de construire le tas en appelant cette fonction sur tous les nœuds non-feuilles dans l'ordre inverse.

source: **nums** (unsigned char [::1]): - A 1D memoryview of unsigned char values, representing the heap.
fr: **nums** (unsigned char [::1]) : - Une vue mémoire 1D de valeurs de caractères non signés, représentant le tas.

source: **heap_size** (unsigned int): - The number of elements in the heap.
fr: **heap_size** (unsigned int) : - Le nombre d'éléments dans le tas.

source: **root_index** (unsigned int): - The index of the root node of the subtree to heapify.
fr: **root_index** (unsigned int) : - L'indice du nœud racine du sous-arbre à `heapifier`.

source: **Summary**: Performs in-place heap sort on an array of unsigned char values.
fr: **Résumé** : Effectue un tri par tas sur place sur un tableau de valeurs de caractères non signés.
