Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Misc.po
Languages: fr

source: This function first builds a max heap from the input array, ensuring the largest element is at the root. Then, it repeatedly extracts the maximum element (swaps it with the last element) and re-heapifies the reduced heap to maintain heap properties until the entire array is sorted.
fr: Cette fonction construit d'abord un tas maximal à partir du tableau d'entrée, garantissant que l'élément le plus grand se trouve à la racine. Ensuite, elle extrait de manière répétée l'élément maximum (en l'échangeant avec le dernier élément) et re-heapifie le tas réduit pour maintenir les propriétés du tas jusqu'à ce que le tableau entier soit trié.

source: **Time Complexity**: - Heap construction: O(n) - Extraction and re-heapification: O(n log n) - Overall: O(n log n)
fr: **Complexité temporelle** : - Construction du tas : O(n) - Extraction et re-heapification : O(n log n) - Globalement : O(n log n)

source: **Space Complexity**: O(1) (in-place sorting)
fr: **Complexité spatiale** : O(1) (tri sur place)

source: **nums** (unsigned char [::1]): - A 1D memoryview of unsigned char values to be sorted.
fr: **nums** (unsigned char [::1]) : - Une vue mémoire 1D de valeurs de caractères non signés à trier.

source: **n** (unsigned int): - The number of elements in the array.
fr: **n** (unsigned int) : - Le nombre d'éléments dans le tableau.
