Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Misc.po
Languages: fr

source: If `color_start` or `color_end` is not a tuple of four integers (0-255).
fr: Si `color_start` ou `color_end` n'est pas un tuple de quatre entiers (0-255).

source: **Summary**: Generates a radial gradient (24-bit RGB) with a smooth transition between two colors, centered within a rectangular surface of given width and height. The gradient radiates from the center of the surface, and the transition between colors is based on the distance from the center, allowing for various gradient effects (such as circular or radial). Optionally, a precomputed gradient can be used, or one can be generated dynamically.
fr: **Résumé** : Génère un dégradé radial (RGB 24 bits) avec une transition fluide entre deux couleurs, centré dans une surface rectangulaire de largeur et hauteur données. Le dégradé rayonne depuis le centre de la surface, et la transition entre les couleurs est basée sur la distance au centre, permettant divers effets de dégradé (tel que circulaire ou radial). Optionnellement, un dégradé pré-calculé peut être utilisé, ou un dégradé peut être généré dynamiquement.

source: The width of the output gradient surface in pixels (must be > 0).
fr: La largeur de la surface du dégradé de sortie en pixels (doit être > 0).

source: The height of the output gradient surface in pixels (must be > 0).
fr: La hauteur de la surface du dégradé de sortie en pixels (doit être > 0).

source: **offset_x** (float, optional):
fr: **offset_x** (float, optionnel) :

source: The horizontal offset of the gradient center, where 0.5 represents the center of the surface (default is 0.5).
fr: Le décalage horizontal du centre du dégradé, où 0,5 représente le centre de la surface (par défaut 0,5).

source: **offset_y** (float, optional):
fr: **offset_y** (float, optionnel) :

source: The vertical offset of the gradient center, where 0.5 represents the center of the surface (default is 0.5).
fr: Le décalage vertical du centre du dégradé, où 0,5 représente le centre de la surface (par défaut 0,5).

source: The starting color of the gradient in RGB format (0-255). Default is (255, 0, 0), which corresponds to opaque red.
fr: La couleur de départ du dégradé au format RGB (0-255). Par défaut, (255, 0, 0), ce qui correspond au rouge opaque.

source: The ending color of the gradient in RGB format (0-255). Default is (0, 0, 0), which corresponds to black.
fr: La couleur de fin du dégradé au format RGB (0-255). Par défaut : (0, 0, 0), ce qui correspond au noir.

source: **precomputed_gradient** (numpy.array, optional):
fr: **precomputed_gradient** (numpy.array, optionnel) :

source: A precomputed gradient 2D array (shape: (n, 3), containing RGB values). If not provided, a new gradient will be computed.
fr: Un tableau 2D de dégradé pré-calculé (forme : (n, 3), contenant les valeurs RGB). Si non fourni, un nouveau dégradé sera calculé.

source: **scale_factor** (float, optional):
fr: **scale_factor** (float, optionnel) :

source: A scaling factor that adjusts the radius of the gradient. A value greater than 1 will increase the size of the gradient, and values smaller than 1 will reduce its radius. Default is 1.4. Must be > 0.
fr: Un facteur de mise à l'échelle qui ajuste le rayon du dégradé. Une valeur supérieure à 1 augmentera la taille du dégradé, et des valeurs inférieures à 1 réduiront son rayon. Par défaut : 1,4. Doit être > 0.

source: **threads** (int, optional):
fr: **threads** (int, optionnel) :

source: The number of concurrent threads to use for gradient computation. Default is 8.
fr: Le nombre de threads simultanés à utiliser pour le calcul du dégradé. Par défaut 8.

source: A `pygame.Surface` object with the generated radial gradient, centered at (w/2, h/2), in 24-bit RGB format.
fr: Un objet `pygame.Surface` avec le dégradé radial généré, centré à (w/2, h/2), au format RGB 24 bits.

source: If `color_start` or `color_end` is not a tuple of 3 integers.
fr: Si `color_start` ou `color_end` n'est pas un tuple de 3 entiers.

source: If any RGB value in `color_start` or `color_end` is out of range (0-255).
fr: Si une valeur RGB dans `color_start` ou `color_end` est hors de portée (0-255).

source: If `scale_factor` is None or <= 0.
fr: Si `scale_factor` est None ou <= 0.

source: If `w` or `h` is <= 1.
fr: Si `w` ou `h` est <= 1.

source: If `precomputed_gradient` is not a contiguous array.
fr: Si `precomputed_gradient` n'est pas un tableau contigu.

source: If `precomputed_gradient` is not a 2D array, not of type uint8, has length <= 1, or is not in RGB format.
fr: Si `precomputed_gradient` n'est pas un tableau 2D, n'est pas de type uint8, a une longueur <= 1, ou n'est pas au format RGB.

source: **Credits**: Function improved with collaboration from ChatGPT.
fr: **Crédits** : Fonction améliorée avec la collaboration de ChatGPT.

source: **Summary**: Creates a 32-bit radial gradient with transparency, blending smoothly between two RGBA colors (`color_start` and `color_end`), and supports optional precomputed gradient arrays for performance optimization.
fr: **Résumé** : Crée un dégradé radial 32 bits avec transparence, fusionnant en douceur entre deux couleurs RGBA (`color_start` et `color_end`), et prend en charge les tableaux de dégradé pré-calculés pour l'optimisation des performances.

source: **w** (int): The width of the surface in pixels (must be > 1).
fr: **w** (int) : La largeur de la surface en pixels (doit être > 1).

source: **h** (int): The height of the surface in pixels (must be > 1).
fr: **h** (int) : La hauteur de la surface en pixels (doit être > 1).

source: **offset_x** (float, optional): The X-coordinate of the gradient center as a fraction of the width (default is 0.5).
fr: **offset_x** (float, optionnel) : La coordonnée X du centre du dégradé en fraction de la largeur (par défaut 0.5).

source: **offset_y** (float, optional): The Y-coordinate of the gradient center as a fraction of the height (default is 0.5).
fr: **offset_y** (float, optionnel) : La coordonnée Y du centre du dégradé en fraction de la hauteur (par défaut 0.5).

source: **color_start** (tuple, optional): The starting RGBA color of the gradient (default is (255, 0, 0, 255)).
fr: **color_start** (tuple, optionnel) : La couleur RGBA de départ du dégradé (par défaut (255, 0, 0, 255)).

source: **color_end** (tuple, optional): The ending RGBA color of the gradient (default is (0, 0, 0, 0)).
fr: **color_end** (tuple, optionnel) : La couleur RGBA de fin du dégradé (par défaut (0, 0, 0, 0)).

source: **precomputed_gradient** (numpy.ndarray or None, optional): A precomputed gradient array of shape (w, 4) in uint8 format for optimization (default is None).
fr: **precomputed_gradient** (numpy.ndarray ou None, optionnel) : Un tableau de dégradé pré-calculé de forme (w, 4) au format uint8 pour l'optimisation (par défaut None).

source: **scale_factor** (float, optional): The scaling factor for the gradient (must be > 0, default is `r_max`).
fr: **scale_factor** (float, optionnel) : Le facteur de mise à l'échelle pour le dégradé (doit être > 0, la valeur par défaut est `r_max`).

source: **threads** (unsigned short int, optional): The number of threads to use for parallel computation (default is 8).
fr: **threads** (entier court non signé, optionnel) : Le nombre de threads à utiliser pour le calcul parallèle (la valeur par défaut est 8).

source: **Returns**: - **pygame.Surface**: A surface containing the generated radial gradient with per-pixel transparency.
fr: **Retourne** : - **pygame.Surface** : Une surface contenant le dégradé radial généré avec une transparence par pixel.

source: **Raises**: - **ValueError**: If `color_start` or `color_end` is not a tuple of four integers, if any RGBA value is out of range (0-255), or if `scale_factor` is None or <= 0. - **ValueError**: If `w` or `h` is <= 1. - **TypeError**: If `precomputed_gradient` is not a contiguous array. - **ValueError**: If `precomputed_gradient` is not a 2D array, not of type uint8, has length <= 1, or is not in RGBA format.
fr: **Lève** : - **ValueError** : Si `color_start` ou `color_end` n'est pas un tuple de quatre entiers, si une valeur RGBA est hors de la plage (0-255), ou si `scale_factor` est None ou <= 0. - **ValueError** : Si `w` ou `h` est <= 1. - **TypeError** : Si `precomputed_gradient` n'est pas un tableau contigu. - **ValueError** : Si `precomputed_gradient` n'est pas un tableau 2D, n'est pas de type uint8, a une longueur <= 1, ou n'est pas en format RGBA.

source: **Summary**: Generates a quarter radial gradient (24-bit opaque). This function creates a **radial gradient** by iterating over the **northwest (NW) quarter** of the surface (`width_/2`, `height_/2`) and mirroring the computed pixels to the remaining three quadrants (**northeast (NE), southeast (SE), and southwest (SW)**).
fr: **Résumé** : Génère un dégradé radial d'un quart (24 bits opaque). Cette fonction crée un **dégradé radial** en itérant sur le **quart nord-ouest (NW)** de la surface (`width_/2`, `height_/2`) et en miroir les pixels calculés dans les trois autres quadrants (**nord-est (NE), sud-est (SE) et sud-ouest (SW)**).

source: The gradient transitions from `start_color_` at the center to `end_color_` at the edges.
fr: Le dégradé passe de `start_color_` au centre à `end_color_` sur les bords.

source: **width_** (int): The width of the surface in pixels (must be > 1).
fr: **width_** (int) : La largeur de la surface en pixels (doit être > 1).

source: **height_** (int): The height of the surface in pixels (must be > 1).
fr: **height_** (int) : La hauteur de la surface en pixels (doit être > 1).

source: **start_color_** (tuple, optional): The starting RGB color at the center of the gradient. Default is **(255, 0, 0) [Red]**.
fr: **start_color_** (tuple, optionnel) : La couleur RGB de départ au centre du dégradé. Par défaut, c'est **(255, 0, 0) [Rouge]**.

source: **end_color_** (tuple, optional): The ending RGB color at the outer edge of the gradient. Default is **(0, 0, 0) [Black]**.
fr: **end_color_** (tuple, optionnel) : La couleur RGB de fin sur le bord extérieur du dégradé. Par défaut, c'est **(0, 0, 0) [Noir]**.

source: **gradient_array_** (numpy.ndarray or None, optional): A NumPy array of shape `(width_, 3)`, containing precomputed RGB color values (`uint8`). If `None`, the gradient is computed dynamically.
fr: **gradient_array_** (numpy.ndarray ou None, optionnel) : Un tableau NumPy de forme `(width_, 3)`, contenant des valeurs de couleur RGB précalculées (`uint8`). Si `None`, le dégradé est calculé dynamiquement.

source: **factor_** (float, optional): Controls the intensity and spread of the gradient. **Must be > 0**. Default is **1.4**.
fr: **factor_** (float, optionnel) : Contrôle l'intensité et l'étalement du dégradé. **Doit être > 0**. La valeur par défaut est **1.4**.

source: **threads_** (int, optional): Number of concurrent threads to use for computation. Default is **8**.
fr: **threads_** (int, optionnel) : Le nombre de threads concurrents à utiliser pour le calcul. La valeur par défaut est **8**.

source: A `pygame.Surface` object containing the radial gradient, **centered at (width_/2, height_/2)**.
fr: Un objet `pygame.Surface` contenant le dégradé radial, **centré sur (width_/2, height_/2)**.

source: **Summary**: Generates a quarter radial gradient with alpha transparency (32-bit). This function creates a **radial gradient with transparency** by iterating over the **northwest (NW) quarter** of the surface (`width_/2`, `height_/2`) and mirroring the computed pixels to the remaining three quadrants (**northeast (NE), southeast (SE), and southwest (SW)**).
fr: **Résumé** : Génère un dégradé radial d'un quart avec transparence alpha (32 bits). Cette fonction crée un **dégradé radial avec transparence** en itérant sur le **quart nord-ouest (NW)** de la surface (`width_/2`, `height_/2`) et en miroir les pixels calculés dans les trois autres quadrants (**nord-est (NE), sud-est (SE) et sud-ouest (SW)**).

source: The gradient smoothly transitions from `start_color_` at the center to `end_color_` at the edges, incorporating **alpha blending for transparency**.
fr: Le dégradé passe en douceur de `start_color_` au centre à `end_color_` sur les bords, avec un **mélange alpha pour la transparence**.

source: **start_color_** (tuple, optional): The color at the **center** of the gradient in **RGBA format**. Default is **(255, 0, 0, 255) [Opaque Red]**.
fr: **start_color_** (tuple, optionnel) : La couleur au **centre** du dégradé en **format RGBA**. La valeur par défaut est **(255, 0, 0, 255) [Rouge opaque]**.

source: **end_color_** (tuple, optional): The color at the **outer edge** of the gradient in **RGBA format**. Default is **(0, 0, 0, 0) [Fully Transparent Black]**.
fr: **end_color_** (tuple, optionnel) : La couleur au **bord extérieur** du dégradé en **format RGBA**. La valeur par défaut est **(0, 0, 0, 0) [Noir entièrement transparent]**.

source: **gradient_array_** (numpy.ndarray or None, optional): A NumPy array of shape `(width_, 4)`, containing precomputed RGBA color values (`uint8`). If `None`, the gradient is computed dynamically.
fr: **gradient_array_** (numpy.ndarray ou None, optionnel) : Un tableau NumPy de forme `(width_, 4)`, contenant des valeurs de couleur RGBA précalculées (`uint8`). Si `None`, le dégradé est calculé dynamiquement.

source: A `pygame.Surface` object containing the radial gradient, **centered at (width_/2, height_/2)**, with **alpha transparency for smooth blending**.
fr: Un objet `pygame.Surface` contenant le dégradé radial, **centré sur (width_/2, height_/2)**, avec **transparence alpha pour un fondu en douceur**.

source: **Summary**: Scrolls a **24-bit or 32-bit** Pygame surface **horizontally and/or vertically**.
fr: **Résumé** : Fait défiler une surface Pygame **24 bits ou 32 bits** **horizontalement et/ou verticalement**.

source: This function creates and returns a **new 24-bit surface** with the pixel data shifted according to the specified `dx` and `dy` values. Pixels that are shifted out of bounds will **wrap around** to the opposite side.
fr: Cette fonction crée et retourne une **nouvelle surface 24 bits** avec les données de pixels décalées selon les valeurs spécifiées de `dx` et `dy`. Les pixels qui dépassent seront **déplacés** de l'autre côté.

source: **surface** (pygame.Surface): A Pygame `Surface` object in **24-bit or 32-bit** format.
fr: **surface** (pygame.Surface) : Un objet `Surface` Pygame en format **24 bits ou 32 bits**.

source: **dx** (int): The number of pixels to scroll **horizontally**. - A **positive `dx`** shifts the surface to the **right**. - A **negative `dx`** shifts the surface to the **left**.
fr: **dx** (int) : Le nombre de pixels à faire défiler **horizontalement**. - Un **`dx` positif** déplace la surface vers la **droite**. - Un **`dx` négatif** déplace la surface vers la **gauche**.

source: **dy** (int): The number of pixels to scroll **vertically**. - A **positive `dy`** shifts the surface **downward**. - A **negative `dy`** shifts the surface **upward**.
fr: **dy** (int) : Le nombre de pixels à faire défiler **verticalement**. - Un **`dy` positif** déplace la surface **vers le bas**. - Un **`dy` négatif** déplace la surface **vers le haut**.

source: A **new** 24-bit `pygame.Surface` object with the applied scroll effect.
fr: Un objet `pygame.Surface` 24 bits **nouveau** avec l'effet de défilement appliqué.

source: **Raises**: - **TypeError**:
fr: **Lève** : - **TypeError** :

source: If `surface` is **not** a `pygame.Surface` object.
fr: Si `surface` n'est **pas** un objet `pygame.Surface`.

source: This shifts the surface **10 pixels to the right** and **5 pixels upward**.
fr: Cela déplace la surface de **10 pixels vers la droite** et de **5 pixels vers le haut**.

source: **center** (tuple, optional): The **(x, y)** coordinates of the **center** of the surface to scroll. Default is **(width_/2, height_/2)**.
fr: **center** (tuple, optionnel) : Les coordonnées **(x, y)** du **centre** de la surface à faire défiler. La valeur par défaut est **(width_/2, height_/2)**.

source: **Returns**: A **new** surface with the applied scroll effect.
fr: **Retourne** : Une **nouvelle** surface avec l'effet de défilement appliqué.

source: A `pygame.Surface` object in **24-bit or 32-bit** format (compatible with pixel access).
fr: Un objet `pygame.Surface` en format **24 bits ou 32 bits** (compatible avec l'accès aux pixels).

source: **dx** (int): Horizontal scroll amount. - **Positive values** move pixels **to the right**. - **Negative values** move pixels **to the left**.
fr: **dx** (int) : Quantité de défilement horizontal. - **Les valeurs positives** déplacent les pixels **vers la droite**. - **Les valeurs négatives** déplacent les pixels **vers la gauche**.

source: **dy** (int): Vertical scroll amount. - **Positive values** move pixels **downward**. - **Negative values** move pixels **upward**.
fr: **dy** (int) : Quantité de défilement vertical. - **Les valeurs positives** déplacent les pixels **vers le bas**. - **Les valeurs négatives** déplacent les pixels **vers le haut**.

source: **Returns**:
fr: **Retourne** :

source: **None** (modifies the surface **in place**).
fr: **None** (modifie la surface **sur place**).

source: This shifts the surface **1 pixel to the right** without creating a new surface.
fr: Cela déplace la surface de **1 pixel vers la droite** sans créer une nouvelle surface.

source: **Summary**: Scrolls a **3D RGB pixel array** horizontally and/or vertically **in place**.
fr: **Résumé** : Fait défiler un **tableau de pixels RGB 3D** horizontalement et/ou verticalement **sur place**.

source: This function **modifies** the given `rgb_array` **directly** by shifting pixel values based on the specified horizontal (`dx`) and vertical (`dy`) offsets. Scrolling **wraps around**, meaning pixels shifted beyond the array's boundaries reappear on the opposite side.
fr: Cette fonction **modifie** directement le `rgb_array` donné en déplaçant les valeurs de pixels en fonction des décalages horizontaux (`dx`) et verticaux (`dy`). Le défilement **fait une boucle**, ce qui signifie que les pixels déplacés au-delà des limites du tableau réapparaissent de l'autre côté.

source: **rgb_array** (numpy.ndarray): - A **3D NumPy array** containing **RGB pixel values**. - The array must reference **all pixels** to ensure modification in place. - Expected shape: **(height, width, 3)** (RGB format).
fr: **rgb_array** (numpy.ndarray) : - Un **tableau NumPy 3D** contenant des **valeurs de pixels RGB**. - Le tableau doit référencer **tous les pixels** pour garantir la modification sur place. - Forme attendue : **(hauteur, largeur, 3)** (format RGB).

source: **dx** (int, optional, default=0): - **Horizontal shift amount**. - **Negative values** move pixels **left**. - **Positive values** move pixels **right**.
fr: **dx** (int, optionnel, défaut=0) : - **Quantité de décalage horizontal**. - **Les valeurs négatives** déplacent les pixels **à gauche**. - **Les valeurs positives** déplacent les pixels **à droite**.

source: **dy** (int, optional, default=0): - **Vertical shift amount**. - **Negative values** move pixels **up**. - **Positive values** move pixels **down**.
fr: **dy** (int, optionnel, défaut=0) : - **Quantité de décalage vertical**. - **Les valeurs négatives** déplacent les pixels **vers le haut**. - **Les valeurs positives** déplacent les pixels **vers le bas**.

source: **Returns**: - **None** (modifies `rgb_array` **in place**).
fr: **Retourne** : - **None** (modifie `rgb_array` **sur place**).

source: **Raises**:
fr: **Lève** :

source: **TypeError**: If `rgb_array` is **not** a `numpy.ndarray` or `memoryviewslice`.
fr: **TypeError** : Si `rgb_array` n'est **pas** un `numpy.ndarray` ou `memoryviewslice`.

source: **ValueError**: - If `rgb_array` is **not a 3D array** with shape `(height, width, 3)`. - If `rgb_array.dtype` is **not** `numpy.uint8` (expected **8-bit RGB format**). - If `rgb_array` is **empty** (`shape[0] == 0`).
fr: **ValueError** : - Si `rgb_array` n'est **pas un tableau 3D** avec la forme `(hauteur, largeur, 3)`. - Si `rgb_array.dtype` n'est **pas** `numpy.uint8` (format RGB **8 bits attendu**). - Si `rgb_array` est **vide** (`shape[0] == 0`).

source: If both `dx` and `dy` are zero, the function performs **no operation**.
fr: Si `dx` et `dy` sont tous deux à zéro, la fonction n'effectue **aucune opération**.

source: This function is optimized for **performance** and operates **without copying data**.
fr: Cette fonction est optimisée pour la **performance** et fonctionne **sans copier de données**.

source: The array must be **contiguous** and properly referenced to avoid unexpected behavior.
fr: Le tableau doit être **contigu** et correctement référencé pour éviter des comportements inattendus.

source: This shifts the array **5 pixels to the right** and **2 pixels upward**.
fr: Cela déplace le tableau de **5 pixels vers la droite** et de **2 pixels vers le haut**.

source: **Summary**: Scrolls an **alpha channel array** (2D) **horizontally and/or vertically** **in place**.
fr: **Résumé** : Fait défiler un **tableau de canal alpha** (2D) **horizontalement et/ou verticalement** **sur place**.

source: This function **modifies** the given `alpha_array` **directly** by shifting alpha values based on the specified horizontal (`dx`) and vertical (`dy`) offsets. Scrolling **wraps around**, meaning pixels shifted beyond the array's boundaries reappear on the opposite side.
fr: Cette fonction **modifie** directement le `alpha_array` donné en déplaçant les valeurs alpha en fonction des décalages horizontaux (`dx`) et verticaux (`dy`). Le défilement **fait une boucle**, ce qui signifie que les pixels déplacés au-delà des limites du tableau réapparaissent de l'autre côté.

source: **alpha_array** (numpy.ndarray): - A **2D NumPy array** containing **alpha channel pixel values**. - The array must reference **all alpha pixel values** for in-place transformation. - Expected shape: **(height, width)** (grayscale alpha format).
fr: **alpha_array** (numpy.ndarray) : - Un **tableau NumPy 2D** contenant des **valeurs de pixels du canal alpha**. - Le tableau doit référencer **toutes les valeurs alpha des pixels** pour la transformation sur place. - Forme attendue : **(hauteur, largeur)** (format alpha en niveaux de gris).

source: **Returns**: - **None** (modifies `alpha_array` **in place**).
fr: **Retourne** : - **None** (modifie `alpha_array` **sur place**).

source: **Alpha channel values** typically represent pixel transparency, where: - `0` = **Fully Transparent** - `255` = **Fully Opaque**
fr: Les **valeurs du canal alpha** représentent généralement la transparence des pixels, où : - `0` = **Complètement transparent** - `255` = **Complètement opaque**

source: This shifts the alpha channel **3 pixels to the right** and **1 pixel upward**.
fr: Cela déplace le canal alpha de **3 pixels vers la droite** et de **1 pixel vers le haut**.

source: **Summary**: Scrolls a **32-bit Pygame surface** **horizontally and/or vertically** **in place**.
fr: **Résumé** : Fait défiler une **surface Pygame 32 bits** **horizontalement et/ou verticalement** **sur place**.

source: This function **modifies** the given `surface` **directly** by shifting pixel data based on the specified horizontal (`dx`) and vertical (`dy`) offsets. Scrolling **wraps around**, meaning pixels shifted beyond the surface boundaries reappear on the opposite side.
fr: Cette fonction **modifie** directement la `surface` donnée en déplaçant les données des pixels en fonction des décalages horizontaux (`dx`) et verticaux (`dy`). Le défilement **fait une boucle**, ce qui signifie que les pixels déplacés au-delà des limites de la surface réapparaissent de l'autre côté.
