Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Palette.po
Languages: es, fr

source: 1. Library Overview
es: 1. Resumen de la Biblioteca
fr: 1. Aperçu de la bibliothèque

source: The functions in this library are designed for **image manipulation** and **palette management**, making it suitable for applications such as **graphical rendering**, **image processing**, and **creating custom color palettes**. The library is ideal for use in **graphics software** or **visual applications** where images need to be rendered with specific color palettes or where images must be dynamically modified based on palette data.
es: Las funciones de esta biblioteca están diseñadas para la **manipulación de imágenes** y la **gestión de paletas**, lo que la hace adecuada para aplicaciones como **renderizado gráfico**, **procesamiento de imágenes** y **creación de paletas de colores personalizadas**. La biblioteca es ideal para su uso en **software gráfico** o **aplicaciones visuales** donde las imágenes necesitan ser renderizadas con paletas de colores específicas o donde las imágenes deben modificarse dinámicamente en función de los datos de la paleta.
fr: Les fonctions de cette bibliothèque sont conçues pour la **manipulation d'images** et la **gestion de palettes**, ce qui la rend adaptée à des applications telles que le **rendu graphique**, le **traitement d'images** et la **création de palettes de couleurs personnalisées**. La bibliothèque est idéale pour une utilisation dans des **logiciels graphiques** ou des **applications visuelles** où les images doivent être rendues avec des palettes de couleurs spécifiques ou où les images doivent être modifiées dynamiquement en fonction des données de la palette.

source: 2. Key Concepts
es: 2. Conceptos Clave
fr: 2. Concepts clés

source: **Image Surface**: Represents an object corresponding to an image, where individual pixels can be accessed and manipulated. This object provides an abstraction for working with pixel data in various image processing tasks.
es: **Superficie de Imagen**: Representa un objeto correspondiente a una imagen, donde se pueden acceder y manipular píxeles individuales. Este objeto proporciona una abstracción para trabajar con datos de píxeles en diversas tareas de procesamiento de imágenes.
fr: **Surface d'image** : Représente un objet correspondant à une image, où les pixels individuels peuvent être accessibles et manipulés. Cet objet fournit une abstraction pour travailler avec les données de pixels dans diverses tâches de traitement d'image.

source: **Palette**: A collection of colors that can be applied to an image. Palettes are commonly used in **visual design**, **digital art**, and **simulations** to ensure consistency in color usage throughout an image or graphic.
es: **Paleta**: Una colección de colores que se pueden aplicar a una imagen. Las paletas se utilizan comúnmente en **diseño visual**, **arte digital** y **simulaciones** para garantizar la consistencia en el uso del color en toda una imagen o gráfico.
fr: **Palette** : Une collection de couleurs qui peut être appliquée à une image. Les palettes sont couramment utilisées dans le **design visuel**, l'**art numérique** et les **simulations** pour garantir la cohérence de l'utilisation des couleurs dans toute l'image ou le graphique.

source: **Temporary Buffer**: A storage area used to hold intermediate results during computations. The temporary buffer helps reduce the need to perform expensive operations multiple times, improving performance when working with complex image manipulations.
es: **Búfer Temporal**: Un área de almacenamiento utilizada para guardar resultados intermedios durante los cálculos. El búfer temporal ayuda a reducir la necesidad de realizar operaciones costosas varias veces, mejorando el rendimiento al trabajar con manipulaciones de imágenes complejas.
fr: **Tampon temporaire** : Une zone de stockage utilisée pour conserver les résultats intermédiaires pendant les calculs. Le tampon temporaire aide à réduire la nécessité de réaliser des opérations coûteuses plusieurs fois, améliorant ainsi les performances lors du travail avec des manipulations d'images complexes.

source: 3. Purpose of the Library
es: 3. Propósito de la Biblioteca
fr: 3. Objectif de la bibliothèque

source: The primary purpose of this library is to provide efficient tools for manipulating images at the **color level**. It allows users to modify or generate custom **color palettes**, providing greater flexibility in image rendering and processing tasks. By optimizing image handling, the library supports a variety of graphical applications, including dynamic image modifications based on color palettes.
es: El propósito principal de esta biblioteca es proporcionar herramientas eficientes para manipular imágenes a nivel de **color**. Permite a los usuarios modificar o generar **paletas de colores personalizadas**, ofreciendo una mayor flexibilidad en tareas de renderizado y procesamiento de imágenes. Al optimizar el manejo de imágenes, la biblioteca admite una variedad de aplicaciones gráficas, incluyendo modificaciones dinámicas de imágenes basadas en paletas de colores.
fr: L'objectif principal de cette bibliothèque est de fournir des outils efficaces pour manipuler les images au **niveau des couleurs**. Elle permet aux utilisateurs de modifier ou générer des **palettes de couleurs personnalisées**, offrant ainsi une plus grande flexibilité dans les tâches de rendu et de traitement d'images. En optimisant la gestion des images, la bibliothèque prend en charge une variété d'applications graphiques, y compris les modifications dynamiques d'images basées sur des palettes de couleurs.

source: 4. Use Cases
es: 4. Casos de Uso
fr: 4. Cas d'utilisation

source: **Graphics Software**: The library can be used in applications that need to render images with specific palettes, such as image editors, animation tools, or graphic design applications.
es: **Software Gráfico**: La biblioteca puede usarse en aplicaciones que necesitan renderizar imágenes con paletas específicas, como editores de imágenes, herramientas de animación o aplicaciones de diseño gráfico.
fr: **Logiciels graphiques** : La bibliothèque peut être utilisée dans des applications qui ont besoin de rendre des images avec des palettes spécifiques, telles que des éditeurs d'images, des outils d'animation ou des applications de design graphique.

source: **Image Processing**: Modify or analyze images by dynamically adjusting their color palettes, which can be useful in tasks such as color correction or filtering.
es: **Procesamiento de Imágenes**: Modificar o analizar imágenes ajustando dinámicamente sus paletas de colores, lo que puede ser útil en tareas como corrección de color o filtrado.
fr: **Traitement d'images** : Modifier ou analyser des images en ajustant dynamiquement leurs palettes de couleurs, ce qui peut être utile pour des tâches telles que la correction des couleurs ou le filtrage.

source: **Digital Art**: Artists can use the library to create and manipulate custom palettes, allowing for unique, controlled color schemes in their digital artwork.
es: **Arte Digital**: Los artistas pueden usar la biblioteca para crear y manipular paletas personalizadas, permitiendo esquemas de color únicos y controlados en sus obras de arte digital.
fr: **Art numérique** : Les artistes peuvent utiliser la bibliothèque pour créer et manipuler des palettes personnalisées, permettant des schémas de couleurs uniques et contrôlés dans leurs œuvres d'art numériques.

source: **Simulations**: In simulations, this library can be used to generate or modify color palettes for visual effects or data visualization purposes, ensuring that simulated environments maintain consistent and visually appealing color schemes.
es: **Simulaciones**: En simulaciones, esta biblioteca puede usarse para generar o modificar paletas de colores para efectos visuales o visualización de datos, asegurando que los entornos simulados mantengan esquemas de color consistentes y visualmente atractivos.
fr: **Simulations** : Dans les simulations, cette bibliothèque peut être utilisée pour générer ou modifier des palettes de couleurs pour des effets visuels ou des fins de visualisation de données, assurant que les environnements simulés conservent des schémas de couleurs cohérents et visuellement attrayants.

source: 5. Conclusion
es: 5. Conclusión

source: This library offers powerful tools for managing and manipulating images at the color level, making it invaluable for anyone working with custom color palettes in graphical and image processing applications.
es: Esta biblioteca ofrece herramientas poderosas para gestionar y manipular imágenes a nivel de color, lo que la hace invaluable para cualquier persona que trabaje con paletas de colores personalizadas en aplicaciones gráficas y de procesamiento de imágenes.
fr: Cette bibliothèque offre des outils puissants pour gérer et manipuler les images au niveau des couleurs, ce qui la rend indispensable pour toute personne travaillant avec des palettes de couleurs personnalisées dans des applications graphiques et de traitement d'images.

source: 6. Cython list methods
es: 6. Métodos de listas en Cython
fr: 6. Méthodes de liste Cython

source: **Summary:** Applies a color palette transformation to an image in-place. The function modifies the colors of the input image (a Pygame surface) using the specified color palette. The transformation is performed directly on the surface without creating a new image, optimizing memory usage.
es: **Resumen:** Aplica una transformación de paleta de colores a una imagen in situ. La función modifica los colores de la imagen de entrada (una superficie de Pygame) utilizando la paleta de colores especificada. La transformación se realiza directamente en la superficie sin crear una nueva imagen, optimizando el uso de memoria.
fr: **Résumé** : Applique une transformation de palette de couleurs à une image sur place.La fonction modifie les couleurs de l'image d'entrée (une surface Pygame) en utilisant la palette de couleurs spécifiée. La transformation est effectuée directement sur la surface sans créer une nouvelle image, optimisant l'utilisation de la mémoire.

source: **Example Usage:**
es: **Ejemplo de Uso:**

source: **Parameters:**
es: **Parámetros:**

source: **image_surface** (pygame.Surface): The Pygame surface representing the image to be modified. This is the input image on which the color palette will be applied.
es: **image_surface** (pygame.Surface): La superficie de Pygame que representa la imagen a modificar. Esta es la imagen de entrada en la que se aplicará la paleta de colores.

source: **color_palette** (numpy.ndarray): A NumPy array containing the color palette to apply. The array should have a shape of (w, 3), where `w` is the number of colors, and the dtype must be `float32` with values in the range [0.0, 255.0].
es: **color_palette** (numpy.ndarray): Un array de NumPy que contiene la paleta de colores a aplicar. El array debe tener una forma de (w, 3), donde `w` es el número de colores, y el dtype debe ser `float32` con valores en el rango [0.0, 255.0].

source: **Example:**
es: **Ejemplo:**

source: **temp_buffer** (numpy.ndarray): A temporary NumPy array used for optimization. It should be a contiguous array (C_CONTIGUOUS) and have the shape `(image_surface.get_width() * image_surface.get_height(), len(color_palette))`. This array helps to avoid memory reallocation during the function call, improving performance.
es: **temp_buffer** (numpy.ndarray): Un array temporal de NumPy utilizado para optimización. Debe ser un array contiguo (C_CONTIGUOUS) y tener la forma `(image_surface.get_width() * image_surface.get_height(), len(color_palette))`. Este array ayuda a evitar la reasignación de memoria durante la llamada a la función, mejorando el rendimiento.

source: Example of temporary buffer declaration:
es: Ejemplo de declaración de búfer temporal:

source: **Returns:**
es: **Devuelve:**

source: **None**: This function modifies the `image_surface` in-place without returning a new object.
es: **None**: Esta función modifica `image_surface` in situ sin devolver un nuevo objeto.

source: **Raises:**
es: **Lanza:**

source: **ValueError**: If the input surface is not compatible or if an invalid palette is provided.
es: **ValueError**: Si la superficie de entrada no es compatible o si se proporciona una paleta no válida.

source: **TypeError**: If any of the input arguments are of an incorrect type (e.g., the surface is not a `pygame.Surface`, the palette is not a `numpy.ndarray`, or the buffer is not a contiguous array).
es: **TypeError**: Si alguno de los argumentos de entrada es de un tipo incorrecto (por ejemplo, la superficie no es un `pygame.Surface`, la paleta no es un `numpy.ndarray` o el búfer no es un array contiguo).

source: **ValueError**: If there is a mismatch in the dimensions of the `image_surface` and the `temp_buffer`.
es: **ValueError**: Si hay una discrepancia en las dimensiones de `image_surface` y `temp_buffer`.

source: **Notes:**
es: **Notas:**

source: This function relies on the efficient handling of large arrays for color transformation. Make sure to pre-allocate the `temp_buffer` before calling the function to avoid unnecessary memory allocation during each frame.
es: Esta función depende del manejo eficiente de arrays grandes para la transformación de colores. Asegúrate de preasignar `temp_buffer` antes de llamar a la función para evitar asignaciones de memoria innecesarias durante cada fotograma.

source: **Summary:** Generates a palette of RGB colors by mapping HSL values. The function scales hue, clips saturation, and adjusts lightness based on the given parameters, returning a NumPy array of RGB values.
es: **Resumen:** Genera una paleta de colores RGB mapeando valores HSL. La función escala el tono, recorta la saturación y ajusta la luminosidad en función de los parámetros dados, devolviendo un array de NumPy de valores RGB.

source: **width** (*int*): The number of colors (palette size) to generate.
es: **width** (*int*): El número de colores (tamaño de la paleta) a generar.

source: **fh** (*float*): A factor by which to scale the hue value for each color.
es: **fh** (*float*): Un factor por el cual escalar el valor de tono para cada color.

source: **fs** (*float*): The saturation value, which must be in the range (0.0 ... 255.0). This limits the saturation intensity.
es: **fs** (*float*): El valor de saturación, que debe estar en el rango (0.0 ... 255.0). Esto limita la intensidad de la saturación.

source: **fl** (*float*): A factor by which to scale the lightness value for each color.
es: **fl** (*float*): Un factor por el cual escalar el valor de luminosidad para cada color.

source: (*numpy.ndarray*): A 1D NumPy array of RGB color values corresponding to the generated palette.
es: (*numpy.ndarray*): Un array 1D de NumPy de valores de color RGB correspondientes a la paleta generada.

source: The function relies on converting from HSL to RGB, applying the specified factors and clipping values. The output is a NumPy array, which can be directly used for visualization or further processing.
es: La función se basa en la conversión de HSL a RGB, aplicando los factores y valores de recorte especificados. La salida es un array de NumPy, que puede usarse directamente para visualización o procesamiento adicional.

source: **Summary:** Converts a 1D array of RGB palette colors into a Pygame Surface (line). The function processes a 1D array of 32-bit unsigned integers (representing colors in ARGB format) and converts it into a Pygame `Surface` object. The result is a surface that can be used for rendering or visualization.
es: **Resumen:** Convierte un array 1D de colores de paleta RGB en una superficie de Pygame (línea). La función procesa un array 1D de enteros sin signo de 32 bits (que representan colores en formato ARGB) y lo convierte en un objeto `Surface` de Pygame. El resultado es una superficie que puede usarse para renderizado o visualización.

source: **palette_c** (numpy.ndarray or memoryview): A 1D array (or memoryview) containing the palette of colors. Each color should be represented as a 32-bit unsigned integer (in ARGB format). The array must have a `numpy.uint32` dtype and be contiguous in memory.
es: **palette_c** (numpy.ndarray o memoryview): Un array 1D (o memoryview) que contiene la paleta de colores. Cada color debe representarse como un entero sin signo de 32 bits (en formato ARGB). El array debe tener un dtype `numpy.uint32` y ser contiguo en memoria.

source: Example:
es: Ejemplo:

source: **object**: A Pygame `Surface` object created from the palette.
es: **object**: Un objeto `Surface` de Pygame creado a partir de la paleta.

source: **TypeError**: If `palette_c` is not a `numpy.ndarray` or memoryview, or if it has an incorrect dtype.
es: **TypeError**: Si `palette_c` no es un `numpy.ndarray` o memoryview, o si tiene un dtype incorrecto.

source: **ValueError**: If `palette_c` is empty, not contiguous, or has an invalid size.
es: **ValueError**: Si `palette_c` está vacío, no es contiguo o tiene un tamaño no válido.

source: **RuntimeError**: If an error occurs during the creation of the Pygame surface.
es: **RuntimeError**: Si ocurre un error durante la creación de la superficie de Pygame.

source: The input palette should contain RGB values packed into 32-bit integers (ARGB format).
es: La paleta de entrada debe contener valores RGB empaquetados en enteros de 32 bits (formato ARGB).

source: The function processes the palette array in parallel for performance optimization.
es: La función procesa el array de la paleta en paralelo para optimizar el rendimiento.

source: The output is a Pygame `Surface` object, which can be directly used for visualization or rendering.
es: La salida es un objeto `Surface` de Pygame, que puede usarse directamente para visualización o renderizado.
