Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/PygameTools.po
Languages: es, fr

source: The operation is performed in parallel using OpenMP's `prange` for improved performance.
es: La operación se realiza en paralelo utilizando `prange` de OpenMP para mejorar el rendimiento.
fr: L'opération est effectuée en parallèle en utilisant `prange` d'OpenMP pour améliorer les performances.

source: Ensure that `mask_alpha_` is writable before calling this function.
es: Asegúrate de que `mask_alpha_` sea escribible antes de llamar a esta función.
fr: Assurez-vous que `masque_alpha_` est réécrivable avant d'appeler cette fonction.

source: Apply a mask to an image split into its respective RGB & alpha values.
es: Aplicar una máscara a una imagen dividida en sus respectivos valores RGB y alfa.
fr: Appliquez un masque à une image divisée en ses valeurs RGB et alpha respectives.

source: This method creates a new alpha channel by combining the original alpha transparency with the mask alpha. It generates a 32-bit image with a new alpha channel for fast blitting. The new surface is already formatted for optimal performance, so there is no need to use the `convert_alpha` method from Pygame.
es: Este método crea un nuevo canal alfa combinando la transparencia alfa original con la máscara alfa. Genera una imagen de 32 bits con un nuevo canal alfa para un blitting rápido. La nueva superficie ya está formateada para un rendimiento óptimo, por lo que no es necesario usar el método `convert_alpha` de Pygame.
fr: Cette méthode crée un nouveau canal alpha en combinant la transparence alpha originale avec le masque alpha. Elle génère une image 32 bits avec un nouveau canal alpha pour un blit rapide. La nouvelle surface est déjà formatée pour des performances optimales, il n'est donc pas nécessaire d'utiliser la méthode `convert_alpha` de Pygame.

source: A 3D array with shape (w, h, 3) and type `uint8`, representing the RGB values of the image.
es: Un arreglo 3D con forma (w, h, 3) y tipo `uint8`, que representa los valores RGB de la imagen.
fr: Un tableau 3D de forme (w, h, 3) et de type `uint8`, représentant les valeurs RGB de l'image.

source: A 2D array with shape (w, h) and type `uint8`, representing the alpha (transparency) values of the image.
es: Un arreglo 2D con forma (w, h) y tipo `uint8`, que representa los valores alfa (transparencia) de la imagen.
fr: Un tableau 2D de forme (w, h) et de type `uint8`, représentant les valeurs alpha (transparence) de l'image.

source: A 2D array with shape (w, h) and type `uint8`, representing the mask's alpha values to apply.
es: Un arreglo 2D con forma (w, h) y tipo `uint8`, que representa los valores alfa de la máscara a aplicar.
fr: Un tableau 2D de forme (w, h) et de type `uint8`, représentant les valeurs alpha du masque à appliquer.

source: object
es: objeto
fr: objet

source: A 32-bit Pygame surface with a new alpha channel combining the original transparency and the mask alpha.
es: Una superficie Pygame de 32 bits con un nuevo canal alfa que combina la transparencia original y la máscara alfa.
fr: Une surface Pygame 32 bits avec un nouveau canal alpha combinant la transparence originale et le masque alpha.

source: **Applying a mask to an image and creating a new alpha channel:** .. code-block::
es: **Aplicar una máscara a una imagen y crear un nuevo canal alfa:** .. code-block::
fr: **Application d'un masque à une image et création d'un nouveau canal alpha :** .. code-block::

source: The input arrays must have the same dimensions (w, h).
es: Los arreglos de entrada deben tener las mismas dimensiones (w, h).
fr: Les tableaux d'entrée doivent avoir les mêmes dimensions (w, h).

source: The function assumes that all arrays are of type `uint8`.
es: La función asume que todos los arreglos son de tipo `uint8`.
fr: La fonction suppose que tous les tableaux sont de type `uint8`.

source: The resulting surface is already compatible for fast blitting and does not require further processing.
es: La superficie resultante ya es compatible para un blitting rápido y no requiere procesamiento adicional.
fr: La surface résultante est déjà compatible pour un blit rapide et ne nécessite pas de traitement supplémentaire.

source: Combine separate red, green, blue, and alpha channels into a single 32-bit Pygame surface.
es: Combinar canales separados de rojo, verde, azul y alfa en una única superficie Pygame de 32 bits.
fr: Combinez les canaux rouge, vert, bleu et alpha séparés en une seule surface Pygame 32 bits.

source: This function takes four 2D arrays representing the red, green, blue, and alpha channels of an image, and combines them into a single 32-bit RGBA surface. The result is a surface that supports transparency and is ready for rendering in Pygame.
es: Esta función toma cuatro arreglos 2D que representan los canales rojo, verde, azul y alfa de una imagen, y los combina en una única superficie RGBA de 32 bits. El resultado es una superficie que admite transparencia y está lista para renderizarse en Pygame.
fr: Cette fonction prend quatre tableaux 2D représentant les canaux rouge, vert, bleu et alpha d'une image, et les combine en une seule surface 32 bits RGBA. Le résultat est une surface qui prend en charge la transparence et est prête pour le rendu dans Pygame.

source: To ensure optimal performance and proper alpha transparency handling, use `pygame.convert_alpha()` after creating the surface.
fr: Pour garantir des performances optimales et une gestion correcte de la transparence alpha, utilisez `pygame.convert_alpha()` après avoir créé la surface.

source: red_channel
fr: canal_rouge

source: A 2D array or memoryview with shape (w, h) and type `uint8`, representing the red channel values for each pixel. Values range from 0 to 255.
es: Un arreglo 2D o memoryview con forma (w, h) y tipo `uint8`, que representa los valores del canal rojo para cada píxel. Los valores van de 0 a 255.
fr: Un tableau 2D ou une vue mémoire avec la forme (w, h) et de type `uint8`, représentant les valeurs du canal rouge pour chaque pixel. Les valeurs varient de 0 à 255.

source: green_channel
fr: canal_vert

source: A 2D array or memoryview with shape (w, h) and type `uint8`, representing the green channel values for each pixel. Values range from 0 to 255.
es: Un arreglo 2D o memoryview con forma (w, h) y tipo `uint8`, que representa los valores del canal verde para cada píxel. Los valores van de 0 a 255.
fr: Un tableau 2D ou une vue mémoire avec la forme (w, h) et de type `uint8`, représentant les valeurs du canal vert pour chaque pixel. Les valeurs varient de 0 à 255.

source: blue_channel
fr: canal_bleu

source: A 2D array or memoryview with shape (w, h) and type `uint8`, representing the blue channel values for each pixel. Values range from 0 to 255.
es: Un arreglo 2D o memoryview con forma (w, h) y tipo `uint8`, que representa los valores del canal azul para cada píxel. Los valores van de 0 a 255.
fr: Un tableau 2D ou une vue mémoire avec la forme (w, h) et de type `uint8`, représentant les valeurs du canal bleu pour chaque pixel. Les valeurs varient de 0 à 255.

source: alpha_channel
fr: canal_alpha

source: A 2D array or memoryview with shape (w, h) and type `uint8`, representing the alpha (transparency) channel values for each pixel. Values range from 0 to 255.
es: Un arreglo 2D o memoryview con forma (w, h) y tipo `uint8`, que representa los valores del canal alfa (transparencia) para cada píxel. Los valores van de 0 a 255.
fr: Un tableau 2D ou une vue mémoire avec la forme (w, h) et de type `uint8`, représentant les valeurs du canal alpha (transparence) pour chaque pixel. Les valeurs varient de 0 à 255.

source: output_rgba_buffer
fr: tampon_rgba_sortie

source: numpy.ndarray, optional
es: numpy.ndarray, opcional
fr: numpy.ndarray, optionnel

source: A temporary 3D array or memoryview with shape (h, w, 4) and type `uint8` for storing intermediate RGBA data. If not provided, a new array will be allocated.
es: Un arreglo 3D temporal o memoryview con forma (h, w, 4) y tipo `uint8` para almacenar datos RGBA intermedios. Si no se proporciona, se asignará un nuevo arreglo.
fr: Un tableau 3D temporaire ou une vue mémoire avec la forme (h, w, 4) et de type `uint8` pour stocker les données intermédiaires RGBA. Si non fourni, un nouveau tableau sera alloué.

source: A 32-bit Pygame surface in RGBA format, suitable for rendering and supporting alpha transparency.
es: Una superficie Pygame de 32 bits en formato RGBA, adecuada para renderizado y compatible con transparencia alfa.
fr: Une surface Pygame 32 bits au format RGBA, adaptée pour le rendu et prenant en charge la transparence alpha.

source: If the input channel arrays or memoryviews do not have the same shape.
es: Si los arreglos o memoryviews de los canales de entrada no tienen la misma forma.
fr: Si les tableaux d'entrée ou les vues mémoire n'ont pas la même forme.

source: If `output_rgba_buffer` has an incorrect shape.
es: Si `output_rgba_buffer` tiene una forma incorrecta.
fr: Si `tampon_rgba_sortie` a une forme incorrecte.

source: If any of the input arrays or memoryviews is not a 2D NumPy array of type `uint8`.
es: Si alguno de los arreglos o memoryviews de entrada no es un arreglo NumPy 2D de tipo `uint8`.
fr: Si l'un des tableaux d'entrée ou des vues mémoire n'est pas un tableau 2D NumPy de type `uint8`.

source: **Creating a surface from RGBA channels:** .. code-block::
es: **Creando una superficie a partir de canales RGBA:** .. code-block::
fr: **Créer une surface à partir des canaux RGBA :** .. code-block::

source: This function works with both NumPy arrays and memoryviews, offering efficient data processing.
es: Esta función funciona tanto con arreglos NumPy como con memoryviews, ofreciendo un procesamiento de datos eficiente.
fr: Cette fonction fonctionne à la fois avec des tableaux NumPy et des vues mémoire, offrant un traitement efficace des données.

source: For proper transparency handling, use `pygame.Surface.convert_alpha()` on the returned surface.
es: Para un manejo adecuado de la transparencia, usa `pygame.Surface.convert_alpha()` en la superficie devuelta.
fr: Pour une gestion correcte de la transparence, utilisez `pygame.Surface.convert_alpha()` sur la surface retournée.

source: Compute the pixel-wise difference between two 24-bit Pygame surfaces.
es: Calcular la diferencia píxel por píxel entre dos superficies Pygame de 24 bits.
fr: Calculer la différence pixel par pixel entre deux surfaces Pygame 24 bits.

source: This function takes two Pygame surfaces in 24-bit format (PNG) and calculates the absolute difference between their RGB values. The output is a new 24-bit Pygame surface where each pixel represents the difference between the corresponding pixels in `surface1` and `surface2`.
es: Esta función toma dos superficies Pygame en formato de 24 bits (PNG) y calcula la diferencia absoluta entre sus valores RGB. La salida es una nueva superficie Pygame de 24 bits donde cada píxel representa la diferencia entre los píxeles correspondientes en `surface1` y `surface2`.
fr: Cette fonction prend deux surfaces Pygame au format 24 bits (PNG) et calcule la différence absolue entre leurs valeurs RGB. Le résultat est une nouvelle surface Pygame 24 bits où chaque pixel représente la différence entre les pixels correspondants de `surface1` et `surface2`.

source: A 24-bit Pygame surface representing the first image.
es: Una superficie Pygame de 24 bits que representa la primera imagen.
fr: Une surface Pygame 24 bits représentant la première image.

source: A 24-bit Pygame surface representing the second image.
es: Una superficie Pygame de 24 bits que representa la segunda imagen.
fr: Une surface Pygame 24 bits représentant la deuxième image.

source: A new 24-bit Pygame surface where pixel values indicate the absolute difference between `surface1` and `surface2`.
es: Una nueva superficie Pygame de 24 bits donde los valores de píxeles indican la diferencia absoluta entre `surface1` y `surface2`.
fr: Une nouvelle surface Pygame 24 bits où les valeurs des pixels indiquent la différence absolue entre `surface1` et `surface2`.

source: If the input surfaces do not have the same size or are not in 24-bit format.
es: Si las superficies de entrada no tienen el mismo tamaño o no están en formato de 24 bits.
fr: Si les surfaces d'entrée n'ont pas la même taille ou ne sont pas au format 24 bits.

source: **Incompatible with JPEG images**, as JPEG compression alters pixel values due to its lossy nature.
es: **Incompatible con imágenes JPEG**, ya que la compresión JPEG altera los valores de píxeles debido a su naturaleza con pérdidas.
fr: **Incompatible avec les images JPEG**, car la compression JPEG modifie les valeurs des pixels en raison de sa nature avec perte.

source: Both input surfaces **must** have identical dimensions and be in 24-bit mode.
es: Ambas superficies de entrada **deben** tener dimensiones idénticas y estar en modo de 24 bits.
fr: Les deux surfaces d'entrée **doivent** avoir des dimensions identiques et être en mode 24 bits.

source: The output surface does not include an alpha channel (transparency).
es: La superficie de salida no incluye un canal alfa (transparencia).
fr: La surface de sortie ne comprend pas de canal alpha (transparence).

source: For faster rendering, use `pygame.Surface.convert()` on the returned surface.
es: Para un renderizado más rápido, usa `pygame.Surface.convert()` en la superficie devuelta.
fr: Pour un rendu plus rapide, utilisez `pygame.Surface.convert()` sur la surface retournée.

source: Compute the pixel-wise difference between two 32-bit Pygame surfaces.
es: Calcular la diferencia píxel por píxel entre dos superficies Pygame de 32 bits.
fr: Calculer la différence pixel par pixel entre deux surfaces Pygame 32 bits.

source: This function compares two Pygame surfaces in 32-bit format (PNG with an alpha channel) and calculates the absolute difference between their RGBA values. The output is a new 32-bit Pygame surface where each pixel represents the difference between the corresponding pixels in `surface1` and `surface2`.
es: Esta función compara dos superficies Pygame en formato de 32 bits (PNG con un canal alfa) y calcula la diferencia absoluta entre sus valores RGBA. La salida es una nueva superficie Pygame de 32 bits donde cada píxel representa la diferencia entre los píxeles correspondientes en `surface1` y `surface2`.
fr: Cette fonction compare deux surfaces Pygame au format 32 bits (PNG avec un canal alpha) et calcule la différence absolue entre leurs valeurs RGBA. Le résultat est une nouvelle surface Pygame 32 bits où chaque pixel représente la différence entre les pixels correspondants de `surface1` et `surface2`.

source: A 32-bit Pygame surface (RGBA) representing the first image.
es: Una superficie Pygame de 32 bits (RGBA) que representa la primera imagen.
fr: Une surface Pygame 32 bits (RGBA) représentant la première image.

source: A 32-bit Pygame surface (RGBA) representing the second image.
es: Una superficie Pygame de 32 bits (RGBA) que representa la segunda imagen.
fr: Une surface Pygame 32 bits (RGBA) représentant la deuxième image.

source: A new 32-bit Pygame surface where pixel values indicate the absolute difference between `surface1` and `surface2`, including differences in transparency.
es: Una nueva superficie Pygame de 32 bits donde los valores de píxeles indican la diferencia absoluta entre `surface1` y `surface2`, incluyendo diferencias en la transparencia.
fr: Une nouvelle surface Pygame 32 bits où les valeurs des pixels indiquent la différence absolue entre `surface1` et `surface2`, y compris les différences de transparence.

source: If the input surfaces do not have the same size or are not in 32-bit format.
es: Si las superficies de entrada no tienen el mismo tamaño o no están en formato de 32 bits.
fr: Si les surfaces d'entrée n'ont pas la même taille ou ne sont pas au format 32 bits.

source: Both input surfaces **must** have identical dimensions and be in 32-bit mode.
es: Ambas superficies de entrada **deben** tener dimensiones idénticas y estar en modo de 32 bits.
fr: Les deux surfaces d'entrée **doivent** avoir des dimensions identiques et être en mode 32 bits.

source: The output surface includes an alpha channel, preserving transparency differences.
es: La superficie de salida incluye un canal alfa, preservando las diferencias de transparencia.
fr: La surface de sortie inclut un canal alpha, préservant les différences de transparence.

source: For faster rendering, use `pygame.Surface.convert_alpha()` on the returned surface.
es: Para un renderizado más rápido, usa `pygame.Surface.convert_alpha()` en la superficie devuelta.
fr: Pour un rendu plus rapide, utilisez `pygame.Surface.convert_alpha()` sur la surface retournée.

source: Convert a 2D indexed array (int32) into a 3D RGB array (uint8).
es: Convertir un arreglo indexado 2D (int32) en un arreglo RGB 3D (uint8).
fr: Convertir un tableau indexé 2D (int32) en un tableau RGB 3D (uint8).

source: This function transforms a 2D array where each element is a 32-bit integer representing an RGB pixel into a 3D NumPy array, where each pixel's red, green, and blue channels are stored separately as uint8 values.
es: Esta función transforma un arreglo 2D donde cada elemento es un entero de 32 bits que representa un píxel RGB en un arreglo NumPy 3D, donde los canales rojo, verde y azul de cada píxel se almacenan por separado como valores uint8.
fr: Cette fonction transforme un tableau 2D où chaque élément est un entier 32 bits représentant un pixel RGB en un tableau NumPy 3D, où les canaux rouge, vert et bleu de chaque pixel sont stockés séparément sous forme de valeurs uint8.

source: **Purpose**
es: **Propósito**
fr: **Objectif**

source: This is the inverse of `pygame.surfarray.map_array()`, which converts a 3D RGB array into a 2D int32 pixel map. It is useful for reconstructing RGB values from an indexed format.
es: Esta es la inversa de `pygame.surfarray.map_array()`, que convierte un arreglo RGB 3D en un mapa de píxeles int32 2D. Es útil para reconstruir valores RGB a partir de un formato indexado.
fr: C'est l'inverse de `pygame.surfarray.map_array()`, qui convertit un tableau RGB 3D en une carte de pixels int32 2D. Il est utile pour reconstruire les valeurs RGB à partir d'un format indexé.

source: A 2D array of shape (w, h) with int32 values, where each element represents an RGB pixel encoded as a single integer.
es: Un arreglo 2D de forma (w, h) con valores int32, donde cada elemento representa un píxel RGB codificado como un solo entero.
fr: Un tableau 2D de forme (w, h) avec des valeurs int32, où chaque élément représente un pixel RGB codé sous la forme d'un seul entier.

source: A preallocated 3D array of shape (w, h, 3) and type uint8 to store the decomposed RGB values. If provided, this array is modified in place.
es: Un arreglo 3D preasignado de forma (w, h, 3) y tipo uint8 para almacenar los valores RGB descompuestos. Si se proporciona, este arreglo se modifica in situ.
fr: Un tableau 3D préalloué de forme (w, h, 3) et de type uint8 pour stocker les valeurs RGB décomposées. Si fourni, ce tableau est modifié sur place.

source: Shape: (w, h, 3)
es: Forma: (w, h, 3)
fr: Forme : (w, h, 3)

source: Data type: uint8
es: Tipo de datos: uint8
fr: Type de données : uint8

source: A 3D NumPy array of shape (w, h, 3), where: - `[..., 0]` contains the red (R) channel values. - `[..., 1]` contains the green (G) channel values. - `[..., 2]` contains the blue (B) channel values.
es: Un arreglo NumPy 3D de forma (w, h, 3), donde: - `[..., 0]` contiene los valores del canal rojo (R). - `[..., 1]` contiene los valores del canal verde (G). - `[..., 2]` contiene los valores del canal azul (B).
fr: Un tableau NumPy 3D de forme (w, h, 3), où : - `[..., 0]` contient les valeurs du canal rouge (R). - `[..., 1]` contient les valeurs du canal vert (G). - `[..., 2]` contient les valeurs du canal bleu (B).

source: If `indexed_array_` is not of shape (w, h) or not of type int32. If `tmp_array_` is provided but has an incorrect shape or type.
es: Si `indexed_array_` no tiene la forma (w, h) o no es de tipo int32. Si `tmp_array_` se proporciona pero tiene una forma o tipo incorrectos.
fr: Si `indexed_array_` n'a pas la forme (w, h) ou n'est pas de type int32. Si `tmp_array_` est fourni mais a une forme ou un type incorrect.

source: If inputs are not valid NumPy arrays or memoryviews.
es: Si las entradas no son arreglos NumPy válidos o memoryviews.
fr: Si les entrées ne sont pas des tableaux NumPy valides ou des vues mémoire.

source: If `tmp_array_` is not provided, a new array is allocated.
es: Si no se proporciona `tmp_array_`, se asigna un nuevo arreglo.
fr: Si `tmp_array_` n'est pas fourni, un nouveau tableau est alloué.

source: Supplying a preallocated array is recommended for large datasets to improve performance.
es: Se recomienda proporcionar un arreglo preasignado para grandes conjuntos de datos para mejorar el rendimiento.
fr: Il est recommandé de fournir un tableau préalloué pour les grands ensembles de données afin d'améliorer les performances.

source: This function is optimized for speed and operates directly on memory views.
es: Esta función está optimizada para la velocidad y opera directamente en vistas de memoria.
fr: Cette fonction est optimisée pour la vitesse et fonctionne directement sur les vues mémoire.

source: Convert a 3D RGB array (W, H, 3) into a 2D mapped integer array.
es: Convertir un arreglo RGB 3D (W, H, 3) en un arreglo de enteros mapeado 2D.
fr: Convertir un tableau RGB 3D (W, H, 3) en un tableau entier 2D mappé.

source: This function transforms a 3D array of RGB values (uint8) into a 2D array where each RGB triplet is represented as a single int32 value. It is optimized as an equivalent to `pygame.surfarray.map_array(Surface, array3d)`, allowing efficient processing of NumPy arrays with shape (W, H, 3).
es: Esta función transforma un arreglo 3D de valores RGB (uint8) en un arreglo 2D donde cada triplete RGB se representa como un solo valor int32. Está optimizada como un equivalente a `pygame.surfarray.map_array(Surface, array3d)`, permitiendo un procesamiento eficiente de arreglos NumPy con forma (W, H, 3).
fr: Cette fonction transforme un tableau 3D de valeurs RGB (uint8) en un tableau 2D où chaque triplet RGB est représenté par une seule valeur int32. Elle est optimisée comme équivalent de `pygame.surfarray.map_array(Surface, array3d)`, permettant un traitement efficace des tableaux NumPy de forme (W, H, 3).

source: A 3D array or memoryview of shape (W, H, 3), containing pixel data in `uint8` format. Each pixel is represented by three values: red, green, and blue.
es: Un arreglo 3D o memoryview de forma (W, H, 3), que contiene datos de píxeles en formato `uint8`. Cada píxel está representado por tres valores: rojo, verde y azul.
fr: Un tableau 3D ou une vue mémoire de forme (W, H, 3), contenant des données de pixels au format `uint8`. Chaque pixel est représenté par trois valeurs : rouge, vert et bleu.

source: **tmp_array_** : memoryview or numpy.ndarray, optional
es: **tmp_array_** : memoryview o numpy.ndarray, opcional
fr: **tmp_array_** : memoryview ou numpy.ndarray, optionnel

source: A preallocated 2D array of shape (W, H) with data type `int32`. If provided, the function modifies this array in place, avoiding additional memory allocation.
es: Un arreglo 2D preasignado de forma (W, H) con tipo de datos `int32`. Si se proporciona, la función modifica este arreglo in situ, evitando la asignación adicional de memoria.
fr: Un tableau 2D préalloué de forme (W, H) avec le type de données `int32`. Si fourni, la fonction modifie ce tableau sur place, évitant ainsi une allocation de mémoire supplémentaire.
