Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/PygameTools.po
Languages: es, fr

source: Create a 32-bit image/surface from RGB and Alpha arrays.
es: Crea una imagen/superficie de 32 bits a partir de arreglos RGB y Alfa.
fr: Créer une image/surface 32 bits à partir des tableaux RGB et Alpha.

source: This function generates a 32-bit image surface (with alpha transparency) by combining:
es: Esta función genera una superficie de imagen de 32 bits (con transparencia alfa) combinando:
fr: Cette fonction génère une surface d'image 32 bits (avec transparence alpha) en combinant :

source: An RGB array with shape (w, h, 3) and dtype uint8.
es: Un arreglo RGB con forma (w, h, 3) y dtype uint8.
fr: Un tableau RGB de forme (w, h, 3) et de type uint8.

source: An Alpha array with shape (w, h) and dtype uint8.
es: Un arreglo Alfa con forma (w, h) y dtype uint8.
fr: Un tableau Alpha de forme (w, h) et de type uint8.

source: Both input arrays must have the same width and height (w, h), and must be of type uint8. Optionally, a pre-allocated temporary array can be passed to optimize performance.
es: Ambos arreglos de entrada deben tener el mismo ancho y alto (w, h), y deben ser de tipo uint8. Opcionalmente, se puede pasar un arreglo temporal preasignado para optimizar el rendimiento.
fr: Les deux tableaux d'entrée doivent avoir la même largeur et hauteur (w, h), et doivent être de type uint8. Optionnellement, un tableau temporaire pré-alloué peut être passé pour optimiser les performances.

source: A 3D array with shape (w, h, 3) containing RGB pixel values (dtype=uint8).
es: Un arreglo 3D con forma (w, h, 3) que contiene valores de píxeles RGB (dtype=uint8).
fr: Un tableau 3D de forme (w, h, 3) contenant des valeurs de pixels RGB (dtype=uint8).

source: A 2D array with shape (w, h) containing alpha (transparency) values (dtype=uint8).
es: Un arreglo 2D con forma (w, h) que contiene valores alfa (transparencia) (dtype=uint8).
fr: Un tableau 2D de forme (w, h) contenant des valeurs alpha (transparence) (dtype=uint8).

source: numpy.ndarray or memoryview, optional
es: numpy.ndarray o memoryview, opcional
fr: numpy.ndarray ou vue mémoire, optionnel

source: A 3D array with shape (w, h, 4) used as a temporary array for creating the RGBA surface. Passing this pre-allocated array can speed up the process by avoiding allocation overhead.
es: Un arreglo 3D con forma (w, h, 4) utilizado como arreglo temporal para crear la superficie RGBA. Pasar este arreglo preasignado puede acelerar el proceso al evitar el sobrecosto de asignación.
fr: Un tableau 3D de forme (w, h, 4) utilisé comme tableau temporaire pour créer la surface RGBA. Passer ce tableau pré-alloué peut accélérer le processus en évitant les coûts d'allocation.

source: A 32-bit pygame surface with RGBA values. Use `convert_alpha()` to enhance performance when rendering the surface. Note: `convert_alpha()` requires the video display to be initialized.
es: Una superficie pygame de 32 bits con valores RGBA. Usa `convert_alpha()` para mejorar el rendimiento al renderizar la superficie. Nota: `convert_alpha()` requiere que la pantalla de video esté inicializada.
fr: Une surface pygame 32 bits avec des valeurs RGBA. Utilisez `convert_alpha()` pour améliorer les performances lors du rendu de la surface. Remarque : `convert_alpha()` nécessite que l'affichage vidéo soit initialisé.

source: The input arrays must have compatible shapes and types.
es: Los arreglos de entrada deben tener formas y tipos compatibles.
fr: Les tableaux d'entrée doivent avoir des formes et types compatibles.

source: For optimal performance:
es: Para un rendimiento óptimo:
fr: Pour des performances optimales :

source: Use pygame's `convert_alpha()` method.
es: Usa el método `convert_alpha()` de pygame.
fr: Utilisez la méthode `convert_alpha()` de pygame.

source: Ensure the video display is initialized before calling `convert_alpha()`.
es: Asegúrate de que la pantalla de video esté inicializada antes de llamar a `convert_alpha()`.
fr: Assurez-vous que l'affichage vidéo est initialisé avant d'appeler `convert_alpha()`.

source: Convert a 2D alpha array (shape w x h, type uint8) into a 24-bit Pygame surface (RGB).
es: Convierte un arreglo alfa 2D (forma w x h, tipo uint8) en una superficie Pygame de 24 bits (RGB).
fr: Convertir un tableau alpha 2D (forme w x h, type uint8) en une surface Pygame 24 bits (RGB).

source: This function takes a 2D alpha array and creates a new 24-bit surface (RGB). Each pixel in the output surface has its R, G, and B channels set to the corresponding alpha value from the input array.
es: Esta función toma un arreglo alfa 2D y crea una nueva superficie de 24 bits (RGB). Cada píxel en la superficie de salida tiene sus canales R, G y B configurados con el valor alfa correspondiente del arreglo de entrada.
fr: Cette fonction prend un tableau alpha 2D et crée une nouvelle surface 24 bits (RGB). Chaque pixel de la surface de sortie a ses canaux R, G et B définis sur la valeur alpha correspondante du tableau d'entrée.

source: array
es: arreglo
fr: tableau

source: A 2D numpy array or memoryview with shape (w, h) and dtype uint8.
es: Un arreglo numpy 2D o memoryview con forma (w, h) y dtype uint8.
fr: Un tableau numpy 2D ou une vue mémoire de forme (w, h) et de type uint8.

source: A 24-bit Pygame surface (RGB). For better in-game performance, use `pygame.Surface.convert()` after creation.
es: Una superficie Pygame de 24 bits (RGB). Para un mejor rendimiento en el juego, usa `pygame.Surface.convert()` después de la creación.
fr: Une surface Pygame 24 bits (RGB). Pour de meilleures performances en jeu, utilisez `pygame.Surface.convert()` après la création.

source: Create a C-buffer from a 3D numpy array.
es: Crear un búfer C a partir de un arreglo numpy 3D.
fr: Créer un tampon C à partir d'un tableau numpy 3D.

source: This function takes a 3D numpy array representing an RGB or RGBA image and converts it into a 1D C-style buffer. The numpy array should have a shape of (width, height, 3|4) with uint8 type.
es: Esta función toma un arreglo numpy 3D que representa una imagen RGB o RGBA y lo convierte en un búfer estilo C 1D. El arreglo numpy debe tener una forma de (ancho, alto, 3|4) con tipo uint8.
fr: Cette fonction prend un tableau numpy 3D représentant une image RGB ou RGBA et le convertit en un tampon 1D de style C. Le tableau numpy doit avoir une forme (largeur, hauteur, 3|4) avec un type uint8.

source: A numpy array of shape (w, h, 3|4), representing an RGB or RGBA image. The last dimension (3 or 4) corresponds to the color channels (RGB or RGBA).
es: Un arreglo numpy de forma (w, h, 3|4), que representa una imagen RGB o RGBA. La última dimensión (3 o 4) corresponde a los canales de color (RGB o RGBA).
fr: Un tableau numpy de forme (w, h, 3|4), représentant une image RGB ou RGBA. La dernière dimension (3 ou 4) correspond aux canaux de couleur (RGB ou RGBA).

source: A memoryview slice (C buffer) containing the RGB or RGBA pixel values. This is a 1D array that can be accessed directly in C.
es: Un segmento de memoryview (búfer C) que contiene los valores de píxeles RGB o RGBA. Este es un arreglo 1D que se puede acceder directamente en C.
fr: Une vue mémoire (tampon C) contenant les valeurs de pixels RGB ou RGBA. C'est un tableau 1D accessible directement en C.

source: Convert a 1D array (buffer) of uint8 data type into a 3D numpy array (copy).
es: Convertir un arreglo 1D (búfer) de tipo de datos uint8 en un arreglo numpy 3D (copia).
fr: Convertir un tableau 1D (tampon) de type uint8 en un tableau numpy 3D (copie).

source: This function takes a 1D buffer of image data (such as RGB or RGBA values) and reconstructs it into a 3D array (numpy array) of shape (width, height, bit_size), where bit_size can be 3 (RGB) or 4 (RGBA).
es: Esta función toma un búfer 1D de datos de imagen (como valores RGB o RGBA) y lo reconstruye en un arreglo 3D (arreglo numpy) de forma (ancho, alto, bit_size), donde bit_size puede ser 3 (RGB) o 4 (RGBA).
fr: Cette fonction prend un tampon 1D de données d'image (comme des valeurs RGB ou RGBA) et le reconstruit en un tableau 3D (numpy) de forme (largeur, hauteur, bit_size), où bit_size peut être 3 (RGB) ou 4 (RGBA).

source: The input 1D buffer array (as a memoryview) containing pixel values in uint8 format.
es: El arreglo búfer 1D de entrada (como memoryview) que contiene valores de píxeles en formato uint8.
fr: Le tableau tampon 1D d'entrée (sous forme de vue mémoire) contenant les valeurs de pixels au format uint8.

source: width
es: ancho
fr: largeur

source: The width of the resulting 3D array (image width in pixels).
es: El ancho del arreglo 3D resultante (ancho de la imagen en píxeles).
fr: La largeur du tableau 3D résultant (largeur de l'image en pixels).

source: height
es: alto
fr: hauteur

source: The height of the resulting 3D array (image height in pixels).
es: La altura del arreglo 3D resultante (altura de la imagen en píxeles).
fr: La hauteur du tableau 3D résultant (hauteur de l'image en pixels).

source: bit_size
fr: taille_du_bit

source: The number of channels in the image. Typically 3 (RGB) or 4 (RGBA).
es: El número de canales en la imagen. Normalmente 3 (RGB) o 4 (RGBA).
fr: Le nombre de canaux dans l'image. Typiquement 3 (RGB) ou 4 (RGBA).

source: A memoryview slice (3D array) of shape (width, height, bit_size), containing the RGB or RGBA pixel values.
es: Un segmento de memoryview (arreglo 3D) de forma (ancho, alto, bit_size), que contiene los valores de píxeles RGB o RGBA.
fr: Une tranche de mémoire (tableau 3D) de forme (largeur, hauteur, taille_du_bit), contenant les valeurs des pixels RGB ou RGBA.

source: If `bit_size == 0`, as it's an invalid value for image data.
es: Si `bit_size == 0`, ya que es un valor inválido para datos de imagen.
fr: Si `taille_du_bit == 0`, car c'est une valeur invalide pour les données d'image.

source: Transpose rows & columns of a BGR image buffer.
es: Transponer filas y columnas de un búfer de imagen BGR.
fr: Transposez les lignes et les colonnes d'un tampon d'image BGR.

source: This function transposes a BGR image by rearranging the pixel data from the input `buffer` into the `transposed_buffer`. It assumes the image is represented as a 1D array of BGR pixels in row-major order.
es: Esta función transpone una imagen BGR reorganizando los datos de píxeles del búfer de entrada en el `transposed_buffer`. Asume que la imagen está representada como un arreglo 1D de píxeles BGR en orden de filas principales.
fr: Cette fonction transpose une image BGR en réarrangeant les données des pixels du `tampon` d'entrée dans le `tampon_transposé`. Elle suppose que l'image est représentée sous forme de tableau 1D de pixels BGR dans l'ordre ligne-principal.

source: This is equivalent to performing a transpose operation on the pixel data: transposing rows and columns of BGR blocks.
es: Esto es equivalente a realizar una operación de transposición en los datos de píxeles: transponer filas y columnas de bloques BGR.
fr: Cela revient à effectuer une opération de transposition sur les données des pixels : transposer les lignes et les colonnes des blocs BGR.

source: **Example Input/Output:**
es: **Ejemplo de Entrada/Salida:**
fr: **Exemple d'entrée/sortie :**

source: BGR image's pixels represented as: .. code-block::
es: Píxeles de la imagen BGR representados como: .. code-block::
fr: Les pixels de l'image BGR représentés comme : .. code-block::

source: After transpose:
es: Después de la transposición:
fr: Après la transposition :

source: output image's pixels represented as: .. code-block::
es: Píxeles de la imagen de salida representados como: .. code-block::
fr: Les pixels de l'image de sortie représentés comme : .. code-block::

source: **Example Usage**
es: **Ejemplo de Uso**
fr: **Exemple d'utilisation**

source: The width of the video frame. Must be greater than 0.
es: El ancho del fotograma de video. Debe ser mayor que 0.
fr: La largeur de la trame vidéo. Doit être supérieure à 0.

source: The height of the video frame. Must be greater than 0.
es: La altura del fotograma de video. Debe ser mayor que 0.
fr: La hauteur de la trame vidéo. Doit être supérieure à 0.

source: buffer
es: búfer
fr: tampon

source: A 1D memoryview containing the pixel data (typically in BGR format).
es: Un memoryview 1D que contiene los datos de píxeles (normalmente en formato BGR).
fr: Une vue mémoire 1D contenant les données des pixels (généralement au format BGR).

source: transposed_buffer
fr: tampon_transposé

source: memoryview, optional
es: memoryview, opcional
fr: vue_mémoire, optionnelle

source: An optional 1D memoryview to store the transposed pixel data. If not provided, a new buffer will be created.
es: Un memoryview 1D opcional para almacenar los datos de píxeles transpuestos. Si no se proporciona, se creará un nuevo búfer.
fr: Une vue mémoire 1D optionnelle pour stocker les données des pixels transposées. Si elle n'est pas fournie, un nouveau tampon sera créé.

source: A NumPy array containing the transposed pixel data.
es: Un arreglo NumPy que contiene los datos de píxeles transpuestos.
fr: Un tableau NumPy contenant les données des pixels transposées.

source: If `width` or `height` is less than or equal to 0. If `buffer` is None or its size does not match `width * height * 3`. If `transposed_buffer` is provided but its size does not match `width * height * 3`.
es: Si `width` o `height` es menor o igual a 0. Si `buffer` es None o su tamaño no coincide con `width * height * 3`. Si `transposed_buffer` se proporciona pero su tamaño no coincide con `width * height * 3`.
fr: Si `largeur` ou `hauteur` est inférieur ou égal à 0. Si `tampon` est None ou si sa taille ne correspond pas à `largeur * hauteur * 3`. Si `tampon_transposé` est fourni mais que sa taille ne correspond pas à `largeur * hauteur * 3`.

source: If `buffer` or `transposed_buffer` is not a memoryview or NumPy array. If `buffer` is a NumPy array and not contiguous.
es: Si `buffer` o `transposed_buffer` no es un memoryview o un arreglo NumPy. Si `buffer` es un arreglo NumPy y no es contiguo.
fr: Si `tampon` ou `tampon_transposé` n'est pas une vue mémoire ou un tableau NumPy. Si `tampon` est un tableau NumPy et n'est pas contigu.

source: This function assumes the buffer data is in BGR format and performs transpose.
es: Esta función asume que los datos del búfer están en formato BGR y realiza la transposición.
fr: Cette fonction suppose que les données du tampon sont au format BGR et effectue la transposition.

source: The operation is done in-place if a `transposed_buffer` is provided.
es: La operación se realiza in situ si se proporciona un `transposed_buffer`.
fr: L'opération est effectuée en place si un `tampon_transposé` est fourni.

source: Perform flipping of a BGRA image buffer.
es: Realizar la inversión de un búfer de imagen BGRA.
fr: Effectuer un retournement d'un tampon d'image BGRA.

source: This core function flips a BGRA image by rearranging the pixel data from the input `buffer` into the `flipped_buffer`. It assumes the image is represented as a 1D array of BGRA pixels in row-major order.
es: Esta función principal invierte una imagen BGRA reorganizando los datos de píxeles del búfer de entrada en el `flipped_buffer`. Asume que la imagen está representada como un arreglo 1D de píxeles BGRA en orden de filas principales.
fr: Cette fonction principale retourne une image BGRA en réarrangeant les données des pixels du `tampon` d'entrée dans le `tampon_retourné`. Elle suppose que l'image est représentée sous forme de tableau 1D de pixels BGRA dans l'ordre ligne-principal.

source: This is equivalent to performing a transpose operation on the pixel data: flipping rows and columns of BGRA blocks.
es: Esto es equivalente a realizar una operación de transposición en los datos de píxeles: invertir filas y columnas de bloques BGRA.
fr: Cela revient à effectuer une opération de transposition sur les données des pixels : retourner les lignes et les colonnes des blocs BGRA.

source: Input buffer: .. code-block::
es: Búfer de entrada: .. code-block::
fr: Tampon d'entrée : .. code-block::

source: After flipping:
es: Después de la inversión:
fr: Après retournement :

source: output buffer: .. code-block::
es: Búfer de salida: .. code-block::
fr: Tampon de sortie : .. code-block::

source: The width of the image in pixels.
es: El ancho de la imagen en píxeles.
fr: La largeur de l'image en pixels.

source: The height of the image in pixels.
es: La altura de la imagen en píxeles.
fr: La hauteur de l'image en pixels.

source: The input 1D buffer containing BGRA pixel data. The buffer size must be `width * height * 4` to accommodate all pixels in the image.
es: El búfer 1D de entrada que contiene los datos de píxeles BGRA. El tamaño del búfer debe ser `width * height * 4` para acomodar todos los píxeles de la imagen.
fr: Le tampon d'entrée 1D contenant les données des pixels BGRA. La taille du tampon doit être `largeur * hauteur * 4` pour contenir tous les pixels de l'image.

source: flipped_buffer
fr: tampon_retourné

source: The output 1D buffer to store the flipped BGRA data. The size must also be `width * height * 4`.
es: El búfer 1D de salida para almacenar los datos BGRA invertidos. El tamaño también debe ser `width * height * 4`.
fr: Le tampon de sortie 1D pour stocker les données BGRA retournées. La taille doit également être `largeur * hauteur * 4`.

source: A 1D NumPy array containing the flipped BGRA pixel data, stored in row-major order.
es: Un arreglo NumPy 1D que contiene los datos de píxeles BGRA invertidos, almacenados en orden de filas principales.
fr: Un tableau NumPy 1D contenant les données des pixels BGRA retournées, stockées dans l'ordre ligne-principal.

source: If `width` or `height` is less than or equal to 0. If `buffer` is not 1D or its size does not match `width * height * 4`. If `flipped_buffer` is not 1D or its size does not match `width * height * 4`.
es: Si `width` o `height` es menor o igual a 0. Si `buffer` no es 1D o su tamaño no coincide con `width * height * 4`. Si `flipped_buffer` no es 1D o su tamaño no coincide con `width * height * 4`.
fr: Si `largeur` ou `hauteur` est inférieur ou égal à 0. Si `tampon` n'est pas 1D ou si sa taille ne correspond pas à `largeur * hauteur * 4`. Si `tampon_retourné` n'est pas 1D ou si sa taille ne correspond pas à `largeur * hauteur * 4`.

source: If `buffer` or `flipped_buffer` is not a memoryview or NumPy array.
es: Si `buffer` o `flipped_buffer` no es un memoryview o un arreglo NumPy.
fr: Si `tampon` ou `tampon_retourné` n'est pas une vue mémoire ou un tableau NumPy.

source: The flipping operation is performed in parallel using OpenMP's `prange` for better performance on multi-threaded systems.
es: La operación de inversión se realiza en paralelo utilizando `prange` de OpenMP para un mejor rendimiento en sistemas multi-hilo.
fr: L'opération de retournement est effectuée en parallèle en utilisant `prange` d'OpenMP pour de meilleures performances sur des systèmes multi-thread.

source: If `flipped_buffer` is not provided, a new writable buffer is allocated and returned.
es: Si no se proporciona `flipped_buffer`, se asigna un nuevo búfer escribible y se devuelve.
fr: Si `tampon_retourné` n'est pas fourni, un nouveau tampon réécrivable est alloué et retourné.

source: **ChatGPT Collaboration:**
es: **Colaboración con ChatGPT:**
fr: **Collaboration ChatGPT :**

source: This code was enhanced with the assistance of **ChatGPT**.
es: Este código fue mejorado con la asistencia de **ChatGPT**.
fr: Ce code a été amélioré avec l'aide de **ChatGPT**.

source: Convert a 2D memoryview or a numpy.array into a black-and-white mask alpha array.
es: Convertir un memoryview 2D o un numpy.array en un arreglo alfa de máscara en blanco y negro.
fr: Convertir une vue mémoire 2D ou un numpy.array en un tableau de masque alpha noir et blanc.

source: This function processes a 2D memoryview of type `uint8` (values ranging from 0 to 255) and converts it into a binary black-and-white mask. Pixels with a value of `0` are converted to `0` (black), while pixels with a value greater than `0` are converted to `255` (white). The function returns a memoryview, not a NumPy array.
es: Esta función procesa un memoryview 2D de tipo `uint8` (valores que van de 0 a 255) y lo convierte en una máscara binaria en blanco y negro. Los píxeles con un valor de `0` se convierten en `0` (negro), mientras que los píxeles con un valor mayor que `0` se convierten en `255` (blanco). La función devuelve un memoryview, no un arreglo NumPy.
fr: Cette fonction traite une vue mémoire 2D de type `uint8` (valeurs allant de 0 à 255) et la convertit en un masque binaire noir et blanc. Les pixels avec une valeur de `0` sont convertis en `0` (noir), tandis que les pixels avec une valeur supérieure à `0` sont convertis en `255` (blanc). La fonction retourne une vue mémoire, pas un tableau NumPy.

source: **mask_alpha_**
fr: **masque_alpha_**

source: A 2D memoryview of shape (W, H) and type `uint8`. Each element represents an alpha value ranging from 0 (fully transparent) to 255 (fully opaque).
es: Un memoryview 2D de forma (W, H) y tipo `uint8`. Cada elemento representa un valor alfa que va desde 0 (completamente transparente) hasta 255 (completamente opaco).
fr: Une vue mémoire 2D de forme (L, H) et de type `uint8`. Chaque élément représente une valeur alpha allant de 0 (complètement transparent) à 255 (complètement opaque).

source: A 2D memoryview of shape (W, H) and type `uint8`, where each element is either: - `0` (black): Corresponds to pixels with an original value of `0`. - `255` (white): Corresponds to pixels with an original value greater than `0`.
es: Un memoryview 2D de forma (W, H) y tipo `uint8`, donde cada elemento es: - `0` (negro): Corresponde a píxeles con un valor original de `0`. - `255` (blanco): Corresponde a píxeles con un valor original mayor que `0`.
fr: Une vue mémoire 2D de forme (L, H) et de type `uint8`, où chaque élément est soit : - `0` (noir) : Correspond à des pixels ayant une valeur originale de `0`. - `255` (blanc) : Correspond à des pixels ayant une valeur originale supérieure à `0`.

source: If the input `mask_alpha_` is not a `numpy.ndarray` or a memoryview slice.
es: Si la entrada `mask_alpha_` no es un `numpy.ndarray` o un segmento de memoryview.
fr: Si l'entrée `masque_alpha_` n'est pas un `numpy.ndarray` ou une tranche de vue mémoire.

source: If: - `mask_alpha_` is not of type `uint8`. - `mask_alpha_` does not have exactly 2 dimensions.
es: Si: - `mask_alpha_` no es de tipo `uint8`. - `mask_alpha_` no tiene exactamente 2 dimensiones.
fr: Si : - `masque_alpha_` n'est pas de type `uint8`. - `masque_alpha_` n'a pas exactement 2 dimensions.

source: **Example**
es: **Ejemplo**
fr: **Exemple**

source: **Loading and converting an image's alpha channel to a binary mask:** .. code-block::
es: **Cargar y convertir el canal alfa de una imagen en una máscara binaria:** .. code-block::
fr: **Chargement et conversion du canal alpha d'une image en un masque binaire :** .. code-block::

source: This function modifies the input memoryview `mask_alpha_` in place for performance reasons.
es: Esta función modifica el memoryview de entrada `mask_alpha_` in situ por razones de rendimiento.
fr: Cette fonction modifie la vue mémoire d'entrée `masque_alpha_` sur place pour des raisons de performance.

source: It operates on Cython memoryviews directly, which are more efficient than NumPy arrays for this type of low-level operation.
es: Opera directamente en memoryviews de Cython, que son más eficientes que los arreglos NumPy para este tipo de operación de bajo nivel.
fr: Elle fonctionne directement sur des vues mémoire Cython, qui sont plus efficaces que les tableaux NumPy pour ce type d'opération de bas niveau.
