Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/PygameTools.po
Languages: es, fr

source: A 2D array of shape (W, H) with data type `int32`, where each element represents the mapped integer value of the corresponding RGB triplet.
es: Un arreglo 2D de forma (W, H) con tipo de datos `int32`, donde cada elemento representa el valor entero mapeado del triplete RGB correspondiente.
fr: Un tableau 2D de forme (W, H) avec le type de données `int32`, où chaque élément représente la valeur entière mappée du triplet RGB correspondant.

source: If `rgb_array` is `None`.
es: Si `rgb_array` es `None`.
fr: Si `rgb_array` est `None`.

source: If `rgb_array` does not have the required shape `(W, H, 3)`.
es: Si `rgb_array` no tiene la forma requerida `(W, H, 3)`.
fr: Si `rgb_array` n'a pas la forme requise `(W, H, 3)`.

source: If `rgb_array` has an invalid data type (not `uint8`).
es: Si `rgb_array` tiene un tipo de datos inválido (no es `uint8`).
fr: Si `rgb_array` a un type de données invalide (pas `uint8`).

source: If `tmp_array_` has an incorrect shape, data type, or other inconsistencies.
es: Si `tmp_array_` tiene una forma incorrecta, tipo de datos u otras inconsistencias.
fr: Si `tmp_array_` a une forme, un type de données ou d'autres incohérences incorrects.

source: If `rgb_array` or `tmp_array_` is not a NumPy array or memoryview slice.
es: Si `rgb_array` o `tmp_array_` no es un arreglo NumPy o un segmento de memoryview.
fr: Si `rgb_array` ou `tmp_array_` n'est pas un tableau NumPy ou une tranche de vue mémoire.

source: This function is optimized for processing large images efficiently.
es: Esta función está optimizada para procesar imágenes grandes de manera eficiente.
fr: Cette fonction est optimisée pour traiter efficacement les grandes images.

source: The input `rgb_array` must be compatible with `pygame.surfarray.array3d` output (an array of unsigned 8-bit integers).
es: La entrada `rgb_array` debe ser compatible con la salida de `pygame.surfarray.array3d` (un arreglo de enteros sin signo de 8 bits).
fr: L'entrée `rgb_array` doit être compatible avec la sortie de `pygame.surfarray.array3d` (un tableau d'entiers non signés 8 bits).

source: If `tmp_array_` is provided, it must be writable.
es: Si se proporciona `tmp_array_`, debe ser escribible.
fr: Si `tmp_array_` est fourni, il doit être modifiable.

source: If `tmp_array_` is not provided, a new 2D array is allocated internally.
es: Si no se proporciona `tmp_array_`, se asigna internamente un nuevo arreglo 2D.
fr: Si `tmp_array_` n'est pas fourni, un nouveau tableau 2D est alloué en interne.

source: Blend two 2D mapped pixel arrays together with optional special effects.
es: Mezclar dos arreglos de píxeles mapeados 2D con efectos especiales opcionales.
fr: Fusionner deux tableaux de pixels 2D mappés avec des effets spéciaux optionnels.

source: This function blends `target_pixels` and `blend_pixels` using the specified `special_flags`. The operation is performed **in-place**, directly modifying `target_pixels`.
es: Esta función mezcla `target_pixels` y `blend_pixels` usando los `special_flags` especificados. La operación se realiza **in situ**, modificando directamente `target_pixels`.
fr: Cette fonction fusionne `target_pixels` et `blend_pixels` en utilisant les `special_flags` spécifiés. L'opération est effectuée **sur place**, modifiant directement `target_pixels`.

source: A **2D Cython memoryview** (or a NumPy array converted via `numpy.asarray()`), where each element represents a pixel with mapped RGB values. The blend will be applied directly to this array (modifying it in-place).
es: Un **memoryview Cython 2D** (o un arreglo NumPy convertido mediante `numpy.asarray()`), donde cada elemento representa un píxel con valores RGB mapeados. La mezcla se aplicará directamente a este arreglo (modificándolo in situ).
fr: Une **vue mémoire Cython 2D** (ou un tableau NumPy converti via `numpy.asarray()`), où chaque élément représente un pixel avec des valeurs RGB mappées. La fusion sera appliquée directement à ce tableau (le modifiant sur place).

source: A **2D Cython memoryview** (or a NumPy array converted via `numpy.asarray()`), containing the pixel data to blend into `target_pixels`. The shape must match `target_pixels`.
es: Un **memoryview Cython 2D** (o un arreglo NumPy convertido mediante `numpy.asarray()`), que contiene los datos de píxeles para mezclar en `target_pixels`. La forma debe coincidir con `target_pixels`.
fr: Une **vue mémoire Cython 2D** (ou un tableau NumPy converti via `numpy.asarray()`), contenant les données de pixels à fusionner dans `target_pixels`. La forme doit correspondre à `target_pixels`.

source: **special_flags** : unsigned char, optional (default=0)
es: **special_flags** : unsigned char, opcional (predeterminado=0)
fr: **special_flags** : unsigned char, optionnel (par défaut=0)

source: A blending mode flag that determines how `target_pixels` and `blend_pixels` are combined. The following **Pygame-style BLEND modes** are supported:
es: Una bandera de modo de mezcla que determina cómo se combinan `target_pixels` y `blend_pixels`. Se admiten los siguientes **modos BLEND al estilo Pygame**:
fr: Un indicateur de mode de fusion qui détermine comment `target_pixels` et `blend_pixels` sont combinés. Les modes de fusion de style **Pygame** suivants sont pris en charge :

source: **BLEND_RGB_ADD** (1) → Additive blending
es: **BLEND_RGB_ADD** (1) → Mezcla aditiva
fr: **BLEND_RGB_ADD** (1) → Fusion additive

source: **BLEND_RGB_SUB** (2) → Subtractive blending
es: **BLEND_RGB_SUB** (2) → Mezcla sustractiva
fr: **BLEND_RGB_SUB** (2) → Fusion soustractive

source: **BLEND_RGB_MULT** (3) → Multiplicative blending
es: **BLEND_RGB_MULT** (3) → Mezcla multiplicativa
fr: **BLEND_RGB_MULT** (3) → Fusion multiplicative

source: **BLEND_RGB_MIN** (4) → Minimum value blending
es: **BLEND_RGB_MIN** (4) → Mezcla de valor mínimo
fr: **BLEND_RGB_MIN** (4) → Fusion de valeur minimale

source: **BLEND_RGB_MAX** (5) → Maximum value blending
es: **BLEND_RGB_MAX** (5) → Mezcla de valor máximo
fr: **BLEND_RGB_MAX** (5) → Fusion de valeur maximale

source: If `special_flags = 0`, no blending is applied (default behavior).
es: Si `special_flags = 0`, no se aplica ninguna mezcla (comportamiento predeterminado).
fr: Si `special_flags = 0`, aucune fusion n'est appliquée (comportement par défaut).

source: void
fr: vide

source: The function modifies `target_pixels` **in-place**, so it does not return a new array.
es: La función modifica `target_pixels` **in situ**, por lo que no devuelve un nuevo arreglo.
fr: La fonction modifie `target_pixels` **sur place**, donc elle ne retourne pas un nouveau tableau.

source: If `target_pixels` and `blend_pixels` have different shapes.
es: Si `target_pixels` y `blend_pixels` tienen formas diferentes.
fr: Si `target_pixels` et `blend_pixels` ont des formes différentes.

source: If `special_flags` is not in the valid range `[0-5]`.
es: Si `special_flags` no está en el rango válido `[0-5]`.
fr: Si `special_flags` n'est pas dans la plage valide `[0-5]`.

source: If `target_pixels` or `blend_pixels` is not a **Cython memoryview** or **NumPy array**.
es: Si `target_pixels` o `blend_pixels` no es un **memoryview Cython** o un **arreglo NumPy**.
fr: Si `target_pixels` ou `blend_pixels` n'est pas une **vue mémoire Cython** ou un **tableau NumPy**.

source: This function is optimized for performance using **Cython (`cpdef inline`)**.
es: Esta función está optimizada para el rendimiento utilizando **Cython (`cpdef inline`)**.
fr: Cette fonction est optimisée pour les performances en utilisant **Cython (`cpdef inline`)**.

source: The blending operation modifies `target_pixels` **directly**, so pass a copy if you need to retain the original data.
es: La operación de mezcla modifica `target_pixels` **directamente**, así que pasa una copia si necesitas conservar los datos originales.
fr: L'opération de fusion modifie `target_pixels` **directement**, donc passez une copie si vous devez conserver les données d'origine.

source: Compatible with **Pygame's surface blending operations**.
es: Compatible con **operaciones de mezcla de superficies de Pygame**.
fr: Compatible avec **les opérations de fusion de surfaces de Pygame**.

source: Ensure both input arrays are of the same shape before calling this function.
es: Asegúrate de que ambos arreglos de entrada tengan la misma forma antes de llamar a esta función.
fr: Assurez-vous que les deux tableaux d'entrée ont la même forme avant d'appeler cette fonction.

source: To ensure optimal performance and proper alpha transparency handling, use `pygame.convert_alpha()` after creation.
es: Para garantizar un rendimiento óptimo y un manejo adecuado de la transparencia alfa, usa `pygame.convert_alpha()` después de la creación.
