Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/PygameTools.po
Languages: es, fr

source: 1. Purpose of This Library
es: 1. Propósito de esta Biblioteca
fr: 1. Objectif de cette bibliothèque

source: This library is designed for **high-performance image processing** with a focus on **efficiency and low-level memory management**. It leverages **Cython and NumPy** to provide fast image operations, including **resizing, format conversions, pixel manipulations, and color channel analysis**. By using memory views and Cython optimizations, the library ensures minimal overhead when processing images in **RGB and RGBA formats**.
es: Esta biblioteca está diseñada para el **procesamiento de imágenes de alto rendimiento** con un enfoque en la **eficiencia y la gestión de memoria de bajo nivel**. Aprovecha **Cython y NumPy** para proporcionar operaciones rápidas de imágenes, incluyendo **redimensionamiento, conversiones de formato, manipulaciones de píxeles y análisis de canales de color**. Al utilizar vistas de memoria y optimizaciones de Cython, la biblioteca asegura un sobrecosto mínimo al procesar imágenes en formatos **RGB y RGBA**.
fr: Cette bibliothèque est conçue pour le **traitement d'images haute performance**, en mettant l'accent sur **l'efficacité et la gestion de la mémoire au niveau bas**. Elle exploite **Cython et NumPy** pour fournir des opérations rapides sur les images, y compris **le redimensionnement, les conversions de format, les manipulations de pixels et l'analyse des canaux de couleur**. En utilisant des vues mémoire et des optimisations Cython, la bibliothèque garantit un minimum de surcharge lors du traitement des images au format **RGB et RGBA**.

source: 2. Key Features
es: 2. Características Clave
fr: 2. Fonctionnalités principales

source: **Efficient Image Manipulation**: Functions to resize, transform, and reformat images with minimal processing overhead.
es: **Manipulación Eficiente de Imágenes**: Funciones para redimensionar, transformar y reformatear imágenes con un sobrecosto de procesamiento mínimo.
fr: **Manipulation d'images efficace** : Fonctions pour redimensionner, transformer et reformater les images avec une surcharge minimale.

source: **Memory-Efficient Buffer Handling**: Converts images to and from compact buffer representations for efficient storage and processing.
es: **Manejo Eficiente de Búferes**: Convierte imágenes a y desde representaciones compactas de búferes para un almacenamiento y procesamiento eficientes.
fr: **Gestion efficace des tampons mémoire** : Convertit les images en et depuis des représentations de tampons compactes pour un stockage et un traitement efficaces.

source: **Pixel-Level Operations**: Supports pixel indexing, blending, and mapping/unmapping between color representations.
es: **Operaciones a Nivel de Píxel**: Soporta indexación de píxeles, mezcla y mapeo/desmapeo entre representaciones de color.
fr: **Opérations au niveau des pixels** : Supporte l'indexation des pixels, le mélange et le mappage/démappage entre les représentations de couleurs.

source: **Alpha Channel Handling**: Enables operations such as alpha removal, binary masking, and blending with transparency.
es: **Manejo del Canal Alfa**: Permite operaciones como la eliminación del canal alfa, creación de máscaras binarias y mezcla con transparencia.
fr: **Gestion du canal alpha** : Permet des opérations telles que la suppression de l'alpha, le masquage binaire et le mélange avec transparence.

source: **Performance Optimizations**: Uses Cython’s `nogil` operations for multi-threading and fast execution.
es: **Optimizaciones de Rendimiento**: Utiliza operaciones `nogil` de Cython para la ejecución en múltiples hilos y un rendimiento rápido.
fr: **Optimisations des performances** : Utilise les opérations `nogil` de Cython pour le multi-threading et une exécution rapide.

source: **Comparison and Analysis Tools**: Functions for comparing PNG images and analyzing color channels.
es: **Herramientas de Comparación y Análisis**: Funciones para comparar imágenes PNG y analizar canales de color.
fr: **Outils de comparaison et d'analyse** : Fonctions pour comparer les images PNG et analyser les canaux de couleur.

source: 3. Library Functional Overview
es: 3. Resumen Funcional de la Biblioteca
fr: 3. Aperçu des fonctionnalités de la bibliothèque

source: This library provides several core functionalities for working with images:
es: Esta biblioteca proporciona varias funcionalidades principales para trabajar con imágenes:
fr: Cette bibliothèque offre plusieurs fonctionnalités essentielles pour travailler avec des images :

source: **Image Resizing & Buffer Manipulation**
es: **Redimensionamiento de Imágenes y Manipulación de Búferes**
fr: **Redimensionnement d'images et manipulation des buffers**

source: ``resize_array()``: Resize an RGB image efficiently.
es: ``resize_array()``: Redimensiona una imagen RGB de manera eficiente.
fr: ``resize_array()`` : Redimensionne une image RGB efficacement.

source: ``bufferize()`` / ``unbufferize()``: Convert images to and from compact buffer formats.
es: ``bufferize()`` / ``unbufferize()``: Convierte imágenes a y desde formatos compactos de búferes.
fr: ``bufferize()`` / ``unbufferize()`` : Convertit des images vers et depuis des formats de buffer compact.

source: ``flip_bgra_buffer()`` / ``bgr_buffer_transpose()``: Perform buffer-based transformations.
es: ``flip_bgra_buffer()`` / ``bgr_buffer_transpose()``: Realiza transformaciones basadas en búferes.
fr: ``flip_bgra_buffer()`` / ``bgr_buffer_transpose()`` : Effectue des transformations basées sur des buffers.

source: **Pixel Mapping & Indexing**
es: **Mapeo e Indexación de Píxeles**
fr: **Cartographie et indexation des pixels**

source: ``mapping_array()`` / ``unmapping_array()``: Convert RGB images to indexed formats and vice versa.
es: ``mapping_array()`` / ``unmapping_array()``: Convierte imágenes RGB a formatos indexados y viceversa.
fr: ``mapping_array()`` / ``unmapping_array()`` : Convertit des images RGB en formats indexés et inversement.

source: ``index3d_to_1d()`` / ``index1d_to_3d()``: Handle pixel coordinate transformations.
es: ``index3d_to_1d()`` / ``index1d_to_3d()``: Maneja transformaciones de coordenadas de píxeles.
fr: ``index3d_to_1d()`` / ``index1d_to_3d()`` : Gère les transformations des coordonnées de pixels.

source: **Alpha Channel Processing**
es: **Procesamiento del Canal Alfa**
fr: **Traitement du canal alpha**

source: ``RemoveAlpha()``: Strip the alpha channel from an RGBA image.
es: ``RemoveAlpha()``: Elimina el canal alfa de una imagen RGBA.
fr: ``RemoveAlpha()`` : Supprime le canal alpha d'une image RGBA.

source: ``make_rgba_array()``: Combine an RGB image with an alpha mask.
es: ``make_rgba_array()``: Combina una imagen RGB con una máscara alfa.
fr: ``make_rgba_array()`` : Combine une image RGB avec un masque alpha.

source: ``binary_mask()``: Generate binary masks from alpha values.
es: ``binary_mask()``: Genera máscaras binarias a partir de valores alfa.
fr: ``binary_mask()`` : Génère des masques binaires à partir des valeurs alpha.

source: **Image Blending & Comparison**
es: **Mezcla y Comparación de Imágenes**
fr: **Fusion et comparaison d'images**

source: ``blend_pixel_mapped_arrays()``: Blend images using mapped pixel values.
es: ``blend_pixel_mapped_arrays()``: Mezcla imágenes utilizando valores de píxeles mapeados.
fr: ``blend_pixel_mapped_arrays()`` : Fusionne des images en utilisant des valeurs de pixels mappées.

source: ``compare_png24bit()`` / ``compare_png32bit()``: Compare images for similarity.
es: ``compare_png24bit()`` / ``compare_png32bit()``: Compara imágenes para detectar similitudes.
fr: ``compare_png24bit()`` / ``compare_png32bit()`` : Compare des images pour évaluer leur similarité.

source: **Image Analysis**
es: **Análisis de Imágenes**
fr: **Analyse d'images**

source: ``get_rgb_channel_means()``: Compute average color values per channel.
es: ``get_rgb_channel_means()``: Calcula los valores promedio de color por canal.
fr: ``get_rgb_channel_means()`` : Calcule les valeurs moyennes des couleurs par canal.

source: ``analyze_image_channels()``: Extract statistical insights from an image.
es: ``analyze_image_channels()``: Extrae información estadística de una imagen.
fr: ``analyze_image_channels()`` : Extrait des informations statistiques d'une image.

source: 4. Target Applications
es: 4. Aplicaciones Objetivo
fr: 4. Applications ciblées

source: **Game Development**: Handling and processing game textures efficiently.
es: **Desarrollo de Juegos**: Manejo y procesamiento eficiente de texturas de juegos.
fr: **Développement de jeux** : Gestion et traitement efficace des textures de jeu.

source: **Computer Vision**: Preprocessing images for machine learning models.
es: **Visión por Computadora**: Preprocesamiento de imágenes para modelos de aprendizaje automático.
fr: **Vision par ordinateur** : Prétraitement des images pour les modèles d'apprentissage automatique.

source: **Graphics Software**: Performing transformations, blending, and format conversions.
es: **Software Gráfico**: Realización de transformaciones, mezclas y conversiones de formato.
fr: **Logiciels graphiques** : Effectuer des transformations, des fusions et des conversions de format.

source: **Embedded Systems**: Optimized image handling in memory-constrained environments.
es: **Sistemas Embebidos**: Manejo optimizado de imágenes en entornos con limitaciones de memoria.
fr: **Systèmes embarqués** : Gestion optimisée des images dans des environnements à mémoire limitée.

source: **Scientific Image Analysis**: Extracting statistics and performing pixel-level computations.
es: **Análisis Científico de Imágenes**: Extracción de estadísticas y realización de cálculos a nivel de píxeles.
fr: **Analyse scientifique d'images** : Extraction de statistiques et calculs au niveau des pixels.

source: 5. Summary
es: 5. Resumen
fr: 5. Résumé

source: This **Cython-based image processing library** provides **high-performance image transformations, buffer manipulation, and alpha channel handling**. With optimized **resizing, mapping, blending, and analysis functions**, it is designed for applications needing **fast, memory-efficient image processing**. Its **low-level optimizations** make it particularly well-suited for **real-time graphics, computer vision, and game development**.
es: Esta **biblioteca de procesamiento de imágenes basada en Cython** proporciona **transformaciones de imágenes de alto rendimiento, manipulación de búferes y manejo del canal alfa**. Con funciones optimizadas de **redimensionamiento, mapeo, mezcla y análisis**, está diseñada para aplicaciones que necesitan un **procesamiento de imágenes rápido y eficiente en memoria**. Sus **optimizaciones de bajo nivel** la hacen especialmente adecuada para **gráficos en tiempo real, visión por computadora y desarrollo de juegos**.
fr: Cette **bibliothèque de traitement d'images basée sur Cython** offre des **transformations d'images haute performance, une manipulation efficace des buffers et une gestion du canal alpha**. Grâce à des fonctions optimisées de **redimensionnement, cartographie, fusion et analyse**, elle est conçue pour les applications nécessitant un **traitement rapide et économe en mémoire**. Ses **optimisations bas niveau** la rendent particulièrement adaptée aux **graphiques en temps réel, à la vision par ordinateur et au développement de jeux**.

source: 6. Cython list methods
es: 6. Métodos de listas en Cython
fr: 6. Liste des méthodes Cython

source: Convert an RGBA or BGRA array to RGB by removing the alpha channel.
es: Convierte un arreglo RGBA o BGRA a RGB eliminando el canal alfa.
fr: Convertit un tableau RGBA ou BGRA en RGB en supprimant le canal alpha.

source: This function is used to process images with an alpha transparency channel and convert them to a format with no alpha, reducing a 32-bit image to a 24-bit image.
es: Esta función se utiliza para procesar imágenes con un canal de transparencia alfa y convertirlas a un formato sin alfa, reduciendo una imagen de 32 bits a una de 24 bits.
fr: Cette fonction est utilisée pour traiter des images avec un canal alpha de transparence et les convertir en un format sans alpha, réduisant une image 32 bits en une image 24 bits.

source: The function accepts a 3D numpy array or memoryview containing RGBA/BGRA data, and outputs a new 3D array with the alpha channel removed (RGB).
es: La función acepta un arreglo numpy 3D o memoryview que contiene datos RGBA/BGRA, y devuelve un nuevo arreglo 3D con el canal alfa eliminado (RGB).
fr: La fonction accepte un tableau numpy 3D ou une vue mémoire contenant des données RGBA/BGRA, et renvoie un nouveau tableau 3D sans le canal alpha (RGB).

source: **Example:**
es: **Ejemplo:**
fr: **Exemple :**

source: **Parameters**
es: **Parámetros**
fr: **Paramètres**

source: numpy.ndarray or memoryview
es: numpy.ndarray o memoryview
fr: numpy.ndarray ou memoryview

source: A numpy array or memoryviewslice with shape (w, h, 4) and dtype uint8. The array represents an image in RGBA or BGRA format (with alpha transparency).
es: Un arreglo numpy o memoryviewslice con forma (w, h, 4) y dtype uint8. El arreglo representa una imagen en formato RGBA o BGRA (con transparencia alfa).
fr: Un tableau numpy ou un segment de mémoire avec une forme (w, h, 4) et un type de données uint8. Le tableau représente une image au format RGBA ou BGRA (avec transparence alpha).

source: **Returns**
es: **Devuelve**
fr: **Renvoie**

source: A new numpy array with shape (w, h, 3) and dtype uint8, containing the RGB values (with no alpha transparency).
es: Un nuevo arreglo numpy con forma (w, h, 3) y dtype uint8, que contiene los valores RGB (sin transparencia alfa).
fr: Un nouveau tableau numpy avec une forme (w, h, 3) et un type de données uint8, contenant les valeurs RGB (sans transparence alpha).

source: **Raises**
es: **Lanza**
fr: **Exceptions**

source: If the input array does not have the expected shape (w, h, 4).
es: Si el arreglo de entrada no tiene la forma esperada (w, h, 4).
fr: Si le tableau d'entrée n'a pas la forme attendue (w, h, 4).

source: If the input array is not of type uint8.
es: Si el arreglo de entrada no es de tipo uint8.
fr: Si le tableau d'entrée n'est pas de type uint8.

source: Rescale an array (returning a new array).
es: Redimensiona un arreglo (devolviendo un nuevo arreglo).
fr: Redimensionner un tableau (retourne un nouveau tableau).

source: This function rescales a 3D RGB or RGBA array (of type uint8) to a new width and height. The output will have the shape (w2, h2, 3|4), preserving the number of channels (3 for RGB or 4 for RGBA).
es: Esta función redimensiona un arreglo 3D RGB o RGBA (de tipo uint8) a un nuevo ancho y alto. La salida tendrá la forma (w2, h2, 3|4), preservando el número de canales (3 para RGB o 4 para RGBA).
fr: Cette fonction redimensionne un tableau 3D RGB ou RGBA (de type uint8) à une nouvelle largeur et hauteur. La sortie aura la forme (w2, h2, 3|4), en conservant le nombre de canaux (3 pour RGB ou 4 pour RGBA).

source: A numpy array or memoryviewslice of shape (w, h, 3|4). Contains pixels in RGB or RGBA format (uint8).
es: Un arreglo numpy o memoryviewslice de forma (w, h, 3|4). Contiene píxeles en formato RGB o RGBA (uint8).
fr: Un tableau numpy ou une vue mémoire de forme (w, h, 3|4). Contient des pixels au format RGB ou RGBA (uint8).

source: The width of the output array.
es: El ancho del arreglo de salida.
fr: La largeur du tableau de sortie.

source: The height of the output array.
es: La altura del arreglo de salida.
fr: La hauteur du tableau de sortie.

source: A new array with the shape (w2, h2, 3|4) and type uint8. The format of the pixel data (RGB or RGBA) is the same as the input.
es: Un nuevo arreglo con la forma (w2, h2, 3|4) y tipo uint8. El formato de los datos de píxeles (RGB o RGBA) es el mismo que el de entrada.
fr: Un nouveau tableau de forme (w2, h2, 3|4) et de type uint8. Le format des données de pixels (RGB ou RGBA) est le même que celui de l'entrée.

source: If the input array does not have a valid shape (w, h, 3|4) or the `bit_size` is not supported.
es: Si el arreglo de entrada no tiene una forma válida (w, h, 3|4) o el `bit_size` no es compatible.
fr: Si le tableau d'entrée n'a pas une forme valide (w, h, 3|4) ou si la taille de bits (`bit_size`) n'est pas prise en charge.

source: If the input is not a numpy array or memoryviewslice, or if the data type is not uint8.
es: Si la entrada no es un arreglo numpy o memoryviewslice, o si el tipo de datos no es uint8.
fr: Si l'entrée n'est pas un tableau numpy ou une vue mémoire, ou si le type de données n'est pas uint8.

source: Array rescale (return a new array)
es: Redimensionamiento de arreglo (devuelve un nuevo arreglo)
fr: Redimensionnement de tableau (retourne un nouveau tableau)

source: This function rescales an image array in RGB or RGBA format (uint8) to a specified width (`w2`) and height (`h2`). The resulting array maintains the pixel format of the input and has a shape of (w2, h2, 3|4).
es: Esta función redimensiona un arreglo de imagen en formato RGB o RGBA (uint8) a un ancho (`w2`) y alto (`h2`) especificados. El arreglo resultante mantiene el formato de píxeles de la entrada y tiene una forma de (w2, h2, 3|4).
fr: Cette fonction redimensionne un tableau d'image au format RGB ou RGBA (uint8) à une largeur (`w2`) et une hauteur (`h2`) spécifiées. Le tableau résultant conserve le format des pixels de l'entrée et a une forme de (w2, h2, 3|4).

source: A 3D array with a shape of (w, h, 3|4) representing the pixel data of the image. The array must be in RGB (3 channels) or RGBA (4 channels) format and have a dtype of uint8.
es: Un arreglo 3D con una forma de (w, h, 3|4) que representa los datos de píxeles de la imagen. El arreglo debe estar en formato RGB (3 canales) o RGBA (4 canales) y tener un dtype de uint8.
fr: Un tableau 3D de forme (w, h, 3|4) représentant les données de pixels de l'image. Le tableau doit être au format RGB (3 canaux) ou RGBA (4 canaux) et avoir un dtype uint8.

source: The width of the resized image. Must be a positive integer greater than 0.
es: El ancho de la imagen redimensionada. Debe ser un entero positivo mayor que 0.
fr: La largeur de l'image redimensionnée. Doit être un entier positif supérieur à 0.

source: The height of the resized image. Must be a positive integer greater than 0.
es: La altura de la imagen redimensionada. Debe ser un entero positivo mayor que 0.
fr: La hauteur de l'image redimensionnée. Doit être un entier positif supérieur à 0.

source: memoryview
fr: vue mémoire

source: A resized image array with shape (w2, h2, 3|4), dtype uint8, and the same pixel format (RGB or RGBA) as the input.
es: Un arreglo de imagen redimensionada con forma (w2, h2, 3|4), dtype uint8, y el mismo formato de píxeles (RGB o RGBA) que la entrada.
fr: Un tableau d'image redimensionné de forme (w2, h2, 3|4), de type uint8, et ayant le même format de pixels (RGB ou RGBA) que l'entrée.

source: If `w2` or `h2` is not greater than 0, or if the shape of `rgb_array` is not understood (must be (w, h, 3|4)).
es: Si `w2` o `h2` no es mayor que 0, o si la forma de `rgb_array` no es entendida (debe ser (w, h, 3|4)).
fr: Si `w2` ou `h2` n'est pas supérieur à 0, ou si la forme de `rgb_array` n'est pas reconnue (doit être (w, h, 3|4)).

source: If `rgb_array` is not a numpy.ndarray or memoryviewslice, or if its dtype is not uint8.
es: Si `rgb_array` no es un numpy.ndarray o memoryviewslice, o si su dtype no es uint8.
fr: Si `rgb_array` n'est pas un numpy.ndarray ou une vue mémoire, ou si son dtype n'est pas uint8.

source: Create RGBA array from RGB and Alpha arrays.
es: Crea un arreglo RGBA a partir de arreglos RGB y Alfa.
fr: Créer un tableau RGBA à partir des tableaux RGB et Alpha.

source: This function generates a new RGBA memoryview array by combining an RGB array (shape (w, h, 3)) and an Alpha array (shape (w, h)). The resulting RGBA array has a shape of (w, h, 4) or (h, w, 4) if `transpose_` is set to `True`. The function is useful for creating images with transparency, such as 32-bit PNG images.
es: Esta función genera un nuevo arreglo memoryview RGBA combinando un arreglo RGB (forma (w, h, 3)) y un arreglo Alfa (forma (w, h)). El arreglo RGBA resultante tiene una forma de (w, h, 4) o (h, w, 4) si `transpose_` está configurado como `True`. La función es útil para crear imágenes con transparencia, como imágenes PNG de 32 bits.
fr: Cette fonction génère une nouvelle vue mémoire RGBA en combinant un tableau RGB (forme (w, h, 3)) et un tableau Alpha (forme (w, h)). Le tableau RGBA résultant a une forme de (w, h, 4) ou (h, w, 4) si `transpose_` est défini sur `True`. Cette fonction est utile pour créer des images avec transparence, comme les images PNG 32 bits.

source: **Example Usage:**
es: **Ejemplo de Uso:**
fr: **Exemple d'utilisation :**

source: A 3D array with shape (w, h, 3) containing RGB pixel values (uint8). The dimensions must match the `alpha_` array.
es: Un arreglo 3D con forma (w, h, 3) que contiene valores de píxeles RGB (uint8). Las dimensiones deben coincidir con el arreglo `alpha_`.
fr: Un tableau 3D de forme (w, h, 3) contenant des valeurs de pixels RGB (uint8). Les dimensions doivent correspondre à celles du tableau `alpha_`.

source: A 2D array with shape (w, h) containing alpha (transparency) values (uint8). The dimensions must match the `rgb_` array.
es: Un arreglo 2D con forma (w, h) que contiene valores alfa (transparencia) (uint8). Las dimensiones deben coincidir con el arreglo `rgb_`.
fr: Un tableau 2D de forme (w, h) contenant les valeurs alpha (transparence) (uint8). Les dimensions doivent correspondre à celles du tableau `rgb_`.

source: bool
fr: booléen

source: A flag to indicate if the output array should be transposed. If `True`, the shape of the output will be (h, w, 4) instead of (w, h, 4).
es: Una bandera para indicar si el arreglo de salida debe ser transpuesto. Si es `True`, la forma de la salida será (h, w, 4) en lugar de (w, h, 4).
fr: Un indicateur pour spécifier si le tableau de sortie doit être transposé. Si `True`, la forme de la sortie sera (h, w, 4) au lieu de (w, h, 4).

source: A Cython memoryview with shape (w, h, 4) or (h, w, 4) containing RGBA pixel values (uint8). This array can be directly used for image processing or converted to a numpy.ndarray.
es: Un memoryview de Cython con forma (w, h, 4) o (h, w, 4) que contiene valores de píxeles RGBA (uint8). Este arreglo puede ser utilizado directamente para el procesamiento de imágenes o convertido a un numpy.ndarray.
fr: Une vue mémoire Cython de forme (w, h, 4) ou (h, w, 4) contenant des valeurs de pixels RGBA (uint8). Ce tableau peut être utilisé directement pour le traitement d'image ou converti en numpy.ndarray.

source: If `rgb_` or `alpha_` is not a numpy.ndarray or memoryviewslice, or if the data type is not uint8.
es: Si `rgb_` o `alpha_` no es un numpy.ndarray o memoryviewslice, o si el tipo de datos no es uint8.
fr: Si `rgb_` ou `alpha_` n'est pas un numpy.ndarray ou une vue mémoire, ou si le type de données n'est pas uint8.

source: If the dimensions of `rgb_` and `alpha_` do not match.
es: Si las dimensiones de `rgb_` y `alpha_` no coinciden.
fr: Si les dimensions de `rgb_` et `alpha_` ne correspondent pas.

source: **Notes**
es: **Notas**
fr: **Remarques**

source: Both input arrays (`rgb_` and `alpha_`) must be of uint8 data type.
es: Ambos arreglos de entrada (`rgb_` y `alpha_`) deben ser de tipo uint8.
fr: Les deux tableaux d'entrée (`rgb_` et `alpha_`) doivent être de type uint8.

source: The function is designed for high-performance processing using memoryviewslice.
es: La función está diseñada para un procesamiento de alto rendimiento utilizando memoryviewslice.
fr: La fonction est conçue pour un traitement haute performance en utilisant des vues mémoire.
