Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/RGBConvert.po
Languages: es, fr

source: **Summary**: Converts a 24-bit or 32-bit RGB image into the YIQ color model in-place. The YIQ model separates brightness (luma) from color information (chroma), where Y represents brightness (luma), and I and Q represent chrominance (orange-blue and purple-green contrasts). This function modifies the pixel data of the given `image_surface` directly without creating a new image.
es: **Resumen**: Convierte una imagen RGB de 24 o 32 bits al modelo de color YIQ in situ. El modelo YIQ separa el brillo (luma) de la información de color (croma), donde Y representa el brillo (luma), e I y Q representan la crominancia (contrastes naranja-azul y púrpura-verde). Esta función modifica directamente los datos de píxeles de la `image_surface` dada sin crear una nueva imagen.
fr: **Résumé** : Convertit une image RGB 24 bits ou 32 bits dans le modèle de couleur YIQ en place. Le modèle YIQ sépare la luminosité (luma) de l'information couleur (chroma), où Y représente la luminosité (luma), et I et Q représentent la chrominance (contrastes orange-bleu et violet-vert). Cette fonction modifie directement les données des pixels de `image_surface` sans créer une nouvelle image.

source: **image_surface** (pygame.Surface): The input image surface (24-bit or 32-bit), which contains the RGB pixel data to be converted to YIQ.
es: **image_surface** (pygame.Surface): La superficie de imagen de entrada (24 o 32 bits), que contiene los datos de píxeles RGB que se convertirán a YIQ.
fr: **image_surface** (pygame.Surface) : La surface de l'image d'entrée (24 bits ou 32 bits), contenant les données de pixels RGB à convertir en YIQ.

source: **include_y** (bint, default=True): A flag indicating whether to include the Y (luma) component in the conversion. If `True`, the Y component will be included; otherwise, it will be omitted.
es: **include_y** (bint, predeterminado=True): Una bandera que indica si se debe incluir el componente Y (luma) en la conversión. Si es `True`, se incluirá el componente Y; de lo contrario, se omitirá.
fr: **include_y** (bint, par défaut=True) : Un indicateur pour savoir si le composant Y (luma) doit être inclus dans la conversion. Si `True`, le composant Y sera inclus ; sinon, il sera omis.

source: **include_i** (bint, default=False): A flag indicating whether to include the I (orange-blue contrast) component in the conversion. If `True`, the I component will be included.
es: **include_i** (bint, predeterminado=False): Una bandera que indica si se debe incluir el componente I (contraste naranja-azul) en la conversión. Si es `True`, se incluirá el componente I.
fr: **include_i** (bint, par défaut=False) : Un indicateur pour savoir si le composant I (contraste orange-bleu) doit être inclus dans la conversion. Si `True`, le composant I sera inclus.

source: **include_q** (bint, default=False): A flag indicating whether to include the Q (purple-green contrast) component in the conversion. If `True`, the Q component will be included.
es: **include_q** (bint, predeterminado=False): Una bandera que indica si se debe incluir el componente Q (contraste púrpura-verde) en la conversión. Si es `True`, se incluirá el componente Q.
fr: **include_q** (bint, par défaut=False) : Un indicateur pour savoir si le composant Q (contraste violet-vert) doit être inclus dans la conversion. Si `True`, le composant Q sera inclus.

source: **None**: This function modifies the `image_surface` in-place and does not return any value.
es: **None**: Esta función modifica la `image_surface` in situ y no devuelve ningún valor.
fr: **None** : Cette fonction modifie `image_surface` en place et ne retourne aucune valeur.

source: **TypeError**: If `image_surface` is not a valid `pygame.Surface` object.
es: **TypeError**: Si `image_surface` no es un objeto `pygame.Surface` válido.
fr: **TypeError** : Si `image_surface` n'est pas un objet `pygame.Surface` valide.

source: **ValueError**: If the input image surface is not compatible with the conversion (e.g., if the surface does not support 24-bit or 32-bit color formats).
es: **ValueError**: Si la superficie de imagen de entrada no es compatible con la conversión (por ejemplo, si la superficie no admite formatos de color de 24 o 32 bits).
fr: **ValueError** : Si la surface de l'image d'entrée n'est pas compatible avec la conversion (par exemple, si la surface ne prend pas en charge les formats de couleur 24 bits ou 32 bits).

source: The function processes the pixel data in-place, meaning the original image surface is directly modified.
es: La función procesa los datos de píxeles in situ, lo que significa que la superficie de imagen original se modifica directamente.
fr: La fonction traite les données des pixels en place, ce qui signifie que la surface de l'image d'origine est directement modifiée.

source: You can choose to include any combination of the Y, I, and Q components based on the flags `include_y`, `include_i`, and `include_q`.
es: Puedes elegir incluir cualquier combinación de los componentes Y, I y Q en función de las banderas `include_y`, `include_i` y `include_q`.
fr: Vous pouvez choisir d'inclure n'importe quelle combinaison des composants Y, I et Q en fonction des indicateurs `include_y`, `include_i` et `include_q`.

source: The conversion will be done to all pixels in the surface, and the color channels will be replaced by their respective YIQ values.
es: La conversión se realizará en todos los píxeles de la superficie, y los canales de color serán reemplazados por sus respectivos valores YIQ.
fr: La conversion sera effectuée sur tous les pixels de la surface, et les canaux de couleur seront remplacés par leurs valeurs YIQ respectives.

source: **Function**:
es: **Función**:
fr: **Fonction** :

source: **Summary**: Converts RGB color components (uint8) to the HSL color model (float tuple). This function converts RGB values in the range [0, 255] to the equivalent HSL (Hue, Saturation, Lightness) model, rescaling the values as follows: - Hue (H) in the range [0, 360] degrees. - Saturation (S) in the range [0, 100]. - Lightness (L) in the range [0, 100].
es: **Resumen**: Convierte componentes de color RGB (uint8) al modelo de color HSL (tupla de float). Esta función convierte valores RGB en el rango [0, 255] al modelo HSL (Tono, Saturación, Luminosidad) equivalente, reescalando los valores de la siguiente manera: - Tono (H) en el rango [0, 360] grados. - Saturación (S) en el rango [0, 100]. - Luminosidad (L) en el rango [0, 100].
fr: **Résumé** : Convertit les composants de couleur RGB (uint8) en modèle de couleur HSL (tuple de flottants). Cette fonction convertit les valeurs RGB dans la plage [0, 255] vers le modèle équivalent HSL (Teinte, Saturation, Luminosité), en rééchelonnant les valeurs comme suit : - Teinte (H) dans la plage [0, 360] degrés. - Saturation (S) dans la plage [0, 100]. - Luminosité (L) dans la plage [0, 100].

source: The red component of the pixel, an integer (uint8) in the range [0, 255].
es: El componente rojo del píxel, un entero (uint8) en el rango [0, 255].
fr: Le composant rouge du pixel, un entier (uint8) dans la plage [0, 255].

source: The green component of the pixel, an integer (uint8) in the range [0, 255].
es: El componente verde del píxel, un entero (uint8) en el rango [0, 255].
fr: Le composant vert du pixel, un entier (uint8) dans la plage [0, 255].

source: The blue component of the pixel, an integer (uint8) in the range [0, 255].
es: El componente azul del píxel, un entero (uint8) en el rango [0, 255].
fr: Le composant bleu du pixel, un entier (uint8) dans la plage [0, 255].

source: **Returns**: A tuple of three float values representing the HSL components: - **h** (float): Hue, in the range [0, 360] degrees. - **s** (float): Saturation, in the range [0, 100]. - **l** (float): Lightness, in the range [0, 100].
es: **Devuelve**: Una tupla de tres valores float que representan los componentes HSL: - **h** (float): Tono, en el rango [0, 360] grados. - **s** (float): Saturación, en el rango [0, 100]. - **l** (float): Luminosidad, en el rango [0, 100].
fr: **Retourne** : Un tuple de trois valeurs flottantes représentant les composants HSL : - **h** (flottant) : Teinte, dans la plage [0, 360] degrés. - **s** (flottant) : Saturation, dans la plage [0, 100]. - **l** (flottant) : Luminosité, dans la plage [0, 100].

source: **Summary**: Converts HSL (Hue, Saturation, Lightness) values to RGB pixel components. The input HSL values should be normalized as follows: - Hue (h) should be in the range [0, 1] (i.e., h/360.0). - Saturation (s) and Lightness (l) should be in the range [0, 1] (i.e., s/100.0 and l/100.0).
es: **Resumen**: Convierte valores HSL (Tono, Saturación, Luminosidad) a componentes de píxel RGB. Los valores HSL de entrada deben estar normalizados de la siguiente manera: - Tono (h) debe estar en el rango [0, 1] (es decir, h/360.0). - Saturación (s) y Luminosidad (l) deben estar en el rango [0, 1] (es decir, s/100.0 y l/100.0).
fr: **Résumé** : Convertit les valeurs HSL (Teinte, Saturation, Luminosité) en composants RGB de pixels. Les valeurs HSL d'entrée doivent être normalisées comme suit : - La Teinte (h) doit être dans la plage [0, 1] (c'est-à-dire h/360.0). - La Saturation (s) et la Luminosité (l) doivent être dans la plage [0, 1] (c'est-à-dire s/100.0 et l/100.0).

source: The function converts the normalized HSL values to RGB, rounding the output to the nearest integer and ensuring that the resulting RGB values fall within the range [0, 255].
es: La función convierte los valores HSL normalizados a RGB, redondeando la salida al entero más cercano y asegurando que los valores RGB resultantes estén dentro del rango [0, 255].
fr: La fonction convertit les valeurs HSL normalisées en RGB, arrondissant les résultats à l'entier le plus proche et s'assurant que les valeurs RGB résultantes se trouvent dans la plage [0, 255].

source: **h** (float):
fr: **h** (flottant) :

source: Normalized hue value in the range [0.0, 1.0], where 0.0 corresponds to 0° and 1.0 corresponds to 360°.
es: Valor de tono normalizado en el rango [0.0, 1.0], donde 0.0 corresponde a 0° y 1.0 corresponde a 360°.
fr: Valeur normalisée de la teinte dans la plage [0.0, 1.0], où 0.0 correspond à 0° et 1.0 correspond à 360°.

source: **s** (float):
fr: **s** (flottant) :

source: Normalized saturation value in the range [0.0, 1.0], where 0.0 represents no saturation and 1.0 represents full saturation.
es: Valor de saturación normalizado en el rango [0.0, 1.0], donde 0.0 representa sin saturación y 1.0 representa saturación completa.
fr: Valeur normalisée de la saturation dans la plage [0.0, 1.0], où 0.0 représente aucune saturation et 1.0 représente une saturation totale.

source: **l** (float):
fr: **l** (flottant) :

source: Normalized lightness value in the range [0.0, 1.0], where 0.0 represents black, 1.0 represents white, and 0.5 represents the pure color.
es: Valor de luminosidad normalizado en el rango [0.0, 1.0], donde 0.0 representa negro, 1.0 representa blanco y 0.5 representa el color puro.
fr: Valeur normalisée de la luminosité dans la plage [0.0, 1.0], où 0.0 représente le noir, 1.0 représente le blanc, et 0.5 représente la couleur pure.

source: **Returns**: A tuple of three unsigned char values (r, g, b) representing the RGB pixel color equivalent to the input HSL values. The RGB values are rounded and fall within the range [0, 255].
es: **Devuelve**: Una tupla de tres valores unsigned char (r, g, b) que representan el color de píxel RGB equivalente a los valores HSL de entrada. Los valores RGB están redondeados y caen dentro del rango [0, 255].
fr: **Retourne** : Un tuple de trois valeurs de type unsigned char (r, g, b) représentant la couleur RGB équivalente aux valeurs HSL d'entrée. Les valeurs RGB sont arrondies et se trouvent dans la plage [0, 255].

source: **Raises**: - **ValueError**: If any of the input values (h, s, or l) are outside the valid normalized range [0.0, 1.0].
es: **Lanza**: - **ValueError**: Si alguno de los valores de entrada (h, s o l) está fuera del rango normalizado válido [0.0, 1.0].
fr: **Lève** : - **ValueError** : Si l'une des valeurs d'entrée (h, s, ou l) est en dehors de la plage normalisée valide [0.0, 1.0].

source: **Summary**: Converts RGB pixel color components to the equivalent HSV model. The input RGB values are expected to be in the range [0, 255]. The function converts the RGB values into the HSV (Hue, Saturation, Value) model, and the output HSV values are rescaled as follows: - Hue (H) is scaled to [0, 360] degrees. - Saturation (S) is scaled to [0, 100]. - Value (V) is scaled to [0, 100].
es: **Resumen**: Convierte componentes de color de píxel RGB al modelo HSV equivalente. Se espera que los valores RGB de entrada estén en el rango [0, 255]. La función convierte los valores RGB al modelo HSV (Tono, Saturación, Valor), y los valores HSV de salida se reescalan de la siguiente manera: - Tono (H) se escala a [0, 360] grados. - Saturación (S) se escala a [0, 100]. - Valor (V) se escala a [0, 100].
fr: **Résumé** : Convertit les composants de couleur RGB des pixels en modèle équivalent HSV. Les valeurs RGB d'entrée doivent être dans la plage [0, 255]. La fonction convertit les valeurs RGB en modèle HSV (Teinte, Saturation, Valeur), et les valeurs HSV de sortie sont rééchelonnées comme suit : - Teinte (H) dans la plage [0, 360] degrés. - Saturation (S) dans la plage [0, 100]. - Valeur (V) dans la plage [0, 100].

source: The red component of the pixel, in the range [0, 255].
es: El componente rojo del píxel, en el rango [0, 255].
fr: Le composant rouge du pixel, dans la plage [0, 255].

source: The green component of the pixel, in the range [0, 255].
es: El componente verde del píxel, en el rango [0, 255].
fr: Le composant vert du pixel, dans la plage [0, 255].

source: The blue component of the pixel, in the range [0, 255].
es: El componente azul del píxel, en el rango [0, 255].
fr: Le composant bleu du pixel, dans la plage [0, 255].

source: **Returns**: A tuple of float values representing the HSV equivalent of the given RGB components: - **h** (Hue): in the range [0, 360]. - **s** (Saturation): in the range [0, 100]. - **v** (Value): in the range [0, 100].
es: **Devuelve**: Una tupla de valores float que representan el equivalente HSV de los componentes RGB dados: - **h** (Tono): en el rango [0, 360]. - **s** (Saturación): en el rango [0, 100]. - **v** (Valor): en el rango [0, 100].
fr: **Retourne** : Un tuple de valeurs flottantes représentant l'équivalent HSV des composants RGB donnés : - **h** (Teinte) : dans la plage [0, 360]. - **s** (Saturation) : dans la plage [0, 100]. - **v** (Valeur) : dans la plage [0, 100].

source: **Raises**: - **ValueError**: If any of the input values (r, g, or b) are outside the valid range [0, 255].
es: **Lanza**: - **ValueError**: Si alguno de los valores de entrada (r, g o b) está fuera del rango válido [0, 255].
fr: **Lève** : - **ValueError** : Si l'une des valeurs d'entrée (r, g, ou b) est en dehors de la plage valide [0, 255].

source: **Summary**: Converts HSV (Hue, Saturation, Value) values to RGB pixel components (uint8). The input HSV values are expected to be normalized as follows: - Hue (h) should be in the range [0, 1] (i.e., h/360.0). - Saturation (s) and Value (v) should be in the range [0, 1] (i.e., s/100.0 and v/100.0).
es: **Resumen**: Convierte valores HSV (Tono, Saturación, Valor) a componentes de píxel RGB (uint8). Se espera que los valores HSV de entrada estén normalizados de la siguiente manera: - Tono (h) debe estar en el rango [0, 1] (es decir, h/360.0). - Saturación (s) y Valor (v) deben estar en el rango [0, 1] (es decir, s/100.0 y v/100.0).
fr: **Résumé** : Convertit les valeurs HSV (Teinte, Saturation, Valeur) en composants RGB des pixels (uint8). Les valeurs HSV d'entrée doivent être normalisées comme suit : - La Teinte (h) doit être dans la plage [0, 1] (c'est-à-dire h/360.0). - La Saturation (s) et la Valeur (v) doivent être dans la plage [0, 1] (c'est-à-dire s/100.0 et v/100.0).

source: The function converts the normalized HSV values to RGB, rounding the output RGB values to the nearest integer, and the resulting RGB values are in the range [0, 255], which is typical for pixel color values.
es: La función convierte los valores HSV normalizados a RGB, redondeando los valores RGB de salida al entero más cercano, y los valores RGB resultantes están en el rango [0, 255], que es típico para valores de color de píxel.
fr: La fonction convertit les valeurs HSV normalisées en RGB, arrondissant les résultats RGB à l'entier le plus proche, et les valeurs RGB résultantes sont dans la plage [0, 255], ce qui est typique pour les valeurs de couleur des pixels.

source: **v** (float):
fr: **v** (flottant) :

source: Normalized value (brightness) in the range [0.0, 1.0], where 0.0 represents black and 1.0 represents full brightness.
es: Valor normalizado (brillo) en el rango [0.0, 1.0], donde 0.0 representa negro y 1.0 representa brillo completo.
fr: Valeur normalisée (luminosité) dans la plage [0.0, 1.0], où 0.0 représente le noir et 1.0 représente la luminosité maximale.

source: **Returns**: A tuple of three unsigned char values (r, g, b) representing the equivalent RGB pixel color. The RGB values are rounded to the nearest integer and fall within the range [0, 255].
es: **Devuelve**: Una tupla de tres valores unsigned char (r, g, b) que representan el color de píxel RGB equivalente. Los valores RGB están redondeados al entero más cercano y caen dentro del rango [0, 255].
fr: **Retourne** : Un tuple de trois valeurs de type unsigned char (r, g, b) représentant la couleur RGB équivalente. Les valeurs RGB sont arrondies à l'entier le plus proche et se trouvent dans la plage [0, 255].

source: **Raises**: - **ValueError**: If any of the input values (h, s, or v) are outside the valid normalized range [0.0, 1.0].
es: **Lanza**: - **ValueError**: Si alguno de los valores de entrada (h, s o v) está fuera del rango normalizado válido [0.0, 1.0].
fr: **Lève** : - **ValueError** : Si l'une des valeurs d'entrée (h, s, ou v) est en dehors de la plage normalisée valide [0.0, 1.0].

source: 6. Conclusion
es: 6. Conclusión
