Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/RGBConvert.po
Languages: es, fr

source: 1. Color Space Conversion Library
es: 1. Biblioteca de Conversión de Espacios de Color
fr: 1. Bibliothèque de conversion de l'espace colorimétrique

source: This Python library provides efficient color space conversion functions, primarily implemented using Cython for optimized performance. The library enables conversions between RGB and other color models like **YIQ**, **HSL**, and **HSV**, which are essential for various image processing and computer vision tasks.
es: Esta biblioteca de Python proporciona funciones eficientes de conversión de espacios de color, implementadas principalmente con Cython para un rendimiento optimizado. La biblioteca permite conversiones entre RGB y otros modelos de color como **YIQ**, **HSL** y **HSV**, que son esenciales para diversas tareas de procesamiento de imágenes y visión por computadora.
fr: Cette bibliothèque Python fournit des fonctions efficaces de conversion d'espace colorimétrique, principalement implémentées avec Cython pour des performances optimisées. La bibliothèque permet des conversions entre RGB et d'autres modèles de couleurs tels que **YIQ**, **HSL** et **HSV**, qui sont essentiels pour diverses tâches de traitement d'images et de vision par ordinateur.

source: 2. Purpose of the Library
es: 2. Propósito de la Biblioteca
fr: 2. Objectif de la bibliothèque

source: The primary goal of this library is to offer fast and efficient color space conversions. These conversions are commonly used in applications such as image processing, computer vision, color correction, and visual effects. The library leverages Cython to speed up computations and minimize memory overhead.
es: El objetivo principal de esta biblioteca es ofrecer conversiones de espacios de color rápidas y eficientes. Estas conversiones se utilizan comúnmente en aplicaciones como procesamiento de imágenes, visión por computadora, corrección de color y efectos visuales. La biblioteca aprovecha Cython para acelerar los cálculos y minimizar el uso de memoria.
fr: L'objectif principal de cette bibliothèque est de proposer des conversions d'espace colorimétrique rapides et efficaces. Ces conversions sont couramment utilisées dans des applications telles que le traitement d'images, la vision par ordinateur, la correction des couleurs et les effets visuels. La bibliothèque utilise Cython pour accélérer les calculs et minimiser les coûts en mémoire.

source: 3. Key Functions and Their Roles
es: 3. Funciones Clave y sus Roles
fr: 3. Fonctions principales et leurs rôles

source: **YIQ ↔ RGB Conversions**
es: **Conversiones YIQ ↔ RGB**
fr: **Conversions YIQ ↔ RGB**

source: The YIQ color model separates luma (brightness) from chroma (color), making it particularly useful for broadcast and image processing.
es: El modelo de color YIQ separa la luminancia (brillo) de la crominancia (color), lo que lo hace particularmente útil para la transmisión y el procesamiento de imágenes.
fr: Le modèle de couleur YIQ sépare la luminance (luminosité) de la chrominance (couleur), ce qui le rend particulièrement utile pour la diffusion et le traitement d'images.

source: **`yiq_2_rgb(y, i, q)` → (r, g, b)**: Converts a pixel from YIQ (luma, in-phase, quadrature) to RGB color space.
es: **`yiq_2_rgb(y, i, q)` → (r, g, b)**: Convierte un píxel de YIQ (luma, en fase, cuadratura) al espacio de color RGB.
fr: **`yiq_2_rgb(y, i, q)` → (r, g, b)** : Convertit un pixel de YIQ (luminance, phase en phase, quadrature) en espace colorimétrique RGB.

source: **`rgb_2_yiq(r, g, b)` → (y, i, q)**: Converts a pixel from RGB to YIQ color space.
es: **`rgb_2_yiq(r, g, b)` → (y, i, q)**: Convierte un píxel de RGB al espacio de color YIQ.
fr: **`rgb_2_yiq(r, g, b)` → (y, i, q)** : Convertit un pixel de RGB en espace colorimétrique YIQ.

source: **`RGB_TO_YIQ_inplace(image_surface, include_y, include_i, include_q)`**: Converts an entire image from RGB to YIQ in-place, modifying the given image surface.
es: **`RGB_TO_YIQ_inplace(image_surface, include_y, include_i, include_q)`**: Convierte una imagen completa de RGB a YIQ in situ, modificando la superficie de imagen dada.
fr: **`RGB_TO_YIQ_inplace(image_surface, include_y, include_i, include_q)`** : Convertit une image entière de RGB en YIQ sur place, modifiant la surface de l'image donnée.

source: **`RGB_TO_YIQ_inplace_c(w, h, rgb_array, luma, in_phase, quadrature)`**: A Cython-optimized, low-level function for in-place RGB-to-YIQ conversion, minimizing Python overhead.
es: **`RGB_TO_YIQ_inplace_c(w, h, rgb_array, luma, in_phase, quadrature)`**: Una función de bajo nivel optimizada con Cython para la conversión in situ de RGB a YIQ, minimizando la sobrecarga de Python.
fr: **`RGB_TO_YIQ_inplace_c(w, h, rgb_array, luma, in_phase, quadrature)`** : Une fonction optimisée en Cython, de bas niveau, pour la conversion RGB-to-YIQ sur place, minimisant l'overhead de Python.

source: **✅ Why YIQ?**
es: **✅ ¿Por qué YIQ?**
fr: **✅ Pourquoi YIQ ?**

source: YIQ is widely used in **NTSC television broadcasting** and in image processing applications where the separation of luma (brightness) and chroma (color) enhances processing and compression.
es: YIQ se utiliza ampliamente en la **transmisión de televisión NTSC** y en aplicaciones de procesamiento de imágenes donde la separación de la luminancia (brillo) y la crominancia (color) mejora el procesamiento y la compresión.
fr: YIQ est largement utilisé dans la **diffusion télévisée NTSC** et dans des applications de traitement d'images où la séparation de la luminance (luminosité) et de la chrominance (couleur) améliore le traitement et la compression.

source: **HSL ↔ RGB Conversions**
es: **Conversiones HSL ↔ RGB**
fr: **Conversions HSL ↔ RGB**

source: HSL stands for **Hue**, **Saturation**, and **Lightness**. It's commonly used for color adjustments, such as adjusting brightness or saturation.
es: HSL significa **Tono**, **Saturación** y **Luminosidad**. Se utiliza comúnmente para ajustes de color, como ajustar el brillo o la saturación.
fr: HSL signifie **Teinte**, **Saturation** et **Clarté**. Il est couramment utilisé pour les ajustements de couleur, tels que l'ajustement de la luminosité ou de la saturation.

source: **`hsl_to_rgb_pixel(h, s, l)` → (r, g, b)**: Converts a pixel from HSL (Hue, Saturation, Lightness) to RGB color space.
es: **`hsl_to_rgb_pixel(h, s, l)` → (r, g, b)**: Convierte un píxel de HSL (Tono, Saturación, Luminosidad) al espacio de color RGB.
fr: **`hsl_to_rgb_pixel(h, s, l)` → (r, g, b)** : Convertit un pixel de HSL (Teinte, Saturation, Clarté) en espace colorimétrique RGB.

source: **`rgb_pixel_to_hsl(r, g, b)` → (h, s, l)**: Converts a pixel from RGB to HSL color space.
es: **`rgb_pixel_to_hsl(r, g, b)` → (h, s, l)**: Convierte un píxel de RGB al espacio de color HSL.
fr: **`rgb_pixel_to_hsl(r, g, b)` → (h, s, l)** : Convertit un pixel de RGB en espace colorimétrique HSL.

source: **✅ Why HSL?**
es: **✅ ¿Por qué HSL?**
fr: **✅ Pourquoi HSL ?**

source: HSL is extremely useful for **color adjustment** in graphics applications. By working with the hue, saturation, and lightness, users can easily create effects like tints, shades, and saturation adjustments.
es: HSL es extremadamente útil para el **ajuste de color** en aplicaciones gráficas. Al trabajar con el tono, la saturación y la luminosidad, los usuarios pueden crear fácilmente efectos como tintes, sombras y ajustes de saturación.
fr: HSL est extrêmement utile pour l'**ajustement des couleurs** dans les applications de graphisme. En travaillant avec la teinte, la saturation et la clarté, les utilisateurs peuvent facilement créer des effets tels que les teintes, les ombres et les ajustements de saturation.

source: **HSV ↔ RGB Conversions**
es: **Conversiones HSV ↔ RGB**
fr: **Conversions HSV ↔ RGB**

source: HSV stands for **Hue**, **Saturation**, and **Value**, and it is widely used in color selection tools and image segmentation.
es: HSV significa **Tono**, **Saturación** y **Valor**, y se utiliza ampliamente en herramientas de selección de color y segmentación de imágenes.
fr: HSV signifie **Teinte**, **Saturation** et **Valeur**, et il est largement utilisé dans les outils de sélection de couleur et la segmentation d'images.

source: **`hsv_to_rgb_pixel(h, s, v)` → (r, g, b)**: Converts a pixel from HSV (Hue, Saturation, Value) to RGB color space.
es: **`hsv_to_rgb_pixel(h, s, v)` → (r, g, b)**: Convierte un píxel de HSV (Tono, Saturación, Valor) al espacio de color RGB.
fr: **`hsv_to_rgb_pixel(h, s, v)` → (r, g, b)** : Convertit un pixel de HSV (Teinte, Saturation, Valeur) en espace colorimétrique RGB.

source: **`rgb_pixel_to_hsv(r, g, b)` → (h, s, v)**: Converts a pixel from RGB to HSV color space.
es: **`rgb_pixel_to_hsv(r, g, b)` → (h, s, v)**: Convierte un píxel de RGB al espacio de color HSV.
fr: **`rgb_pixel_to_hsv(r, g, b)` → (h, s, v)** : Convertit un pixel de RGB en espace colorimétrique HSV.

source: **✅ Why HSV?**
es: **✅ ¿Por qué HSV?**
fr: **✅ Pourquoi HSV ?**

source: HSV is frequently used in **color selection tools** and **image segmentation**, as it separates chromatic content from brightness, making it easier to manipulate colors based on their hue, saturation, or value.
es: HSV se utiliza frecuentemente en **herramientas de selección de color** y **segmentación de imágenes**, ya que separa el contenido cromático del brillo, lo que facilita la manipulación de colores en función de su tono, saturación o valor.
fr: HSV est fréquemment utilisé dans les **outils de sélection de couleurs** et la **segmentation d'images**, car il sépare le contenu chromatique de la luminosité, facilitant ainsi la manipulation des couleurs en fonction de leur teinte, saturation ou valeur.

source: 4. Optimization Features
es: 4. Características de Optimización
fr: 4. Fonctionnalités d'optimisation

source: This library is designed with performance in mind. Here are the key optimization features:
es: Esta biblioteca está diseñada pensando en el rendimiento. Aquí están las características clave de optimización:
fr: Cette bibliothèque est conçue avec la performance à l'esprit. Voici les principales fonctionnalités d'optimisation :

source: **Cython-based optimization** (`cdef`, `cpdef`, `nogil`): Critical functions are compiled into C using Cython, significantly improving speed.
es: **Optimización basada en Cython** (`cdef`, `cpdef`, `nogil`): Las funciones críticas se compilan en C usando Cython, mejorando significativamente la velocidad.
fr: **Optimisation basée sur Cython** (`cdef`, `cpdef`, `nogil`) : Les fonctions critiques sont compilées en C à l'aide de Cython, améliorant considérablement la vitesse.

source: **In-place operations** (`RGB_TO_YIQ_inplace`): By modifying image arrays directly, the library reduces memory overhead and avoids unnecessary copies.
es: **Operaciones in situ** (`RGB_TO_YIQ_inplace`): Al modificar directamente los arreglos de imágenes, la biblioteca reduce la sobrecarga de memoria y evita copias innecesarias.
fr: **Opérations sur place** (`RGB_TO_YIQ_inplace`) : En modifiant directement les tableaux d'image, la bibliothèque réduit l'empreinte mémoire et évite les copies inutiles.

source: **No GIL** (`nogil`): The Cython implementation enables multi-threading, allowing for parallel execution and further performance improvements.
es: **Sin GIL** (`nogil`): La implementación de Cython permite la ejecución en múltiples hilos, lo que permite la ejecución en paralelo y mejoras adicionales en el rendimiento.
fr: **Pas de GIL** (`nogil`) : L'implémentation Cython permet l'utilisation de plusieurs threads, permettant une exécution parallèle et des améliorations supplémentaires de la performance.

source: 5. Use Cases
es: 5. Casos de Uso
fr: 5. Cas d'utilisation

source: This library is highly useful for various fields where color manipulation is essential. Some key use cases include:
es: Esta biblioteca es muy útil para diversos campos donde la manipulación del color es esencial. Algunos casos de uso clave incluyen:
fr: Cette bibliothèque est très utile dans divers domaines où la manipulation des couleurs est essentielle. Voici quelques cas d'utilisation clés :

source: **Image Processing**: Transform images into different color spaces for tasks such as filtering, thresholding, or general analysis.
es: **Procesamiento de Imágenes**: Transformar imágenes a diferentes espacios de color para tareas como filtrado, umbralización o análisis general.
fr: **Traitement d'images** : Transformez les images en différents espaces colorimétriques pour des tâches telles que le filtrage, le seuillage ou l'analyse générale.

source: **Computer Vision**: Utilize HSV or YIQ for **color-based object detection**, image segmentation, or feature extraction.
es: **Visión por Computadora**: Utilizar HSV o YIQ para la **detección de objetos basada en color**, segmentación de imágenes o extracción de características.
fr: **Vision par ordinateur** : Utilisez HSV ou YIQ pour la **détection d'objets basée sur la couleur**, la segmentation d'images ou l'extraction de caractéristiques.

source: **Graphics Applications**: Adjust color properties like hue, saturation, lightness, and brightness to create visual effects and improve contrast.
es: **Aplicaciones Gráficas**: Ajustar propiedades de color como tono, saturación, luminosidad y brillo para crear efectos visuales y mejorar el contraste.
fr: **Applications graphiques** : Ajustez les propriétés de couleur comme la teinte, la saturation, la clarté et la luminosité pour créer des effets visuels et améliorer le contraste.

source: **Broadcasting & Video Processing**: Convert between RGB and YIQ color spaces for **NTSC signals** in television broadcasting or video processing applications.
es: **Transmisión y Procesamiento de Video**: Convertir entre espacios de color RGB y YIQ para **señales NTSC** en transmisiones de televisión o aplicaciones de procesamiento de video.
fr: **Diffusion & Traitement vidéo** : Convertissez entre les espaces colorimétriques RGB et YIQ pour les **signaux NTSC** dans la diffusion télévisée ou les applications de traitement vidéo.

source: This library provides fast, efficient, and easy-to-use color space conversions, optimized for performance through Cython. Its versatility makes it invaluable for image processing, computer vision, graphics applications, and more.
es: Esta biblioteca proporciona conversiones de espacios de color rápidas, eficientes y fáciles de usar, optimizadas para el rendimiento mediante Cython. Su versatilidad la hace invaluable para el procesamiento de imágenes, la visión por computadora, aplicaciones gráficas y más.
fr: Cette bibliothèque fournit des conversions d'espace colorimétrique rapides, efficaces et faciles à utiliser, optimisées pour la performance via Cython. Sa polyvalence la rend précieuse pour le traitement d'images, la vision par ordinateur, les applications graphiques et bien plus encore.

source: 7. Cython list methods
es: 7. Métodos de listas en Cython
fr: 7. Méthodes de liste Cython

source: Summary: Converts RGB color values into the YIQ color model. The YIQ model was historically used in NTSC television broadcasting and separates the brightness (Y) from the chrominance components (I and Q). This function performs the conversion using normalized floating-point calculations.
es: Resumen: Convierte valores de color RGB al modelo de color YIQ. El modelo YIQ se utilizó históricamente en la transmisión de televisión NTSC y separa el brillo (Y) de los componentes de crominancia (I y Q). Esta función realiza la conversión utilizando cálculos de punto flotante normalizados.
fr: Résumé : Convertit les valeurs de couleur RGB en modèle de couleur YIQ. Le modèle YIQ a été historiquement utilisé dans la diffusion télévisée NTSC et sépare la luminosité (Y) des composants de chrominance (I et Q). Cette fonction effectue la conversion en utilisant des calculs en virgule flottante normalisés.

source: Example Usage:
es: Ejemplo de Uso:
fr: Exemple d'utilisation :

source: Parameters:
es: Parámetros:
fr: Paramètres :

source: **r** (unsigned char): An integer representing the red channel, in the range [0, 255].
es: **r** (unsigned char): Un entero que representa el canal rojo, en el rango [0, 255].
fr: **r** (unsigned char) : Un entier représentant le canal rouge, dans la plage [0, 255].

source: **g** (unsigned char): An integer representing the green channel, in the range [0, 255].
es: **g** (unsigned char): Un entero que representa el canal verde, en el rango [0, 255].
fr: **g** (unsigned char) : Un entier représentant le canal vert, dans la plage [0, 255].

source: **b** (unsigned char): An integer representing the blue channel, in the range [0, 255].
es: **b** (unsigned char): Un entero que representa el canal azul, en el rango [0, 255].
fr: **b** (unsigned char) : Un entier représentant le canal bleu, dans la plage [0, 255].

source: Returns:
es: Devuelve:
fr: Retourne :

source: A tuple `(Y, I, Q)` where: - **Y** (float): The Luma component, representing brightness. - **I** (float): The In-phase chrominance, representing the orange-blue hue. - **Q** (float): The Quadrature chrominance, representing the purple-green hue.
es: Una tupla `(Y, I, Q)` donde: - **Y** (float): El componente de Luma, que representa el brillo. - **I** (float): La crominancia en fase, que representa el tono naranja-azul. - **Q** (float): La crominancia en cuadratura, que representa el tono púrpura-verde.
fr: Un tuple `(Y, I, Q)` où : - **Y** (float) : Le composant Luma, représentant la luminosité. - **I** (float) : La chrominance en phase, représentant la teinte orange-bleu. - **Q** (float) : La chrominance en quadrature, représentant la teinte violet-vert.

source: Raises:
es: Lanza:
fr: Lève :

source: **ValueError**: If any input value is outside the valid range [0, 255].
es: **ValueError**: Si algún valor de entrada está fuera del rango válido [0, 255].
fr: **ValueError** : Si une valeur d'entrée est en dehors de la plage valide [0, 255].

source: Notes:
es: Notas:
fr: Remarques :

source: The YIQ color model is used primarily in NTSC broadcasting and separates color information (chrominance) from brightness (luma).
es: El modelo de color YIQ se utiliza principalmente en la transmisión NTSC y separa la información de color (crominancia) del brillo (luma).
fr: Le modèle de couleur YIQ est principalement utilisé dans la diffusion NTSC et sépare l'information chromatique (chrominance) de la luminosité (luma).

source: The conversion is done using normalized floating-point calculations for accurate representation in the YIQ color space.
es: La conversión se realiza utilizando cálculos de punto flotante normalizados para una representación precisa en el espacio de color YIQ.
fr: La conversion est effectuée à l'aide de calculs en virgule flottante normalisés pour une représentation précise dans l'espace colorimétrique YIQ.

source: **Summary**: Converts YIQ color model values into equivalent RGB values. The YIQ color model was historically used in NTSC television broadcasting and separates the brightness (Y) from the chrominance components (I and Q). This function converts the YIQ values back into RGB format, with the resulting values scaled to the [0, 255] range and rounded to the nearest integer.
es: **Resumen**: Convierte valores del modelo de color YIQ a valores RGB equivalentes. El modelo de color YIQ se utilizó históricamente en la transmisión de televisión NTSC y separa el brillo (Y) de los componentes de crominancia (I y Q). Esta función convierte los valores YIQ de nuevo al formato RGB, escalando los valores resultantes al rango [0, 255] y redondeándolos al entero más cercano.
fr: **Résumé** : Convertit les valeurs du modèle de couleur YIQ en valeurs RGB équivalentes. Le modèle YIQ a été historiquement utilisé dans la diffusion télévisée NTSC et sépare la luminosité (Y) des composants de chrominance (I et Q). Cette fonction convertit les valeurs YIQ en format RGB, avec les valeurs résultantes mises à l'échelle dans la plage [0, 255] et arrondies à l'entier le plus proche.

source: **Example Usage**:
es: **Ejemplo de Uso**:
fr: **Exemple d'utilisation** :

source: **Parameters**:
es: **Parámetros**:
fr: **Paramètres** :

source: **y** (float): The Luma (brightness) component of the YIQ color model.
es: **y** (float): El componente de Luma (brillo) del modelo de color YIQ.
fr: **y** (float) : Le composant Luma (luminosité) du modèle de couleur YIQ.

source: **i** (float): The In-phase chrominance, representing the orange-blue contrast.
es: **i** (float): La crominancia en fase, que representa el contraste naranja-azul.
fr: **i** (float) : La chrominance en phase, représentant le contraste orange-bleu.

source: **q** (float): The Quadrature chrominance, representing the purple-green contrast.
es: **q** (float): La crominancia en cuadratura, que representa el contraste púrpura-verde.
fr: **q** (float) : La chrominance en quadrature, représentant le contraste violet-vert.

source: **Returns**:
es: **Devuelve**:
fr: **Retourne** :

source: A tuple `(R, G, B)` where:
es: Una tupla `(R, G, B)` donde:
fr: Un tuple `(R, G, B)` où :

source: **R** (unsigned char): Red value in the range [0, 255].
es: **R** (unsigned char): Valor rojo en el rango [0, 255].
fr: **R** (unsigned char) : Valeur rouge dans la plage [0, 255].

source: **G** (unsigned char): Green value in the range [0, 255].
es: **G** (unsigned char): Valor verde en el rango [0, 255].
fr: **G** (unsigned char) : Valeur verte dans la plage [0, 255].

source: **B** (unsigned char): Blue value in the range [0, 255].
es: **B** (unsigned char): Valor azul en el rango [0, 255].
fr: **B** (unsigned char) : Valeur bleue dans la plage [0, 255].

source: **Raises**:
es: **Lanza**:
fr: **Lève** :

source: **ValueError**: If the input values for `y`, `i`, or `q` are outside the expected range for the YIQ model.
es: **ValueError**: Si los valores de entrada para `y`, `i` o `q` están fuera del rango esperado para el modelo YIQ.
fr: **ValueError** : Si les valeurs d'entrée pour `y`, `i` ou `q` sont en dehors de la plage attendue pour le modèle YIQ.

source: **Notes**:
es: **Notas**:
fr: **Remarques** :

source: The YIQ color model separates brightness (Y) from chrominance (I and Q), which allows black-and-white TVs to display just the Y component.
es: El modelo de color YIQ separa el brillo (Y) de la crominancia (I y Q), lo que permite que los televisores en blanco y negro muestren solo el componente Y.
fr: Le modèle de couleur YIQ sépare la luminosité (Y) de la chrominance (I et Q), ce qui permet aux téléviseurs en noir et blanc d'afficher uniquement le composant Y.

source: The function scales and rounds the RGB values to fit within the [0, 255] range, making them suitable for display or further processing.
es: La función escala y redondea los valores RGB para que se ajusten al rango [0, 255], haciéndolos adecuados para su visualización o procesamiento adicional.
fr: La fonction met à l'échelle et arrondit les valeurs RGB pour les faire tenir dans la plage [0, 255], les rendant adaptées à l'affichage ou au traitement ultérieur.
