Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: Convert a 1D array of uint8 data (RGB(A)) to grayscale (with alpha) in place. A grayscale image has a single channel representing pixel intensity or brightness, with pixel values typically ranging from 0 (black) to 255 (white). This function converts the input RGB(A) array to grayscale while preserving the alpha channel (if present). The conversion is performed in place, modifying the original array.
es: Convierte un arreglo 1D de datos uint8 (RGB(A)) a escala de grises (con alfa) in situ. Una imagen en escala de grises tiene un solo canal que representa la intensidad o el brillo de los píxeles, con valores de píxeles que generalmente varían de 0 (negro) a 255 (blanco). Esta función convierte el arreglo RGB(A) de entrada a escala de grises mientras preserva el canal alfa (si está presente). La conversión se realiza in situ, modificando el arreglo original.
fr: Convertit un tableau 1D de données uint8 (RGB(A)) en niveaux de gris (avec alpha) en place. Une image en niveaux de gris possède un seul canal représentant l'intensité ou la luminosité des pixels, avec des valeurs généralement comprises entre 0 (noir) et 255 (blanc). Cette fonction convertit le tableau RGB(A) d'entrée en niveaux de gris tout en préservant le canal alpha (s'il est présent). La conversion est effectuée en place, modifiant le tableau d'origine.

source: Set `format_32` to `True` if the array is a 32-bit buffer containing RGBA values.
es: Establece `format_32` en `True` si el arreglo es un búfer de 32 bits que contiene valores RGBA.
fr: Définissez `format_32` sur `True` si le tableau est un tampon 32 bits contenant des valeurs RGBA.

source: **rgb_array** (numpy.ndarray or bytearray) A 1D array or buffer containing pixel data in RGB(A) format, with dtype uint8 (unsigned char values ranging from 0 to 255).
es: **rgb_array** (numpy.ndarray o bytearray) Un arreglo 1D o búfer que contiene datos de píxeles en formato RGB(A), con dtype uint8 (valores de carácter sin signo que varían de 0 a 255).
fr: **rgb_array** (numpy.ndarray ou bytearray) Un tableau 1D ou un tampon contenant des données de pixels au format RGB(A), avec le type `uint8` (valeurs de type char non signées allant de 0 à 255).

source: **format_32** (bool, optional) If `True`, the function assumes the input is a 32-bit buffer (RGBA). If `False`, the function assumes a 24-bit buffer (RGB).
es: **format_32** (bool, opcional) Si es `True`, la función asume que la entrada es un búfer de 32 bits (RGBA). Si es `False`, la función asume un búfer de 24 bits (RGB).
fr: **format_32** (booléen, optionnel) Si `True`, la fonction considère que l'entrée est un tampon 32 bits (RGBA). Si `False`, la fonction considère un tampon 24 bits (RGB).

source: **None** The function modifies the input array in place and does not return a new array.
es: **None** La función modifica el arreglo de entrada in situ y no devuelve un nuevo arreglo.
fr: **None** La fonction modifie le tableau d'entrée en place et ne retourne pas de nouveau tableau.

source: Convert a 1D array of uint8 BGR(A) data to grayscale (with alpha channel) and return a copy. This function checks that the input array has the expected uint8 data type, and then converts the pixel data from BGR or BGRA format to grayscale. The conversion preserves the alpha channel (if present). It returns a new 1D NumPy array in grayscale format.
es: Convierte un arreglo 1D de datos uint8 BGR(A) a escala de grises (con canal alfa) y devuelve una copia. Esta función verifica que el arreglo de entrada tenga el tipo de datos uint8 esperado, y luego convierte los datos de píxeles de formato BGR o BGRA a escala de grises. La conversión preserva el canal alfa (si está presente). Devuelve un nuevo arreglo 1D de NumPy en formato de escala de grises.
fr: Convertit un tableau 1D de données BGR(A) uint8 en niveaux de gris (avec canal alpha) et retourne une copie. Cette fonction vérifie que le tableau d'entrée a le type de données uint8 attendu, puis convertit les données des pixels du format BGR ou BGRA en niveaux de gris. La conversion préserve le canal alpha (s'il est présent). Elle retourne un nouveau tableau NumPy 1D au format niveaux de gris.

source: The grayscale conversion is based on the luminosity formula, which calculates the brightness based on the red, green, and blue channels.
es: La conversión a escala de grises se basa en la fórmula de luminosidad, que calcula el brillo basándose en los canales rojo, verde y azul.
fr: La conversion en niveaux de gris est basée sur la formule de luminosité, qui calcule la luminosité en fonction des canaux rouge, vert et bleu.

source: **bgr_array** (numpy.ndarray) A 1D array containing pixel data in BGR(A) format, with dtype uint8. The pixel values should range from 0 to 255. If the array represents a BGRA image, the alpha channel will be preserved.
es: **bgr_array** (numpy.ndarray) Un arreglo 1D que contiene datos de píxeles en formato BGR(A), con dtype uint8. Los valores de píxeles deben variar de 0 a 255. Si el arreglo representa una imagen BGRA, el canal alfa se preservará.
fr: **bgr_array** (numpy.ndarray) Un tableau 1D contenant des données de pixels au format BGR(A), avec le type `uint8`. Les valeurs des pixels doivent être comprises entre 0 et 255. Si le tableau représente une image BGRA, le canal alpha sera préservé.

source: **format_32** (bool, optional) If `True`, the input array is assumed to be in BGRA (32-bit) format. If `False`, the array is assumed to be in BGR (24-bit) format.
es: **format_32** (bool, opcional) Si es `True`, se asume que el arreglo de entrada está en formato BGRA (32 bits). Si es `False`, se asume que el arreglo está en formato BGR (24 bits).
fr: **format_32** (booléen, optionnel) Si `True`, le tableau d'entrée est supposé être au format BGRA (32 bits). Si `False`, le tableau est supposé être au format BGR (24 bits).

source: **numpy.ndarray** A new 1D NumPy array of shape (w,) with dtype uint8, containing the grayscale pixel data. If the input was in BGRA format, the alpha channel is preserved in the output.
es: **numpy.ndarray** Un nuevo arreglo 1D de NumPy de forma (w,) con dtype uint8, que contiene los datos de píxeles en escala de grises. Si la entrada estaba en formato BGRA, el canal alfa se preserva en la salida.
fr: **numpy.ndarray** Un nouveau tableau 1D NumPy de forme (w,) avec le type `uint8`, contenant les données des pixels en niveaux de gris. Si l'entrée était au format BGRA, le canal alpha est préservé dans la sortie.

source: **TypeError** If the input array does not have dtype uint8, a `TypeError` will be raised.
es: **TypeError** Si el arreglo de entrada no tiene dtype uint8, se lanzará un `TypeError`.
fr: **TypeError** Si le tableau d'entrée n'a pas le type `uint8`, une `TypeError` sera levée.

source: Apply a sepia tone filter to an image, surface, or video game graphics (inplace). Sepia toning is a technique used in photography and imaging where the image is given a reddish-brown tint, simulating the warm tones of old photographs. It creates a softer, dreamier aesthetic compared to standard grayscale, adding depth and a vintage look.
es: Aplica un filtro de tono sepia a una imagen, superficie o gráficos de videojuegos (in situ). El tono sepia es una técnica utilizada en fotografía e imágenes donde la imagen se tiñe de un tono marrón rojizo, simulando los tonos cálidos de las fotografías antiguas. Crea una estética más suave y onírica en comparación con la escala de grises estándar, añadiendo profundidad y un aspecto vintage.
fr: Applique un filtre sépia à une image, une surface ou des graphiques de jeu vidéo (en place). Le ton sépia est une technique utilisée en photographie et en imagerie où l'image reçoit une teinte rouge-brun, simulant les tons chauds des anciennes photographies. Il crée une esthétique plus douce et rêveuse par rapport aux niveaux de gris standard, ajoutant de la profondeur et un aspect vintage.

source: This function transforms the provided surface into an equivalent sepia-toned model, adjusting the pixel colors accordingly while preserving the original structure. The transformation is applied directly to the surface (inplace), and no new surface is returned.
es: Esta función transforma la superficie proporcionada en un modelo equivalente con tono sepia, ajustando los colores de los píxeles en consecuencia mientras preserva la estructura original. La transformación se aplica directamente a la superficie (in situ), y no se devuelve una nueva superficie.
fr: Cette fonction transforme la surface fournie en un modèle équivalent au ton sépia, ajustant les couleurs des pixels en conséquence tout en préservant la structure originale. La transformation est appliquée directement à la surface (en place), et aucune nouvelle surface n'est retournée.

source: **Example:**
es: **Ejemplo:**
fr: **Exemple :**

source: Sepia model (New Surface)
es: Modelo sepia (Nueva superficie)
fr: Modèle sépia (Nouvelle surface)

source: Transform your video game/image or surface into an equivalent sepia model.
es: Transforma tu videojuego/imagen o superficie en un modelo equivalente con tono sepia.
fr: Transformez votre jeu vidéo/image ou surface en un modèle équivalent sépia.

source: While traditional black-and-white photographs use a standard grayscale to create highlights and shadows, sepia-toned photos use a reddish-brown tone to create that spectrum. “Sepia is a softer manipulation of light.” This gives them a softer, dreamier aesthetic.
es: Mientras que las fotografías tradicionales en blanco y negro utilizan una escala de grises estándar para crear luces y sombras, las fotografías en tono sepia utilizan un tono marrón rojizo para crear ese espectro. “El sepia es una manipulación más suave de la luz.” Esto les da una estética más suave y onírica.
fr: Tandis que les photographies noir et blanc traditionnelles utilisent un niveau de gris standard pour créer des zones claires et sombres, les photographies sépia utilisent une teinte rouge-brun pour créer ce spectre. « Le sépia est une manipulation plus douce de la lumière. » Ce qui leur donne une esthétique plus douce et rêveuse.

source: Apply a sepia tone filter to a 3D RGB(A) image array (inplace).
es: Aplica un filtro de tono sepia a un arreglo de imagen 3D RGB(A) (in situ).
fr: Applique un filtre sépia à un tableau d'image 3D RGB(A) (en place).

source: This function processes a 3D NumPy array representing pixel data in RGB(A) format and applies a sepia filter. The sepia effect is achieved by adjusting the red, green, and blue channels according to predefined coefficients, creating a warm-toned, vintage effect. The function modifies the input array directly and does not return anything.
es: Esta función procesa un arreglo 3D de NumPy que representa datos de píxeles en formato RGB(A) y aplica un filtro sepia. El efecto sepia se logra ajustando los canales rojo, verde y azul según coeficientes predefinidos, creando un efecto cálido y vintage. La función modifica el arreglo de entrada directamente y no devuelve nada.
fr: Cette fonction traite un tableau 3D NumPy représentant les données de pixels au format RGB(A) et applique un filtre sépia. L'effet sépia est obtenu en ajustant les canaux rouge, vert et bleu selon des coefficients prédéfinis, créant un effet vintage aux tons chauds. La fonction modifie directement le tableau d'entrée et ne retourne rien.

source: Only arrays with shapes (w, h, 3) for RGB or (w, h, 4) for RGBA are supported.
es: Solo se admiten arreglos con formas (w, h, 3) para RGB o (w, h, 4) para RGBA.
fr: Seuls les tableaux ayant des formes (w, h, 3) pour RGB ou (w, h, 4) pour RGBA sont pris en charge.

source: **rgb_array** (numpy.ndarray) A 3D array with shape (w, h, 3) for RGB or (w, h, 4) for RGBA pixel data, where `w` is the width, `h` is the height, and `3` or `4` corresponds to the RGB or RGBA channels. The array must have dtype uint8 (unsigned char) with pixel values ranging from 0 to 255.
es: **rgb_array** (numpy.ndarray) Un arreglo 3D con forma (w, h, 3) para datos de píxeles RGB o (w, h, 4) para RGBA, donde `w` es el ancho, `h` es la altura, y `3` o `4` corresponde a los canales RGB o RGBA. El arreglo debe tener dtype uint8 (carácter sin signo) con valores de píxeles que varían de 0 a 255.
fr: **rgb_array** (numpy.ndarray) Un tableau 3D de forme (w, h, 3) pour RGB ou (w, h, 4) pour les données de pixels RGBA, où `w` est la largeur, `h` est la hauteur, et `3` ou `4` correspond aux canaux RGB ou RGBA. Le tableau doit avoir le type `uint8` (caractère non signé) avec des valeurs de pixels comprises entre 0 et 255.

source: **ValueError** If the input array does not have the expected shape (w, h, 3) or (w, h, 4).
es: **ValueError** Si el arreglo de entrada no tiene la forma esperada (w, h, 3) o (w, h, 4).
fr: **ValueError** Si le tableau d'entrée n'a pas la forme attendue (w, h, 3) ou (w, h, 4).

source: **TypeError** If the input array does not have dtype uint8.
es: **TypeError** Si el arreglo de entrada no tiene dtype uint8.
fr: **TypeError** Si le tableau d'entrée n'a pas le type `uint8`.

source: **Notes:**
es: **Notas:**
fr: **Remarques :**

source: This function modifies the input `rgb_array` directly (inplace).
es: Esta función modifica el arreglo de entrada `rgb_array` directamente (in situ).
fr: Cette fonction modifie directement le tableau `rgb_array` d'entrée (en place).

source: If the input is in RGBA format, the alpha channel is preserved.
es: Si la entrada está en formato RGBA, el canal alfa se preserva.
fr: Si l'entrée est au format RGBA, le canal alpha est préservé.

source: The sepia effect is applied by adjusting the luminosity of the RGB channels using a set of coefficients.
es: El efecto sepia se aplica ajustando la luminosidad de los canales RGB utilizando un conjunto de coeficientes.
fr: L'effet sépia est appliqué en ajustant la luminosité des canaux RGB à l'aide d'un ensemble de coefficients.

source: Convert a 1D array of uint8 data (RGB(A)) to sepia equivalent (inplace).
es: Convierte un arreglo 1D de datos uint8 (RGB(A)) a equivalente sepia (in situ).
fr: Convertir un tableau 1D de données uint8 (RGB(A)) en équivalent sépia (en place).

source: While traditional black-and-white photographs use a standard grayscale to create highlights and shadows, sepia-toned photos use a reddish-brown tone to create that spectrum. "Sepia is a softer manipulation of light," creating a softer, dreamier aesthetic.
es: Mientras que las fotografías tradicionales en blanco y negro utilizan una escala de grises estándar para crear luces y sombras, las fotografías en tono sepia utilizan un tono marrón rojizo para crear ese espectro. "El sepia es una manipulación más suave de la luz," creando una estética más suave y onírica.
fr: Tandis que les photographies noir et blanc traditionnelles utilisent un niveau de gris standard pour créer des zones claires et sombres, les photographies sépia utilisent une teinte rouge-brun pour créer ce spectre. "Le sépia est une manipulation plus douce de la lumière," créant une esthétique plus douce et rêveuse.

source: For a 24-bit image (RGB):
es: Para una imagen de 24 bits (RGB):
fr: Pour une image 24 bits (RGB) :

source: For a 32-bit image (RGBA):
es: Para una imagen de 32 bits (RGBA):
fr: Pour une image 32 bits (RGBA) :

source: or
es: o
fr: ou

source: **rgb_array** (numpy.ndarray) A 1D array of shape (w,) containing uint8 pixel data (values ranging from 0 to 255) in RGB(A) format. Can be either a NumPy array or a raw byte buffer.
es: **rgb_array** (numpy.ndarray) Un arreglo 1D de forma (w,) que contiene datos de píxeles uint8 (valores que varían de 0 a 255) en formato RGB(A). Puede ser un arreglo NumPy o un búfer de bytes crudo.
fr: **rgb_array** (numpy.ndarray) Un tableau 1D de forme (w,) contenant des données de pixels uint8 (valeurs allant de 0 à 255) au format RGB(A). Peut être soit un tableau NumPy soit un tampon brut de bytes.

source: **format_32** (bool, optional, default=False) If `True`, the input is treated as a 24-bit RGB buffer. If `False`, the input is treated as a 32-bit RGBA buffer.
es: **format_32** (bool, opcional, predeterminado=False) Si es `True`, la entrada se trata como un búfer RGB de 24 bits. Si es `False`, la entrada se trata como un búfer RGBA de 32 bits.
fr: **format_32** (booléen, optionnel, valeur par défaut=False) Si `True`, l'entrée est traitée comme un tampon RGB 24 bits. Si `False`, l'entrée est traitée comme un tampon RGBA 32 bits.

source: None The function modifies the input array in place and does not return a new array.
es: None La función modifica el arreglo de entrada in situ y no devuelve un nuevo arreglo.
fr: None La fonction modifie le tableau d'entrée en place et ne retourne pas un nouveau tableau.

source: Apply a median filter to a surface (inplace).
es: Aplica un filtro de mediana a una superficie (in situ).
fr: Applique un filtre médian à une surface (en place).

source: The median filter is a non-linear image filtering technique commonly used for removing noise from an image or signal. It works by replacing each pixel value with the median of the pixel values in a neighborhood defined by the kernel size. This technique is widely used for noise reduction in digital image processing, especially for preserving edges while removing noise.
es: El filtro de mediana es una técnica de filtrado de imágenes no lineal comúnmente utilizada para eliminar ruido de una imagen o señal. Funciona reemplazando cada valor de píxel con la mediana de los valores de píxeles en un vecindario definido por el tamaño del kernel. Esta técnica se utiliza ampliamente para la reducción de ruido en el procesamiento digital de imágenes, especialmente para preservar bordes mientras se elimina el ruido.
fr: Le filtre médian est une technique de filtrage d'image non linéaire couramment utilisée pour éliminer le bruit d'une image ou d'un signal. Il fonctionne en remplaçant chaque valeur de pixel par la médiane des valeurs de pixel dans un voisinage défini par la taille du noyau. Cette technique est largement utilisée pour la réduction du bruit dans le traitement d'image numérique, surtout pour préserver les bords tout en éliminant le bruit.

source: The strength of the effect is controlled by the `kernel_size` parameter, with larger kernel sizes producing stronger filtering effects. However, larger kernel sizes may also slow down the process significantly.
es: La fuerza del efecto se controla mediante el parámetro `kernel_size`, con tamaños de kernel más grandes produciendo efectos de filtrado más fuertes. Sin embargo, los tamaños de kernel más grandes también pueden ralentizar significativamente el proceso.
fr: La force de l'effet est contrôlée par le paramètre `kernel_size`, avec des tailles de noyau plus grandes produisant des effets de filtrage plus forts. Cependant, des tailles de noyau plus grandes peuvent également ralentir considérablement le processus.

source: **Note:** This filter is not suitable for real-time rendering in games or animations due to its computational cost.
es: **Nota:** Este filtro no es adecuado para renderizado en tiempo real en juegos o animaciones debido a su costo computacional.
fr: **Note :** Ce filtre n'est pas adapté pour le rendu en temps réel dans les jeux ou animations en raison de son coût computationnel.

source: For a 24-bit image:
es: Para una imagen de 24 bits:
fr: Pour une image 24 bits :

source: For a 32-bit image:
es: Para una imagen de 32 bits:
fr: Pour une image 32 bits :

source: **surface_** (pygame.Surface) A Pygame surface object (24-bit or 32-bit) containing the image to be processed. It can have or lack an alpha channel for transparency.
es: **surface_** (pygame.Surface) Un objeto de superficie de Pygame (24 bits o 32 bits) que contiene la imagen a procesar. Puede tener o carecer de un canal alfa para transparencia.
fr: **surface_** (pygame.Surface) Un objet surface Pygame (24 bits ou 32 bits) contenant l'image à traiter. Il peut avoir ou non un canal alpha pour la transparence.

source: **kernel_size_** (unsigned short int, optional, default=2) The size of the kernel or neighborhood of pixels used for the median calculation. Increasing the kernel size improves the filter effect but decreases performance.
es: **kernel_size_** (unsigned short int, opcional, predeterminado=2) El tamaño del kernel o vecindario de píxeles utilizado para el cálculo de la mediana. Aumentar el tamaño del kernel mejora el efecto del filtro pero disminuye el rendimiento.
fr: **kernel_size_** (entier court non signé, optionnel, valeur par défaut=2) La taille du noyau ou du voisinage des pixels utilisés pour le calcul de la médiane. Augmenter la taille du noyau améliore l'effet du filtre, mais diminue les performances.

source: **fast_** (bool, optional, default=True) A flag to enable fast calculation. If `True`, the filter uses a smaller texture size to improve performance, which may reduce the quality based on the `reduce_factor_` argument.
es: **fast_** (bool, opcional, predeterminado=True) Una bandera para habilitar el cálculo rápido. Si es `True`, el filtro utiliza un tamaño de textura más pequeño para mejorar el rendimiento, lo que puede reducir la calidad según el argumento `reduce_factor_`.
fr: **fast_** (booléen, optionnel, valeur par défaut=True) Un indicateur pour activer le calcul rapide. Si `True`, le filtre utilise une taille de texture plus petite pour améliorer les performances, ce qui peut réduire la qualité en fonction de l'argument `reduce_factor_`.

source: **reduce_factor_** (unsigned short int, optional, default=1) A factor to reduce the size of the surface before processing. A value of 1 divides the surface by 2, and a value of 2 reduces the surface by 4. Values larger than 2 may degrade the image quality. Has no effect if `fast_` is `False`.
es: **reduce_factor_** (unsigned short int, opcional, predeterminado=1) Un factor para reducir el tamaño de la superficie antes del procesamiento. Un valor de 1 divide la superficie por 2, y un valor de 2 reduce la superficie por 4. Valores mayores que 2 pueden degradar la calidad de la imagen. No tiene efecto si `fast_` es `False`.
fr: **reduce_factor_** (entier court non signé, optionnel, valeur par défaut=1) Un facteur pour réduire la taille de la surface avant traitement. Une valeur de 1 divise la surface par 2, et une valeur de 2 réduit la surface de 4. Des valeurs supérieures à 2 peuvent dégrader la qualité de l'image. N'a aucun effet si `fast_` est `False`.

source: None The function modifies the surface directly (in-place) and does not return a value.
es: None La función modifica la superficie directamente (in situ) y no devuelve un valor.
fr: None La fonction modifie directement la surface (en place) et ne retourne pas de valeur.

source: **ValueError** If `surface_` is not a valid `pygame.Surface` or if the `kernel_size_` or `reduce_factor_` are out of valid ranges.
es: **ValueError** Si `surface_` no es un `pygame.Surface` válido o si `kernel_size_` o `reduce_factor_` están fuera de los rangos válidos.
fr: **ValueError** Si `surface_` n'est pas une `pygame.Surface` valide ou si les `kernel_size_` ou `reduce_factor_` sont hors des plages valides.

source: Apply a painting effect (in-place) to a Pygame surface.
es: Aplica un efecto de pintura (in situ) a una superficie de Pygame.
fr: Applique un effet de peinture (en place) à une surface Pygame.
