Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: **sat_** (float, optional) A factor controlling the saturation, default value is 1.0/6.0.
es: **sat_** (float, opcional) Un factor que controla la saturación, el valor predeterminado es 1.0/6.0.
fr: **sat_** (float, optionnel) Un facteur contrôlant la saturation, la valeur par défaut est 1.0/6.0.

source: **value_** (float, optional) A factor controlling the value, default value is 1.0/8.0.
es: **value_** (float, opcional) Un factor que controla el valor, el valor predeterminado es 1.0/8.0.
fr: **value_** (float, optionnel) Un facteur contrôlant la valeur, la valeur par défaut est 1.0/8.0.

source: **a_** (float, optional) A control parameter for the plasma equation, default value is 1.0/255.0.
es: **a_** (float, opcional) Un parámetro de control para la ecuación de plasma, el valor predeterminado es 1.0/255.0.
fr: **a_** (float, optionnel) Un paramètre de contrôle pour l'équation du plasma, la valeur par défaut est 1.0/255.0.

source: **b_** (float, optional) A control parameter for the plasma equation, default value is 1.0/12.0.
es: **b_** (float, opcional) Un parámetro de control para la ecuación de plasma, el valor predeterminado es 1.0/12.0.
fr: **b_** (float, optionnel) Un paramètre de contrôle pour l'équation du plasma, la valeur par défaut est 1.0/12.0.

source: **c_** (float, optional) A control parameter for the plasma equation, default value is 1.0/12.0.
es: **c_** (float, opcional) Un parámetro de control para la ecuación de plasma, el valor predeterminado es 1.0/12.0.
fr: **c_** (float, optionnel) Un paramètre de contrôle pour l'équation du plasma, la valeur par défaut est 1.0/12.0.

source: **None** The function modifies the input `surface_` in place by applying the plasma effect.
es: **Ninguno** La función modifica la superficie de entrada `surface_` in situ aplicando el efecto de plasma.
fr: **Aucune** La fonction modifie directement la surface d'entrée en appliquant l'effet de plasma.

source: Apply plasma effect in place to a surface
es: Aplicar efecto de plasma in situ a una superficie
fr: Appliquer l'effet de plasma directement sur une surface

source: This function generates a dynamic plasma effect on a Pygame surface. The effect evolves over time, producing a fluid, glowing visual pattern. The plasma effect is applied directly to the surface, modifying its pixels in place.
es: Esta función genera un efecto de plasma dinámico en una superficie de Pygame. El efecto evoluciona con el tiempo, produciendo un patrón visual fluido y brillante. El efecto de plasma se aplica directamente a la superficie, modificando sus píxeles in situ.
fr: Cette fonction génère un effet de plasma dynamique sur une surface Pygame. L'effet évolue au fil du temps, produisant un motif visuel fluide et lumineux. L'effet de plasma est appliqué directement à la surface, modifiant ses pixels en place.

source: The function works with both 24-bit and 32-bit surfaces (with or without an alpha channel).
es: La función funciona con superficies de 24 y 32 bits (con o sin canal alfa).
fr: La fonction fonctionne avec des surfaces 24 bits et 32 bits (avec ou sans canal alpha).

source: **surface_** (pygame.Surface) A Pygame surface, compatible with 24-bit or 32-bit formats. The plasma effect is applied directly to this surface, modifying its pixels in place.
es: **surface_** (pygame.Surface) Una superficie de Pygame, compatible con formatos de 24 o 32 bits. El efecto de plasma se aplica directamente a esta superficie, modificando sus píxeles in situ.
fr: **surface_** (pygame.Surface) Une surface Pygame, compatible avec les formats 24 bits ou 32 bits. L'effet de plasma est appliqué directement à cette surface, modifiant ses pixels en place.

source: **frame** (float) The current frame number, which drives the evolution of the plasma effect. This value determines the shifting patterns and animation in the plasma effect.
es: **frame** (float) El número de fotograma actual, que impulsa la evolución del efecto de plasma. Este valor determina los patrones cambiantes y la animación en el efecto de plasma.
fr: **frame** (float) Le numéro du cadre actuel, qui détermine l'évolution de l'effet de plasma. Cette valeur détermine les motifs changeants et l'animation dans l'effet de plasma.

source: **palette_** (numpy.ndarray) A 1D array containing a palette of colors (as unsigned integers) used to generate the plasma effect. The colors are applied cyclically to create the visual effect.
es: **palette_** (numpy.ndarray) Un arreglo 1D que contiene una paleta de colores (como enteros sin signo) utilizados para generar el efecto de plasma. Los colores se aplican cíclicamente para crear el efecto visual.
fr: **palette_** (numpy.ndarray) Un tableau 1D contenant une palette de couleurs (en entiers non signés) utilisées pour générer l'effet de plasma. Les couleurs sont appliquées cycliquement pour créer l'effet visuel.

source: Adjust brightness in place
es: Ajustar el brillo in situ
fr: Ajuster la luminosité en place

source: This function controls the brightness level of a Pygame display or SDL surface. The `shift_` parameter is a float value in the range [-1.0, 1.0], where +1.0 represents the maximum brightness, and 0.0 applies no changes to the surface. Negative values darken the surface.
es: Esta función controla el nivel de brillo de una pantalla de Pygame o una superficie SDL. El parámetro `shift_` es un valor flotante en el rango [-1.0, 1.0], donde +1.0 representa el brillo máximo y 0.0 no aplica cambios a la superficie. Los valores negativos oscurecen la superficie.
fr: Cette fonction contrôle le niveau de luminosité d'un affichage Pygame ou d'une surface SDL. Le paramètre `shift_` est une valeur flottante dans la plage [-1.0, 1.0], où +1.0 représente la luminosité maximale, et 0.0 n'applique aucune modification à la surface. Les valeurs négatives assombrissent la surface.

source: **surface_** (pygame.Surface) A Pygame surface compatible with 24-bit or 32-bit formats (with or without an alpha channel).
es: **surface_** (pygame.Surface) Una superficie de Pygame compatible con formatos de 24 o 32 bits (con o sin canal alfa).
fr: **surface_** (pygame.Surface) Une surface Pygame compatible avec les formats 24 bits ou 32 bits (avec ou sans un canal alpha).

source: **shift_** (float) A float value in the range [-1.0, 1.0], where +1.0 increases brightness, 0.0 keeps the surface unchanged, and negative values decrease brightness.
es: **shift_** (flotante) Un valor flotante en el rango [-1.0, 1.0], donde +1.0 aumenta el brillo, 0.0 mantiene la superficie sin cambios y los valores negativos disminuyen el brillo.
fr: **shift_** (float) Une valeur flottante dans la plage [-1.0, 1.0], où +1.0 augmente la luminosité, 0.0 laisse la surface inchangée, et les valeurs négatives diminuent la luminosité.

source: **None** The function modifies the input `surface_` in place by adjusting its brightness.
es: **Ninguno** La función modifica la entrada `surface_` en su lugar ajustando su brillo.
fr: **Aucun** La fonction modifie `surface_` en place en ajustant sa luminosité.

source: Adjust brightness of a 3D image array in place
es: Ajustar el brillo de un arreglo de imágenes 3D en su lugar
fr: Ajuster la luminosité d'un tableau d'image 3D en place

source: This function adjusts the brightness of an image by modifying its 3D array in place. The array should be of shape (w, h, n) where `n` is typically 3 (RGB) or 4 (RGBA). The `shift` parameter controls the brightness level and must be a float in the range [-1.0, 1.0]. Positive values increase brightness, negative values decrease it, and 0.0 results in no change.
es: Esta función ajusta el brillo de una imagen modificando su arreglo 3D en su lugar. El arreglo debe tener la forma (w, h, n), donde `n` es típicamente 3 (RGB) o 4 (RGBA). El parámetro `shift` controla el nivel de brillo y debe ser un flotante en el rango [-1.0, 1.0]. Los valores positivos aumentan el brillo, los valores negativos lo disminuyen y 0.0 no causa cambios.
fr: Cette fonction ajuste la luminosité d'une image en modifiant son tableau 3D en place. Le tableau doit avoir la forme (w, h, n) où `n` est généralement 3 (RGB) ou 4 (RGBA). Le paramètre `shift` contrôle le niveau de luminosité et doit être une valeur flottante dans la plage [-1.0, 1.0]. Les valeurs positives augmentent la luminosité, les valeurs négatives la diminuent, et 0.0 n'apporte aucun changement.

source: **rgb_array** (numpy.ndarray) A 3D numpy array of shape (w, h, n), where `n` is the number of color channels (3 for RGB or 4 for RGBA). The array should contain uint8 data (0–255 values for each color channel).
es: **rgb_array** (numpy.ndarray) Un arreglo 3D de numpy con la forma (w, h, n), donde `n` es el número de canales de color (3 para RGB o 4 para RGBA). El arreglo debe contener datos uint8 (valores entre 0–255 para cada canal de color).
fr: **rgb_array** (numpy.ndarray) Un tableau 3D numpy de forme (w, h, n), où `n` est le nombre de canaux de couleur (3 pour RGB ou 4 pour RGBA). Le tableau doit contenir des données uint8 (valeurs de 0 à 255 pour chaque canal de couleur).

source: **shift** (float) A float value in the range [-1.0, 1.0] that controls the brightness level. Positive values increase brightness, negative values decrease it, and 0.0 leaves the array unchanged.
es: **shift** (flotante) Un valor flotante en el rango [-1.0, 1.0] que controla el nivel de brillo. Los valores positivos aumentan el brillo, los valores negativos lo disminuyen y 0.0 deja el arreglo sin cambios.
fr: **shift** (float) Une valeur flottante dans la plage [-1.0, 1.0] qui contrôle le niveau de luminosité. Les valeurs positives augmentent la luminosité, les valeurs négatives la diminuent, et 0.0 laisse le tableau inchangé.

source: **None** The function modifies the input `rgb_array` in place by adjusting its brightness.
es: **Ninguno** La función modifica la entrada `rgb_array` en su lugar ajustando su brillo.
fr: **Aucun** La fonction modifie le tableau `rgb_array` en place en ajustant sa luminosité.

source: Control brightness of an image from a C buffer (in place)
es: Controlar el brillo de una imagen desde un búfer C (en su lugar)
fr: Contrôler la luminosité d'une image depuis un tampon C (en place)

source: This function adjusts the brightness of an image based on a 1D array buffer. The buffer should represent the pixel data of the image in either the BGR(A) or RGB(A) format. The brightness is adjusted by a `shift` value, which must be a float in the range [-1.0, 1.0]. The `format_32` parameter indicates whether the buffer is 32-bit (`True` for BGRA) or 24-bit (`False` for BGR).
es: Esta función ajusta el brillo de una imagen basándose en un búfer de arreglo 1D. El búfer debe representar los datos de píxeles de la imagen en formato BGR(A) o RGB(A). El brillo se ajusta mediante un valor `shift`, que debe ser un flotante en el rango [-1.0, 1.0]. El parámetro `format_32` indica si el búfer es de 32 bits (`True` para BGRA) o de 24 bits (`False` para BGR).
fr: Cette fonction ajuste la luminosité d'une image basée sur un tampon de tableau 1D. Le tampon doit représenter les données de pixels de l'image soit en format BGR(A) ou RGB(A). La luminosité est ajustée par une valeur `shift`, qui doit être un float dans la plage [-1.0, 1.0]. Le paramètre `format_32` indique si le tampon est en 32 bits (`True` pour BGRA) ou en 24 bits (`False` pour BGR).

source: **bgr_array** (numpy.ndarray or bytearray) A 1D numpy array or bytearray containing pixel data in BGR(A) or RGB(A) format. The array should contain uint8 data (0–255 values for each color channel).
es: **bgr_array** (numpy.ndarray o bytearray) Un arreglo 1D de numpy o un bytearray que contiene datos de píxeles en formato BGR(A) o RGB(A). El arreglo debe contener datos uint8 (valores entre 0–255 para cada canal de color).
fr: **bgr_array** (numpy.ndarray ou bytearray) Un tableau 1D numpy ou bytearray contenant les données des pixels en format BGR(A) ou RGB(A). Le tableau doit contenir des données uint8 (valeurs de 0 à 255 pour chaque canal de couleur).

source: **format_32** (bool) A boolean indicating whether the buffer is 32-bit (`True` for BGRA) or 24-bit (`False` for BGR).
es: **format_32** (bool) Un valor booleano que indica si el búfer es de 32 bits (`True` para BGRA) o de 24 bits (`False` para BGR).
fr: **format_32** (bool) Un booléen indiquant si le tampon est en 32 bits (`True` pour BGRA) ou en 24 bits (`False` pour BGR).

source: **None** The function modifies the input `bgr_array` in place by adjusting its brightness.
es: **Ninguno** La función modifica la entrada `bgr_array` en su lugar ajustando su brillo.
fr: **Aucun** La fonction modifie le tampon `bgr_array` en place en ajustant sa luminosité.

source: Control brightness of an image (return a copy)
es: Controlar el brillo de una imagen (devuelve una copia)
fr: Contrôler la luminosité d'une image (retourner une copie)

source: This function adjusts the brightness of an image given its C-buffer. The `bgr_array` should be a 1D array containing pixel data in either the BGR or BGRA format. The function returns a new array with the brightness adjusted based on the `shift` value, which must be a float in the range [-1.0, 1.0]. The `format_32` parameter specifies whether the image is 32-bit (BGRA) or 24-bit (BGR).
es: Esta función ajusta el brillo de una imagen dada su C-buffer. El `bgr_array` debe ser un arreglo 1D que contenga datos de píxeles en formato BGR o BGRA. La función devuelve un nuevo arreglo con el brillo ajustado basado en el valor `shift`, que debe ser un flotante en el rango [-1.0, 1.0]. El parámetro `format_32` especifica si la imagen es de 32 bits (BGRA) o de 24 bits (BGR).
fr: Cette fonction ajuste la luminosité d'une image donnée son tampon C. Le `bgr_array` doit être un tableau 1D contenant des données de pixels en format BGR ou BGRA. La fonction retourne un nouveau tableau avec la luminosité ajustée selon la valeur de `shift`, qui doit être un float dans la plage [-1.0, 1.0]. Le paramètre `format_32` spécifie si l'image est en 32 bits (BGRA) ou en 24 bits (BGR).

source: **numpy.ndarray** A new numpy array containing the pixel data with adjusted brightness. The original array is not modified.
es: **numpy.ndarray** Un nuevo arreglo numpy que contiene los datos de píxeles con brillo ajustado. El arreglo original no se modifica.
fr: **numpy.ndarray** Un nouveau tableau numpy contenant les données de pixels avec la luminosité ajustée. Le tableau original n'est pas modifié.

source: Brightness (return a copy)
es: Brillo (devuelve una copia)
fr: Luminosité (retourner une copie)

source: This function applies a brightness transformation to a new SDL surface. The brightness level of the surface is modified based on the `shift` parameter, which is a float in the range [-1.0, 1.0]. A value of +1.0 corresponds to the maximum brightness, while a value of 0.0 will leave the surface unchanged.
es: Esta función aplica una transformación de brillo a una nueva superficie SDL. El nivel de brillo de la superficie se modifica según el parámetro `shift`, que es un flotante en el rango [-1.0, 1.0]. Un valor de +1.0 corresponde al máximo brillo, mientras que un valor de 0.0 dejará la superficie sin cambios.
fr: Cette fonction applique une transformation de luminosité à une nouvelle surface SDL. Le niveau de luminosité de la surface est modifié en fonction du paramètre `shift`, qui est un float dans la plage [-1.0, 1.0]. Une valeur de +1.0 correspond à la luminosité maximale, tandis qu'une valeur de 0.0 laissera la surface inchangée.

source: **surface_** (pygame.Surface) A Pygame surface compatible with either 24-bit or 32-bit formats, with or without an alpha channel.
es: **surface_** (pygame.Surface) Una superficie Pygame compatible con formatos de 24 bits o 32 bits, con o sin canal alfa.
fr: **surface_** (pygame.Surface) Une surface Pygame compatible avec les formats 24 bits ou 32 bits, avec ou sans un canal alpha.

source: **shift** (float) A float value in the range [-1.0, 1.0] that adjusts the brightness of the surface. Positive values increase brightness, negative values decrease it, and 0.0 leaves the surface unchanged.
es: **shift** (flotante) Un valor flotante en el rango [-1.0, 1.0] que ajusta el brillo de la superficie. Los valores positivos aumentan el brillo, los valores negativos lo disminuyen y 0.0 deja la superficie sin cambios.
fr: **shift** (float) Une valeur flottante dans la plage [-1.0, 1.0] qui ajuste la luminosité de la surface. Les valeurs positives augmentent la luminosité, les valeurs négatives la diminuent, et 0.0 laisse la surface inchangée.

source: **pygame.Surface** A new Pygame surface with adjusted brightness, in 24-bit format without an alpha channel.
es: **pygame.Surface** Una nueva superficie Pygame con brillo ajustado, en formato de 24 bits sin canal alfa.
fr: **pygame.Surface** Une nouvelle surface Pygame avec luminosité ajustée, en format 24 bits sans canal alpha.

source: Brightness adjustment with color exclusion (inplace)
es: Ajuste de brillo con exclusión de color (en su lugar)
fr: Ajustement de la luminosité avec exclusion de couleur (en place)

source: This function modifies the brightness of an image, excluding a specific color from the transformation process. The `shift_` parameter controls the brightness level, with +1.0 being the maximum brightness. The color exclusion allows you to avoid affecting specific colors during the transformation.
es: Esta función modifica el brillo de una imagen, excluyendo un color específico del proceso de transformación. El parámetro `shift_` controla el nivel de brillo, siendo +1.0 el brillo máximo. La exclusión de color permite evitar afectar colores específicos durante la transformación.
fr: Cette fonction modifie la luminosité d'une image, excluant une couleur spécifique du processus de transformation. Le paramètre `shift_` contrôle le niveau de luminosité, avec +1.0 correspondant à la luminosité maximale. L'exclusion de couleur permet d'éviter d'affecter des couleurs spécifiques pendant la transformation.

source: **surface_** (pygame.Surface) A Pygame surface compatible with 24-bit or 32-bit formats.
es: **surface_** (pygame.Surface) Una superficie Pygame compatible con formatos de 24 bits o 32 bits.
fr: **surface_** (pygame.Surface) Une surface Pygame compatible avec les formats 24 bits ou 32 bits.

source: **shift_** (float) A float value in the range [-1.0, +1.0] controlling the brightness adjustment. +1.0 corresponds to the maximum brightness, and 0.0 will leave the surface unchanged.
es: **shift_** (flotante) Un valor flotante en el rango [-1.0, +1.0] que controla el ajuste de brillo. +1.0 corresponde al brillo máximo, y 0.0 dejará la superficie sin cambios.
fr: **shift_** (float) Une valeur flottante dans la plage [-1.0, +1.0] contrôlant l'ajustement de la luminosité. +1.0 correspond à la luminosité maximale, et 0.0 laissera la surface inchangée.

source: **color_** (tuple, optional) A tuple of RGB values (e.g., (10, 22, 0)) to exclude from the brightness transformation. Default is (0, 0, 0) for black.
es: **color_** (tupla, opcional) Una tupla de valores RGB (por ejemplo, (10, 22, 0)) para excluir de la transformación de brillo. El valor predeterminado es (0, 0, 0) para negro.
fr: **color_** (tuple, optionnel) Un tuple de valeurs RGB (par exemple, (10, 22, 0)) à exclure de la transformation de luminosité. La valeur par défaut est (0, 0, 0) pour le noir.

source: **None** This function modifies the `surface_` in place, adjusting its brightness while excluding the specified color.
es: **Ninguno** Esta función modifica la `surface_` en su lugar, ajustando su brillo mientras excluye el color especificado.
fr: **Aucun** Cette fonction modifie `surface_` en place, en ajustant sa luminosité tout en excluant la couleur spécifiée.

source: Brightness adjustment with bpf exclusion (inplace) This function adjusts the brightness of an image using a bright pass filter (bpf). Pixels with an RGB sum below the specified `bpf_threshold` are excluded from the transformation. This helps to avoid modifying darker pixels while still adjusting the brightness of others.
es: Ajuste de brillo con exclusión de bpf (en su lugar) Esta función ajusta el brillo de una imagen utilizando un filtro de paso brillante (bpf). Los píxeles con una suma RGB por debajo del `bpf_threshold` especificado son excluidos de la transformación. Esto ayuda a evitar modificar píxeles más oscuros mientras se ajusta el brillo de los demás.
fr: Ajustement de la luminosité avec exclusion du bpf (en place) Cette fonction ajuste la luminosité d'une image en utilisant un filtre passe-lumière (bpf). Les pixels dont la somme RGB est inférieure au `bpf_threshold` spécifié sont exclus de la transformation. Cela permet d'éviter de modifier les pixels plus sombres tout en ajustant la luminosité des autres.

source: The `shift_` parameter controls the brightness level, with +1.0 being the maximum brightness. The function works with both 24-bit and 32-bit images.
es: El parámetro `shift_` controla el nivel de brillo, siendo +1.0 el brillo máximo. La función funciona con imágenes de 24 bits y 32 bits.
fr: Le paramètre `shift_` contrôle le niveau de luminosité, +1.0 correspondant à la luminosité maximale. La fonction fonctionne avec des images en 24 bits et 32 bits.

source: **bpf_threshold** (int, optional) An integer value in the range [0, 255] that determines the threshold for the brightness filter. Pixels with an RGB sum below this threshold will not be modified. Default value is 64.
es: **bpf_threshold** (int, opcional) Un valor entero en el rango [0, 255] que determina el umbral para el filtro de brillo. Los píxeles con una suma RGB por debajo de este umbral no serán modificados. El valor predeterminado es 64.
fr: **bpf_threshold** (int, optionnel) Une valeur entière dans la plage [0, 255] qui détermine le seuil pour le filtre de luminosité. Les pixels dont la somme RGB est inférieure à ce seuil ne seront pas modifiés. La valeur par défaut est 64.

source: **None** This function modifies the `surface_` in place, adjusting its brightness based on the given parameters.
es: **Ninguno** Esta función modifica la `surface_` en su lugar, ajustando su brillo según los parámetros dados.
fr: **None** Cette fonction modifie la `surface_` en place, ajustant sa luminosité en fonction des paramètres donnés.

source: Saturation adjustment (inplace)
es: Ajuste de saturación (en su lugar)
fr: Ajustement de la saturation (en place)

source: This function adjusts the saturation level of a Pygame surface or texture. A positive `shift_` increases the saturation, while a negative value decreases it. The saturation shift is applied in place to the surface, meaning the original surface is modified directly.
es: Esta función ajusta el nivel de saturación de una superficie Pygame o texto. Un `shift_` positivo aumenta la saturación, mientras que un valor negativo la disminuye. El ajuste de saturación se aplica directamente a la superficie, lo que significa que la superficie original se modifica directamente.
fr: Cette fonction ajuste le niveau de saturation d'une surface Pygame ou d'une texture. Un `shift_` positif augmente la saturation, tandis qu'une valeur négative la diminue. Le décalage de saturation est appliqué en place à la surface, ce qui signifie que la surface originale est modifiée directement.
