Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader_gpu.po
Languages: es, fr

source: Applies a color overlay to a specified area in a 24-bit RGB image using GPU acceleration.
es: Aplica una superposición de color a un área específica en una imagen RGB de 24 bits utilizando aceleración por GPU.
fr: Applique une superposition de couleur à une zone spécifiée d'une image RGB 24 bits en utilisant l'accélération GPU.

source: This function modifies the color of a region in the `rgb_array` at coordinates `(x, y)`, blending it with the given `color` based on the `mask_alpha` and `intensity` parameters. It utilizes CuPy for fast GPU-based computation.
es: Esta función modifica el color de una región en el `rgb_array` en las coordenadas `(x, y)`, mezclándolo con el `color` dado según los parámetros `mask_alpha` e `intensity`. Utiliza CuPy para cálculos rápidos basados en GPU.
fr: Cette fonction modifie la couleur d'une région de `rgb_array` aux coordonnées `(x, y)`, en la mélangeant avec la `color` donnée en fonction des paramètres `mask_alpha` et `intensity`. Elle utilise CuPy pour un calcul rapide sur GPU.

source: **x** (*int*): X-coordinate of the target pixel in the image.
es: **x** (*int*): Coordenada X del píxel objetivo en la imagen.
fr: **x** (*int*) : Coordonnée X du pixel cible dans l'image.

source: **y** (*int*): Y-coordinate of the target pixel in the image.
es: **y** (*int*): Coordenada Y del píxel objetivo en la imagen.
fr: **y** (*int*) : Coordonnée Y du pixel cible dans l'image.

source: **rgb_array** (*cupy.ndarray*): A 3D array representing the RGB image stored in GPU memory. Must have a shape of `(height, width, 3)`.
es: **rgb_array** (*cupy.ndarray*): Un array 3D que representa la imagen RGB almacenada en la memoria de la GPU. Debe tener una forma de `(altura, ancho, 3)`.
fr: **rgb_array** (*cupy.ndarray*) : Un tableau 3D représentant l'image RGB stockée en mémoire GPU. Doit avoir une forme `(hauteur, largeur, 3)`.

source: **mask_alpha** (*cupy.ndarray*): Alpha mask determining the transparency effect applied to the color overlay. Must match the shape of `rgb_array`.
es: **mask_alpha** (*cupy.ndarray*): Máscara alfa que determina el efecto de transparencia aplicado a la superposición de color. Debe coincidir con la forma de `rgb_array`.
fr: **mask_alpha** (*cupy.ndarray*) : Masque alpha déterminant l'effet de transparence appliqué à la superposition de couleur. Doit correspondre à la forme de `rgb_array`.

source: **intensity** (*float*, optional, default=`1.0`): Scaling factor for the overlay effect. Determines how strongly the `color` blends with the original image. Must be in the range `[0.0, 1.0]`.
es: **intensity** (*float*, opcional, predeterminado=`1.0`): Factor de escala para el efecto de superposición. Determina cuánto se mezcla el `color` con la imagen original. Debe estar en el rango `[0.0, 1.0]`.
fr: **intensity** (*float*, optionnel, par défaut=`1.0`) : Facteur d'échelle de l'effet de superposition. Détermine à quel point la `color` se mélange avec l'image originale. Doit être dans l'intervalle `[0.0, 1.0]`.

source: **color** (*cupy.ndarray*, optional, default=`[128.0, 128.0, 128.0]`): A 3-element array representing the RGB color to be blended.
es: **color** (*cupy.ndarray*, opcional, predeterminado=`[128.0, 128.0, 128.0]`): Un array de 3 elementos que representa el color RGB a mezclar.
fr: **color** (*cupy.ndarray*, optionnel, par défaut=`[128.0, 128.0, 128.0]`) : Un tableau de 3 éléments représentant la couleur RGB à mélanger.

source: (*tuple*): The modified RGB values at `(x, y)` after applying the effect.
es: (*tuple*): Los valores RGB modificados en `(x, y)` después de aplicar el efecto.
fr: (*tuple*) : Les valeurs RGB modifiées à `(x, y)` après application de l'effet.

source: **ValueError**: If `x` or `y` is out of bounds.
es: **ValueError**: Si `x` o `y` están fuera de los límites.
fr: **ValueError** : Si `x` ou `y` est hors limites.

source: **ValueError**: If `intensity` is not within `[0.0, 1.0]`.
es: **ValueError**: Si `intensity` no está dentro de `[0.0, 1.0]`.
fr: **ValueError** : Si `intensity` n'est pas compris entre `[0.0, 1.0]`.

source: **ValueError**: If `rgb_array` or `mask_alpha` have incompatible shapes.
es: **ValueError**: Si `rgb_array` o `mask_alpha` tienen formas incompatibles.
fr: **ValueError** : Si `rgb_array` ou `mask_alpha` ont des formes incompatibles.

source: The function utilizes GPU acceleration with CuPy for fast image processing.
es: La función utiliza aceleración por GPU con CuPy para un procesamiento rápido de imágenes.
fr: La fonction utilise l'accélération GPU avec CuPy pour un traitement rapide.

source: The color blending effect is based on the alpha mask and intensity, allowing for customizable transparency.
es: El efecto de mezcla de color se basa en la máscara alfa y la intensidad, permitiendo una transparencia personalizable.
fr: L'effet de mélange des couleurs est basé sur le masque alpha et l'intensité, permettant une transparence personnalisable.

source: Adjusts the brightness of a given image using GPU acceleration.
es: Ajusta el brillo de una imagen dada utilizando aceleración por GPU.
fr: Ajuste la luminosité d'une image donnée en utilisant l'accélération GPU.

source: This function modifies the brightness of a `pygame.Surface` by applying a GPU-accelerated transformation. It efficiently processes 24-bit and 32-bit images, leveraging CUDA for parallel computation.
es: Esta función modifica el brillo de un `pygame.Surface` aplicando una transformación acelerada por GPU. Procesa eficientemente imágenes de 24 y 32 bits, aprovechando CUDA para cálculos paralelos.
fr: Cette fonction modifie la luminosité d'un `pygame.Surface` en appliquant une transformation accélérée par GPU. Elle traite efficacement les images 24 bits et 32 bits, en exploitant CUDA pour le calcul parallèle.

source: **surface_** (*pygame.Surface*): The input image to be processed. Must be in 24-bit or 32-bit format.
es: **surface_** (*pygame.Surface*): La imagen de entrada a procesar. Debe estar en formato de 24 o 32 bits.
fr: **surface_** (*pygame.Surface*) : L'image d'entrée à traiter. Doit être au format 24 bits ou 32 bits.

source: **brightness_factor** (*float*): The brightness scaling factor. - Values greater than `1.0` increase brightness. - Values between `0.0` and `1.0` decrease brightness. - `1.0` keeps the original brightness.
es: **brightness_factor** (*float*): Factor de escala de brillo. - Valores mayores que `1.0` aumentan el brillo. - Valores entre `0.0` y `1.0` disminuyen el brillo. - `1.0` mantiene el brillo original.
fr: **brightness_factor** (*float*) : Le facteur d'échelle de luminosité. - Les valeurs supérieures à `1.0` augmentent la luminosité. - Les valeurs entre `0.0` et `1.0` réduisent la luminosité. - `1.0` conserve la luminosité d'origine.

source: **grid_** (*tuple*): Grid dimensions `(grid_y, grid_x)`, e.g., `(25, 25)`. Defines how the image is divided for parallel GPU execution. Must match the texture and array sizes.
es: **grid_** (*tuple*): Dimensiones de la cuadrícula `(grid_y, grid_x)`, por ejemplo, `(25, 25)`. Define cómo se divide la imagen para la ejecución paralela en la GPU. Debe coincidir con los tamaños de la textura y el array.
fr: **grid_** (*tuple*) : Dimensions de la grille `(grid_y, grid_x)`, par ex., `(25, 25)`. Définit comment l'image est divisée pour l'exécution parallèle sur le GPU. Doit correspondre aux tailles de la texture et du tableau.

source: **block_** (*tuple*): Block dimensions `(block_y, block_x)`, e.g., `(32, 32)`. Determines the number of threads per block for CUDA execution. The product `block_x * block_y` must not exceed `1024` (CUDA's max thread limit per block).
es: **block_** (*tuple*): Dimensiones del bloque `(block_y, block_x)`, por ejemplo, `(32, 32)`. Determina el número de hilos por bloque para la ejecución en CUDA. El producto `block_x * block_y` no debe exceder `1024` (límite máximo de hilos por bloque en CUDA).
fr: **block_** (*tuple*) : Dimensions du bloc `(block_y, block_x)`, par ex., `(32, 32)`. Détermine le nombre de threads par bloc pour l'exécution CUDA. Le produit `block_x * block_y` ne doit pas dépasser `1024` (la limite maximale de threads par bloc en CUDA).

source: (*pygame.Surface*): A new surface with modified brightness in 24-bit format.
es: (*pygame.Surface*): Una nueva superficie con el brillo modificado en formato de 24 bits.
fr: (*pygame.Surface*) : Une nouvelle surface avec une luminosité modifiée au format 24 bits.

source: **TypeError**: If `surface_` is not of type `pygame.Surface`.
es: **TypeError**: Si `surface_` no es de tipo `pygame.Surface`.
fr: **TypeError** : Si `surface_` n'est pas de type `pygame.Surface`.

source: **ValueError**: If `brightness_factor` is negative.
es: **ValueError**: Si `brightness_factor` es negativo.
fr: **ValueError** : Si `brightness_factor` est négatif.

source: The function leverages GPU acceleration to efficiently process the image, making it suitable for large images or real-time applications.
es: La función aprovecha la aceleración por GPU para procesar la imagen de manera eficiente, haciéndola adecuada para imágenes grandes o aplicaciones en tiempo real.
fr: La fonction exploite l'accélération GPU pour traiter efficacement l'image, ce qui la rend adaptée aux grandes images ou aux applications en temps réel.

source: Applies HSL (Hue, Saturation, Lightness) rotation to an image using GPU acceleration.
es: Aplica una rotación HSL (Tono, Saturación, Luminosidad) a una imagen utilizando aceleración por GPU.
fr: Applique une rotation HSL (Teinte, Saturation, Luminosité) à une image en utilisant l'accélération GPU.

source: This function rotates the color of the pixels in an image or texture represented by a `pygame.Surface` by modifying the hue component of the HSL color model. It supports both 24-bit and 32-bit image formats.
es: Esta función rota el color de los píxeles en una imagen o textura representada por un `pygame.Surface` modificando el componente de tono del modelo de color HSL. Soporta formatos de imagen de 24 y 32 bits.
fr: Cette fonction modifie la couleur des pixels d'une image ou texture représentée par un `pygame.Surface` en ajustant la composante teinte du modèle de couleur HSL. Elle prend en charge les formats d'image 24 bits et 32 bits.

source: **val_** (*float*): A float representing the hue rotation value. The hue is adjusted by rotating its value in the HSL color space.
es: **val_** (*float*): Un valor flotante que representa el valor de rotación del tono. El tono se ajusta rotando su valor en el espacio de color HSL.
fr: **val_** (*float*) : Une valeur flottante représentant la rotation de la teinte. La teinte est ajustée en modifiant sa valeur dans l'espace colorimétrique HSL.

source: **grid_** (*tuple*, optional): Grid dimensions `(grid_y, grid_x)`, e.g., `(25, 25)`. Defines how the image is divided for parallel GPU execution. The grid and block dimensions must match the texture and array sizes.
es: **grid_** (*tuple*, opcional): Dimensiones de la cuadrícula `(grid_y, grid_x)`, por ejemplo, `(25, 25)`. Define cómo se divide la imagen para la ejecución paralela en la GPU. Las dimensiones de la cuadrícula y el bloque deben coincidir con los tamaños de la textura y el array.
fr: **grid_** (*tuple*, optionnel) : Dimensions de la grille `(grid_y, grid_x)`, par ex., `(25, 25)`. Définit comment l'image est divisée pour l'exécution parallèle sur le GPU. Les dimensions de la grille et du bloc doivent correspondre aux tailles de la texture et du tableau.

source: **block_** (*tuple*, optional): Block dimensions `(block_y, block_x)`, e.g., `(32, 32)`. Specifies the number of threads per block for CUDA execution. The maximum number of threads per block is 1024, so `block_x * block_y` should not exceed this limit.
es: **block_** (*tuple*, opcional): Dimensiones del bloque `(block_y, block_x)`, por ejemplo, `(32, 32)`. Especifica el número de hilos por bloque para la ejecución en CUDA. El número máximo de hilos por bloque es 1024, por lo que `block_x * block_y` no debe exceder este límite.
fr: **block_** (*tuple*, optionnel) : Dimensions du bloc `(block_y, block_x)`, par ex., `(32, 32)`. Spécifie le nombre de threads par bloc pour l'exécution CUDA. Le nombre maximal de threads par bloc est de 1024, donc `block_x * block_y` ne doit pas dépasser cette limite.

source: (*pygame.Surface*): A new `pygame.Surface` with the modified hue based on the given rotation value.
es: (*pygame.Surface*): Un nuevo `pygame.Surface` con el tono modificado según el valor de rotación dado.
fr: (*pygame.Surface*) : Un nouveau `pygame.Surface` avec la teinte modifiée en fonction de la valeur de rotation donnée.

source: This function applies a GPU-accelerated operation to rotate the hue component of the image, enabling efficient processing for large images or real-time applications.
es: Esta función aplica una operación acelerada por GPU para rotar el componente de tono de la imagen, permitiendo un procesamiento eficiente para imágenes grandes o aplicaciones en tiempo real.
fr: Cette fonction applique une opération accélérée par GPU pour modifier la teinte d'une image, permettant un traitement efficace des grandes images ou des applications en temps réel.

source: The `grid_` and `block_` parameters are optional but must be provided for parallel processing to work optimally on the GPU.
es: Los parámetros `grid_` y `block_` son opcionales, pero deben proporcionarse para que el procesamiento paralelo funcione de manera óptima en la GPU.
fr: Les paramètres `grid_` et `block_` sont optionnels mais doivent être fournis pour que le traitement parallèle fonctionne de manière optimale sur le GPU.

source: Applies a dithering effect to an image using GPU acceleration.
es: Aplica un efecto de difuminado a una imagen utilizando aceleración por GPU.
fr: Applique un effet de dithering à une image en utilisant l'accélération GPU.

source: This function applies a dithering effect to an RGB image using a CUDA kernel. The operation is performed on the GPU for fast processing. The image is first normalized, processed using the dithering kernel, and then converted back to 8-bit format.
es: Esta función aplica un efecto de difuminado a una imagen RGB utilizando un núcleo CUDA. La operación se realiza en la GPU para un procesamiento rápido. La imagen se normaliza primero, se procesa utilizando el núcleo de difuminado y luego se convierte de nuevo a formato de 8 bits.
fr: Cette fonction applique un effet de dithering à une image RGB en utilisant un noyau CUDA. L'opération est effectuée sur le GPU pour un traitement rapide. L'image est d'abord normalisée, traitée avec le noyau de dithering, puis convertie au format 8 bits.

source: **gpu_array_** (*cupy.ndarray*): A CuPy array of shape `(w, h, 3)` containing the image data in RGB format. Must be of dtype `cupy.uint8`.
es: **gpu_array_** (*cupy.ndarray*): Un array de CuPy con forma `(w, h, 3)` que contiene los datos de la imagen en formato RGB. Debe ser de tipo `cupy.uint8`.
fr: **gpu_array_** (*cupy.ndarray*) : Un tableau CuPy de forme `(w, h, 3)` contenant les données d'image en format RGB. Doit être de type `cupy.uint8`.

source: **grid_** (*tuple*): CUDA grid dimensions `(grid_y, grid_x)`. Defines how the computation is distributed across the GPU.
es: **grid_** (*tuple*): Dimensiones de la cuadrícula CUDA `(grid_y, grid_x)`. Define cómo se distribuye el cálculo en la GPU.
fr: **grid_** (*tuple*) : Dimensions de la grille CUDA `(grid_y, grid_x)`. Définit comment le calcul est distribué sur le GPU.

source: **block_** (*tuple*): CUDA block dimensions `(block_y, block_x)`. The number of threads per block should not exceed 1024.
es: **block_** (*tuple*): Dimensiones del bloque CUDA `(block_y, block_x)`. El número de hilos por bloque no debe exceder 1024.
fr: **block_** (*tuple*) : Dimensions du bloc CUDA `(block_y, block_x)`. Le nombre de threads par bloc ne doit pas dépasser 1024.

source: **factor_** (*float*, optional, default=`1.0`): A factor controlling the dithering intensity. A higher value increases the dithering effect.
es: **factor_** (*float*, opcional, predeterminado=`1.0`): Un factor que controla la intensidad del difuminado. Un valor mayor aumenta el efecto de difuminado.
fr: **factor_** (*float*, optionnel, par défaut=`1.0`) : Un facteur contrôlant l'intensité du dithering. Une valeur plus élevée accentue l'effet.

source: (*pygame.Surface*): A new `pygame.Surface` containing the processed image in RGB format.
es: (*pygame.Surface*): Un nuevo `pygame.Surface` que contiene la imagen procesada en formato RGB.
fr: (*pygame.Surface*) : Un nouveau `pygame.Surface` contenant l'image traitée en format RGB.

source: **TypeError**: If `gpu_array_` is not a CuPy ndarray.
es: **TypeError**: Si `gpu_array_` no es un ndarray de CuPy.
fr: **TypeError** : Si `gpu_array_` n'est pas un tableau CuPy.

source: **ValueError**: If `gpu_array_` is not of dtype `cupy.uint8`.
es: **ValueError**: Si `gpu_array_` no es de tipo `cupy.uint8`.
fr: **ValueError** : Si `gpu_array_` n'est pas de type `cupy.uint8`.

source: The function uses a CUDA kernel (`dithering_kernel`) for high-performance processing.
es: La función utiliza un núcleo CUDA (`dithering_kernel`) para un procesamiento de alto rendimiento.
fr: La fonction utilise un noyau CUDA (`dithering_kernel`) pour un traitement haute performance.

source: The input image is normalized to [0, 1] before processing and then converted back to [0, 255].
es: La imagen de entrada se normaliza a [0, 1] antes del procesamiento y luego se convierte de nuevo a [0, 255].
fr: L'image d'entrée est normalisée entre [0, 1] avant traitement, puis convertie en [0, 255].

source: The grid and block sizes must be chosen appropriately based on the image dimensions and GPU resources.
es: Los tamaños de la cuadrícula y el bloque deben elegirse adecuadamente según las dimensiones de la imagen y los recursos de la GPU.
fr: Les tailles de grille et de bloc doivent être choisies en fonction des dimensions de l'image et des ressources du GPU.

source: Applies a fisheye lens effect to a pygame.Surface using GPU acceleration.
es: Aplica un efecto de lente ojo de pez a un `pygame.Surface` utilizando aceleración por GPU.
fr: Applique un effet de lentille fisheye à un `pygame.Surface` en utilisant l'accélération GPU.

source: This function applies a fisheye distortion effect to a given surface using CUDA-based processing. It is optimized for real-time rendering and can be used to display game scenes through a lens effect.
es: Esta función aplica un efecto de distorsión ojo de pez a una superficie dada utilizando procesamiento basado en CUDA. Está optimizada para renderizado en tiempo real y puede usarse para mostrar escenas de juegos a través de un efecto de lente.
fr: Cette fonction applique un effet de distorsion fisheye à une surface donnée en utilisant un traitement basé sur CUDA. Elle est optimisée pour le rendu en temps réel et peut être utilisée pour afficher des scènes de jeu avec un effet de lentille.

source: **surface_** (*pygame.Surface*): Input pygame surface in 24-bit or 32-bit format.
es: **surface_** (*pygame.Surface*): Superficie de pygame de entrada en formato de 24 o 32 bits.
fr: **surface_** (*pygame.Surface*) : Surface pygame en entrée au format 24 bits ou 32 bits.

source: **focal** (*float*): Focal length of the fisheye effect, controlling the strength of the distortion.
es: **focal** (*float*): Longitud focal del efecto ojo de pez, controlando la intensidad de la distorsión.
fr: **focal** (*float*) : Longueur focale de l'effet fisheye, contrôlant l'intensité de la distorsion.

source: **focal_texture** (*float*): Texture focal length, further adjusting the fisheye intensity.
es: **focal_texture** (*float*): Longitud focal de la textura, ajustando aún más la intensidad del efecto ojo de pez.
fr: **focal_texture** (*float*) : Longueur focale de la texture, ajustant davantage l'intensité de l'effet fisheye.

source: **grid_** (*tuple*): CUDA grid dimensions `(grid_y, grid_x)`. Defines how computation is distributed across the GPU.
es: **grid_** (*tuple*): Dimensiones de la cuadrícula CUDA `(grid_y, grid_x)`. Define cómo se distribuye el cálculo en la GPU.
fr: **grid_** (*tuple*) : Dimensions de la grille CUDA `(grid_y, grid_x)`. Définit comment le calcul est distribué sur le GPU.

source: **block_** (*tuple*): CUDA block dimensions `(block_y, block_x)`. The maximum number of threads per block should not exceed 1024.
es: **block_** (*tuple*): Dimensiones del bloque CUDA `(block_y, block_x)`. El número máximo de hilos por bloque no debe exceder 1024.
fr: **block_** (*tuple*) : Dimensions du bloc CUDA `(block_y, block_x)`. Le nombre maximum de threads par bloc ne doit pas dépasser 1024.

source: (*pygame.Surface*): A new `pygame.Surface` with the applied fisheye lens effect.
es: (*pygame.Surface*): Un nuevo `pygame.Surface` con el efecto de lente ojo de pez aplicado.
fr: (*pygame.Surface*) : Un nouveau `pygame.Surface` avec l'effet de lentille fisheye appliqué.

source: **TypeError**: If `surface_` is not a `pygame.Surface` instance.
es: **TypeError**: Si `surface_` no es una instancia de `pygame.Surface`.
fr: **TypeError** : Si `surface_` n'est pas une instance de `pygame.Surface`.

source: **ValueError**: If the function cannot access the pixel data of `surface_`.
es: **ValueError**: Si la función no puede acceder a los datos de píxeles de `surface_`.
fr: **ValueError** : Si la fonction ne peut pas accéder aux données des pixels de `surface_`.

source: This function leverages CUDA for high-performance image processing.
es: Esta función aprovecha CUDA para un procesamiento de imágenes de alto rendimiento.
fr: Cette fonction exploite CUDA pour un traitement d'image haute performance.

source: The effect is applied directly to the input surface and returned as a transformed surface.
es: El efecto se aplica directamente a la superficie de entrada y se devuelve como una superficie transformada.
fr: L'effet est appliqué directement à la surface en entrée et retourné sous forme de surface transformée.

source: Ensure that the grid and block values are chosen to match the texture and array sizes for optimal performance.
es: Asegúrese de que los valores de la cuadrícula y el bloque se elijan para que coincidan con los tamaños de la textura y el array para un rendimiento óptimo.
fr: Assurez-vous que les valeurs de grille et de bloc sont choisies de manière à correspondre aux tailles de texture et de tableau pour des performances optimales.

source: Applies a swirl distortion effect to an image using GPU acceleration.
es: Aplica un efecto de distorsión de remolino a una imagen utilizando aceleración por GPU.
fr: Applique un effet de distorsion en spirale à une image en utilisant l'accélération GPU.

source: This function creates a swirl effect on a given `pygame.Surface` by applying a CUDA-based transformation. The effect distorts pixels radially around a specified center point.
es: Esta función crea un efecto de remolino en un `pygame.Surface` dado aplicando una transformación basada en CUDA. El efecto distorsiona los píxeles radialmente alrededor de un punto central especificado.
fr: Cette fonction crée un effet de spirale sur un `pygame.Surface` donné en appliquant une transformation basée sur CUDA. L'effet déforme les pixels de manière radiale autour d'un point central spécifié.

source: **surface_** (*pygame.Surface*): Input surface, must be in 24-bit or 32-bit format.
es: **surface_** (*pygame.Surface*): Superficie de entrada, debe estar en formato de 24 o 32 bits.
fr: **surface_** (*pygame.Surface*) : Surface en entrée, doit être au format 24 bits ou 32 bits.
