Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader_gpu.po
Languages: es, fr

source: 1. GPU-Accelerated Image Processing Library
es: 1. Biblioteca de Procesamiento de Imágenes Acelerada por GPU
fr: 1. Bibliothèque de traitement d'images accélérée par GPU

source: This library provides GPU-accelerated image processing functionality leveraging **CUDA** (via **CuPy**) to efficiently perform various image transformations and filters on **NVIDIA GPUs**. Its main purpose is to speed up computationally expensive image processing operations that would otherwise be slow on a CPU.
es: Esta biblioteca proporciona funcionalidad de procesamiento de imágenes acelerada por GPU utilizando **CUDA** (a través de **CuPy**) para realizar eficientemente diversas transformaciones y filtros de imágenes en **GPUs NVIDIA**. Su propósito principal es acelerar operaciones de procesamiento de imágenes computacionalmente costosas que de otro modo serían lentas en una CPU.
fr: Cette bibliothèque offre des fonctionnalités de traitement d'images accélérées par GPU en exploitant **CUDA** (via **CuPy**) pour exécuter efficacement diverses transformations et filtres d'images sur les **GPU NVIDIA**. Son objectif principal est d'accélérer les opérations de traitement d'images coûteuses en calcul, qui seraient autrement lentes sur un CPU.

source: 2. Key Features & Use Cases
es: 2. Características Clave y Casos de Uso
fr: 2. Principales fonctionnalités et cas d'utilisation

source: **GPU Memory & Hardware Information** Retrieve details about the available GPU memory, PCI bus ID, and compute capability. **Use Case**: Useful for dynamically managing memory allocation and optimizing parallel processing tasks.
es: **Memoria GPU e Información de Hardware**: Recupera detalles sobre la memoria GPU disponible, el ID del bus PCI y la capacidad de cálculo. **Caso de Uso**: Útil para gestionar dinámicamente la asignación de memoria y optimizar tareas de procesamiento en paralelo.
fr: **Mémoire GPU et informations matérielles** Récupérer des détails sur la mémoire GPU disponible, l'identifiant du bus PCI et la capacité de calcul. **Cas d'utilisation** : Utile pour gérer dynamiquement l'allocation de mémoire et optimiser les tâches de traitement parallèle.

source: **Image Processing & Filters**
es: **Procesamiento de Imágenes y Filtros**
fr: **Traitement d'images et filtres**

source: Perform common image filters efficiently on the GPU, including:
es: Realiza filtros de imagen comunes de manera eficiente en la GPU, incluyendo:
fr: Exécuter efficacement des filtres d'image courants sur le GPU, notamment :

source: **Inversion**: :func:`invert_gpu`
es: **Inversión**: :func:`invert_gpu`

source: **Grayscale & Sepia**: :func:`grayscale_gpu`, :func:`sepia_gpu`
es: **Escala de Grises y Sepia**: :func:`grayscale_gpu`, :func:`sepia_gpu`
fr: **Niveaux de gris et sépia** : :func:`grayscale_gpu`, :func:`sepia_gpu`

source: **Edge Detection**: Sobel, Prewitt, Canny
es: **Detección de Bordes**: Sobel, Prewitt, Canny
fr: **Détection des contours** : Sobel, Prewitt, Canny

source: **Blur & Smoothing Filters**: Gaussian, Median, Bilateral
es: **Filtros de Desenfoque y Suavizado**: Gaussiano, Mediana, Bilateral
fr: **Filtres de flou et de lissage** : Gaussien, Médian, Bilatéral

source: **Embossing & Sharpening**
es: **Relieve y Enfoque**
fr: **Relief et netteté**

source: 3. Use Case
es: 3. Caso de Uso
fr: 3. Cas d'utilisation

source: Optimized for real-time video and image processing by executing these operations in parallel on the GPU.
es: Optimizado para el procesamiento de video e imágenes en tiempo real ejecutando estas operaciones en paralelo en la GPU.
fr: Optimisé pour le traitement en temps réel de vidéos et d'images en exécutant ces opérations en parallèle sur le GPU.

source: **Color Manipulation & Enhancements** Adjust image properties such as brightness, contrast, saturation, and HSL/HSV values.
es: **Manipulación y Mejoras de Color**: Ajusta propiedades de la imagen como brillo, contraste, saturación y valores HSL/HSV.
fr: **Manipulation et amélioration des couleurs** Ajuster les propriétés de l'image telles que la luminosité, le contraste, la saturation et les valeurs HSL/HSV.

source: **Use Case**: Ideal for image enhancement, augmented reality (AR) applications, and photo editing software.
es: **Caso de Uso**: Ideal para mejora de imágenes, aplicaciones de realidad aumentada (AR) y software de edición de fotos.
fr: **Cas d'utilisation** : Idéal pour l'amélioration des images, les applications de réalité augmentée (AR) et les logiciels de retouche photo.

source: **Special Effects & Transformations** Apply artistic transformations and effects, including:
es: **Efectos Especiales y Transformaciones**: Aplica transformaciones y efectos artísticos, incluyendo:
fr: **Effets spéciaux et transformations** Appliquer des transformations et effets artistiques, notamment :

source: **Swirl, Fisheye, Wave, Ripple Effects**
es: **Efectos de Remolino, Ojo de Pez, Onda y Ondulación**
fr: **Effets tourbillon, fisheye, onde, ondulation**

source: **Chromatic Aberration & RGB Splitting**
es: **Aberración Cromática y División RGB**
fr: **Aberration chromatique et séparation des canaux RGB**

source: **Cartoon Effect & Bloom Filters**
es: **Efecto de Dibujo Animado y Filtros Bloom**
fr: **Effet bande dessinée et filtres d'éclat (bloom)**

source: **Dithering & Heatmap Effects**
es: **Efectos de Difuminado y Mapas de Calor**
fr: **Effets de tramage et de carte thermique**

source: **Use Case**: Useful for game development, VFX, and computer graphics applications.
es: **Caso de Uso**: Útil para desarrollo de juegos, efectos visuales (VFX) y aplicaciones de gráficos por computadora.
fr: **Cas d'utilisation** : Utile pour le développement de jeux, les effets visuels (VFX) et les applications en infographie.

source: **Geometric Transformations** Support for geometric transformations such as:
es: **Transformaciones Geométricas**: Soporte para transformaciones geométricas como:
fr: **Transformations géométriques** Prise en charge des transformations géométriques telles que :

source: **Mirroring**
es: **Reflejo**
fr: **Miroir**

source: **Zooming**
es: **Zoom**
fr: **Zoom**

source: **Downscaling**
es: **Reducción de Escala**
fr: **Réduction d’échelle**

source: **Blending**
es: **Mezcla**
fr: **Fusion**

source: **Use Case**: Can be used for image compression, texture mapping, and real-time rendering.
es: **Caso de Uso**: Puede usarse para compresión de imágenes, mapeo de texturas y renderizado en tiempo real.
fr: **Cas d'utilisation** : Peut être utilisé pour la compression d'images, le mappage de textures et le rendu en temps réel.

source: **Real-Time Video Processing** Real-time video effects are supported by functions such as :func:`ripple_effect_gpu()`, :func:`predator_gpu()`, and :func:`heatmap_gpu()`.
es: **Procesamiento de Video en Tiempo Real**: Los efectos de video en tiempo real son soportados por funciones como :func:`ripple_effect_gpu()`, :func:`predator_gpu()` y :func:`heatmap_gpu()`.
fr: **Traitement vidéo en temps réel** Les effets vidéo en temps réel sont pris en charge par des fonctions telles que :func:`ripple_effect_gpu()`, :func:`predator_gpu()`, et :func:`heatmap_gpu()`.

source: **Use Case**: Ideal for integration into streaming software, video filters, or surveillance systems.
es: **Caso de Uso**: Ideal para integración en software de transmisión, filtros de video o sistemas de vigilancia.
fr: **Cas d'utilisation** : Idéal pour une intégration dans des logiciels de streaming, des filtres vidéo ou des systèmes de surveillance.

source: 4. Potential Applications
es: 4. Aplicaciones Potenciales
fr: 4. Applications potentielles

source: **Real-time Image & Video Processing**: Enhance camera feeds in real-time.
es: **Procesamiento de Imágenes y Video en Tiempo Real**: Mejora las transmisiones de cámara en tiempo real.
fr: **Traitement d'images et de vidéos en temps réel** : Améliorer les flux vidéo en temps réel.

source: **Computer Vision & AI Preprocessing**: Apply fast filters before passing images to ML models.
es: **Visión por Computadora y Preprocesamiento para IA**: Aplica filtros rápidos antes de pasar imágenes a modelos de aprendizaje automático.
fr: **Vision par ordinateur et prétraitement pour l'IA** : Appliquer des filtres rapides avant de transmettre les images aux modèles d'apprentissage automatique.

source: **Game Development & Graphics**: Add special effects for gaming & simulation environments.
es: **Desarrollo de Juegos y Gráficos**: Añade efectos especiales para entornos de juegos y simulaciones.
fr: **Développement de jeux et graphismes** : Ajouter des effets spéciaux pour les jeux et les environnements de simulation.

source: **Augmented & Virtual Reality (AR/VR)**: Optimize visuals for immersive experiences.
es: **Realidad Aumentada y Virtual (AR/VR)**: Optimiza los gráficos para experiencias inmersivas.
fr: **Réalité augmentée et virtuelle (AR/VR)** : Optimiser les visuels pour des expériences immersives.

source: **High-performance Photography Tools**: Edit large images efficiently using the GPU.
es: **Herramientas de Fotografía de Alto Rendimiento**: Edita imágenes grandes de manera eficiente utilizando la GPU.
fr: **Outils de photographie haute performance** : Modifier de grandes images efficacement grâce au GPU.

source: 5. Summary
es: 5. Resumen
fr: 5. Résumé

source: This library offloads complex image processing tasks from the CPU to the GPU, making operations significantly faster and more efficient. It is ideal for applications that require real-time performance, such as games, AR/VR, video streaming, and AI-based image processing.
es: Esta biblioteca descarga tareas complejas de procesamiento de imágenes de la CPU a la GPU, haciendo que las operaciones sean significativamente más rápidas y eficientes. Es ideal para aplicaciones que requieren rendimiento en tiempo real, como juegos, AR/VR, transmisión de video y procesamiento de imágenes basado en IA.
fr: Cette bibliothèque décharge les tâches complexes de traitement d'images du CPU vers le GPU, rendant les opérations beaucoup plus rapides et efficaces. Elle est idéale pour les applications nécessitant des performances en temps réel, telles que les jeux, l'AR/VR, le streaming vidéo et le traitement d'images basé sur l'IA.

source: 6. Cython list methods
es: 6. Métodos de listas en Cython
fr: 6. Méthodes de liste en Cython

source: Retrieve the available free memory on the GPU.
es: Recupera la memoria libre disponible en la GPU.
fr: Récupérer la mémoire libre disponible sur le GPU.

source: This function queries the GPU device for its current free memory and returns the amount in bytes. It is useful for monitoring memory usage when working with GPU-accelerated computations, ensuring that operations do not exceed available memory.
es: Esta función consulta el dispositivo GPU para obtener su memoria libre actual y devuelve la cantidad en bytes. Es útil para monitorear el uso de memoria cuando se trabaja con cálculos acelerados por GPU, asegurando que las operaciones no excedan la memoria disponible.
fr: Cette fonction interroge le GPU pour connaître la mémoire actuellement disponible et retourne la quantité en octets. Elle est utile pour surveiller l'utilisation de la mémoire lors de calculs accélérés par GPU, garantissant que les opérations ne dépassent pas la mémoire disponible.

source: **Returns:**
es: **Devuelve:**
fr: **Retourne :**

source: **int**: The amount of free GPU memory in bytes.
es: **int**: La cantidad de memoria libre en la GPU en bytes.
fr: **int** : La quantité de mémoire libre du GPU en octets.

source: **Example Usage:**
es: **Ejemplo de Uso:**
fr: **Exemple d'utilisation :**

source: Retrieve the total memory capacity of the GPU.
es: Recupera la capacidad total de memoria de la GPU.
fr: Récupérer la capacité mémoire totale du GPU.

source: This function queries the GPU device to determine its total available memory, representing the total VRAM capacity of the GPU.
es: Esta función consulta el dispositivo GPU para determinar su memoria total disponible, representando la capacidad total de VRAM de la GPU.
fr: Cette fonction interroge le GPU pour déterminer sa mémoire totale disponible, ce qui représente la capacité totale de la VRAM du GPU.

source: **int**: The total GPU memory in bytes.
es: **int**: La memoria total de la GPU en bytes.
fr: **int** : La mémoire totale du GPU en octets.

source: Retrieve the PCI Bus ID of the GPU.
es: Recupera el ID del bus PCI de la GPU.
fr: Récupérer l'identifiant du bus PCI du GPU.

source: This function queries the GPU device and returns its PCI Bus ID, which uniquely identifies the GPU within the system. The PCI Bus ID is useful for multi-GPU setups, debugging, and device management.
es: Esta función consulta el dispositivo GPU y devuelve su ID de bus PCI, que identifica de manera única la GPU dentro del sistema. El ID de bus PCI es útil para configuraciones multi-GPU, depuración y gestión de dispositivos.
fr: Cette fonction interroge le GPU et retourne son identifiant de bus PCI, qui permet d’identifier de manière unique le GPU dans le système. L’identifiant PCI est utile pour les configurations multi-GPU, le débogage et la gestion des périphériques.

source: **str**: The PCI Bus ID of the GPU in the format "Domain:Bus:Device.Function" (e.g., "0000:01:00.0").
es: **str**: El ID de bus PCI de la GPU en el formato "Dominio:Bus:Dispositivo.Función" (por ejemplo, "0000:01:00.0").
fr: **str** : L'identifiant du bus PCI du GPU au format "Domaine:Bus:Périphérique.Fonction" (ex. : "0000:01:00.0").

source: Retrieve the compute capability of the GPU.
es: Recupera la capacidad de cálculo de la GPU.
fr: Récupérer la capacité de calcul du GPU.

source: Compute capability represents the GPU architecture version and determines its compatibility with various CUDA features. Higher compute capability values indicate support for more advanced features and optimizations.
es: La capacidad de cálculo representa la versión de la arquitectura de la GPU y determina su compatibilidad con varias características de CUDA. Valores más altos de capacidad de cálculo indican soporte para características y optimizaciones más avanzadas.
fr: La capacité de calcul représente la version de l’architecture du GPU et détermine sa compatibilité avec différentes fonctionnalités CUDA. Des valeurs plus élevées indiquent la prise en charge de fonctionnalités et d’optimisations plus avancées.

source: **str**: The compute capability of the GPU as a string in the format "major.minor" (e.g., "7.5" for NVIDIA Turing GPUs).
es: **str**: La capacidad de cálculo de la GPU como una cadena en el formato "major.minor" (por ejemplo, "7.5" para GPUs NVIDIA Turing).
fr: **str** : La capacité de calcul du GPU sous forme de chaîne de caractères au format "majeur.mineur" (ex. : "7.5" pour les GPU NVIDIA Turing).

source: Retrieve the maximum number of grid blocks per multiprocessor.
es: Recupera el número máximo de bloques de cuadrícula por multiprocesador.
fr: Récupérer le nombre maximal de blocs de grille par multiprocesseur.

source: This function returns the maximum number of grid blocks that can be active per multiprocessor on the GPU. This value is essential for optimizing parallel workloads and ensuring efficient resource utilization.
es: Esta función devuelve el número máximo de bloques de cuadrícula que pueden estar activos por multiprocesador en la GPU. Este valor es esencial para optimizar cargas de trabajo en paralelo y garantizar un uso eficiente de los recursos.
fr: Cette fonction retourne le nombre maximal de blocs de grille pouvant être actifs par multiprocesseur sur le GPU. Cette valeur est essentielle pour optimiser les charges de travail parallèles et garantir une utilisation efficace des ressources.

source: **unsigned int**: The maximum number of grid blocks per multiprocessor.
es: **unsigned int**: El número máximo de bloques de cuadrícula por multiprocesador.
fr: **unsigned int** : Le nombre maximal de blocs de grille par multiprocesseur.

source: **Notes:**
es: **Notas:**
fr: **Remarques :**

source: The returned value depends on the GPU's compute capability.
es: El valor devuelto depende de la capacidad de cálculo de la GPU.
fr: La valeur retournée dépend de la capacité de calcul du GPU.

source: For instance, GPUs with Compute Capability 2.x support up to 8 active blocks per multiprocessor, while Compute Capability 3.x and higher can support up to 16 or more active blocks per multiprocessor. Refer to NVIDIA's CUDA programming guide for specific values per architecture.
es: Por ejemplo, las GPUs con Capacidad de Cálculo 2.x admiten hasta 8 bloques activos por multiprocesador, mientras que las GPUs con Capacidad de Cálculo 3.x y superior pueden admitir hasta 16 o más bloques activos por multiprocesador. Consulte la guía de programación de CUDA de NVIDIA para obtener valores específicos por arquitectura.

source: Automatically computes optimal grid and block sizes for GPU execution.
es: Calcula automáticamente los tamaños óptimos de cuadrícula y bloque para la ejecución en GPU.

source: This function determines the best grid and block configuration for GPU execution based on the dimensions of the display (or computational domain). It ensures that the computed grid and block sizes are valid and compatible with the given width (`w`) and height (`h`).
es: Esta función determina la mejor configuración de cuadrícula y bloque para la ejecución en GPU basándose en las dimensiones de la pantalla (o dominio computacional). Asegura que los tamaños de cuadrícula y bloque calculados sean válidos y compatibles con el ancho (`w`) y la altura (`h`) dados.

source: **Parameters:**
es: **Parámetros:**

source: **w** (*int*): The width of the display or computational domain. Must be greater than 0.
es: **w** (*int*): El ancho de la pantalla o dominio computacional. Debe ser mayor que 0.

source: **h** (*int*): The height of the display or computational domain. Must be greater than 0.
es: **h** (*int*): La altura de la pantalla o dominio computacional. Debe ser mayor que 0.

source: **tuple**: A tuple containing: - `grid`: (*y, x*) - The computed grid size (number of blocks in each dimension). - `block`: (*yy, xx*) - The computed block size (number of threads per block in each dimension).
es: **tuple**: Una tupla que contiene: - `grid`: (*y, x*) - El tamaño de la cuadrícula calculada (número de bloques en cada dimensión). - `block`: (*yy, xx*) - El tamaño del bloque calculado (número de hilos por bloque en cada dimensión).

source: **Raises:**
es: **Lanza:**

source: **AssertionError**: - If `w` or `h` is less than or equal to 0. - If the computed grid and block sizes are not valid (i.e., they do not exactly cover the input dimensions).
es: **AssertionError**: - Si `w` o `h` es menor o igual a 0. - Si los tamaños de cuadrícula y bloque calculados no son válidos (es decir, no cubren exactamente las dimensiones de entrada).

source: The function first determines possible divisors of `w` and `h`, then selects block sizes that do not exceed 32 (a common maximum block size for GPU execution).
es: La función primero determina los divisores posibles de `w` y `h`, luego selecciona tamaños de bloque que no excedan 32 (un tamaño máximo común de bloque para la ejecución en GPU).

source: The final grid size is determined by dividing the input dimensions by the selected block sizes.
es: El tamaño final de la cuadrícula se determina dividiendo las dimensiones de entrada por los tamaños de bloque seleccionados.

source: If the computed configuration is invalid (i.e., `yy * y != h` or `xx * x != w`), an assertion error is raised, suggesting that manual configuration might be necessary.
es: Si la configuración calculada no es válida (es decir, `yy * y != h` o `xx * x != w`), se lanza un error de aserción, sugiriendo que podría ser necesaria una configuración manual.

source: **Example:**
es: **Ejemplo:**
fr: **Exemple :**

source: Convert a value to a human-readable format, scaling it by powers of 1024 (e.g., KB, MB, GB).
es: Convierte un valor a un formato legible, escalándolo por potencias de 1024 (por ejemplo, KB, MB, GB).
fr: Convertit une valeur en un format lisible par l'homme, en la mettant à l'échelle par puissances de 1024 (par exemple, KB, MB, GB).

source: This function divides the input value `v` by 1024 repeatedly until it is less than or equal to 1024. It then returns the value with its appropriate unit (e.g., KB, MB, GB) based on the number of divisions performed.
es: Esta función divide el valor de entrada `v` por 1024 repetidamente hasta que sea menor o igual a 1024. Luego devuelve el valor con su unidad apropiada (por ejemplo, KB, MB, GB) basándose en el número de divisiones realizadas.
fr: Cette fonction divise la valeur d'entrée `v` par 1024 de manière répétée jusqu'à ce qu'elle soit inférieure ou égale à 1024. Elle retourne ensuite la valeur avec l'unité appropriée (par exemple, KB, MB, GB) en fonction du nombre de divisions effectuées.

source: **v** (*float* or *int*): The value to be converted (typically representing bytes or data size).
es: **v** (*float* o *int*): El valor a convertir (típicamente representando bytes o tamaño de datos).
fr: **v** (*float* ou *int*) : La valeur à convertir (représentant généralement des octets ou une taille de données).

source: **str**: A human-readable string representing the value with an appropriate unit, rounded to 3 decimal places.
es: **str**: Una cadena legible que representa el valor con una unidad apropiada, redondeada a 3 decimales.
fr: **str** : Une chaîne de caractères lisible par l'homme représentant la valeur avec une unité appropriée, arrondie à 3 décimales.

source: The function uses the following units: - 1024 bytes = 1 KB - 1024 KB = 1 MB - 1024 MB = 1 GB - and so on...
es: La función utiliza las siguientes unidades: - 1024 bytes = 1 KB - 1024 KB = 1 MB - 1024 MB = 1 GB - y así sucesivamente...
fr: La fonction utilise les unités suivantes : - 1024 octets = 1 KB - 1024 KB = 1 MB - 1024 MB = 1 GB - et ainsi de suite...

source: If the input value `v` is smaller than 1024, it will be returned as is with the first unit.
es: Si el valor de entrada `v` es menor que 1024, se devolverá tal cual con la primera unidad.
fr: Si la valeur d'entrée `v` est inférieure à 1024, elle sera retournée telle quelle avec la première unité.

source: The function ensures that the appropriate unit is selected based on the scale of `v`.
es: La función asegura que se seleccione la unidad apropiada basándose en la escala de `v`.
fr: La fonction garantit que l'unité appropriée est sélectionnée en fonction de l'échelle de `v`.

source: Calculate and display the appropriate GPU block and grid dimensions for a given image size.
es: Calcula y muestra las dimensiones apropiadas de bloque y cuadrícula de la GPU para un tamaño de imagen dado.
fr: Calcule et affiche les dimensions optimales des blocs et de la grille GPU pour une taille d'image donnée.

source: This function computes the grid and block sizes required for optimal GPU parallelization. It utilizes the `block_grid` function to determine the best block and grid sizes based on the provided width (`w`) and height (`h`) of the image or display.
es: Esta función calcula los tamaños de cuadrícula y bloque necesarios para una paralelización óptima en la GPU. Utiliza la función `block_grid` para determinar los mejores tamaños de bloque y cuadrícula basándose en el ancho (`w`) y la altura (`h`) proporcionados de la imagen o pantalla.
fr: Cette fonction détermine les tailles de grille et de bloc requises pour une parallélisation optimale sur le GPU. Elle utilise la fonction `block_grid` pour obtenir les meilleures tailles de bloc et de grille en fonction de la largeur (`w`) et de la hauteur (`h`) de l'image ou de l'affichage fournis.
