Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: **Compatible with 24-bit and 32-bit surfaces**, with or without an alpha layer. The surface must be greyscale, but non-greyscale images will also work; however, only the red channel will be used for Sobel edge detection.
es: **Compatible con superficies de 24 y 32 bits**, con o sin capa alfa. La superficie debe estar en escala de grises, pero las imágenes que no estén en escala de grises también funcionarán; sin embargo, solo se utilizará el canal rojo para la detección de bordes Sobel.
fr: **Compatible avec des surfaces 24 bits et 32 bits**, avec ou sans couche alpha. La surface doit être en niveaux de gris, mais les images non en niveaux de gris fonctionneront également ; en revanche, seul le canal rouge sera utilisé pour la détection des bords de Sobel.

source: **surface_** (pygame.Surface) A Pygame-compatible surface (24-bit or 32-bit) with or without an alpha layer.
es: **surface_** (pygame.Surface) Una superficie compatible con Pygame (24 o 32 bits) con o sin capa alfa.
fr: **surface_** (pygame.Surface) Une surface compatible Pygame (24 bits ou 32 bits) avec ou sans couche alpha.

source: **threshold_** (int, optional, default=64) An integer representing the threshold for edge detection. Pixels with gradient values above this threshold are considered edges.
es: **threshold_** (int, opcional, predeterminado=64) Un entero que representa el umbral para la detección de bordes. Los píxeles con valores de gradiente por encima de este umbral se consideran bordes.
fr: **threshold_** (int, optionnel, valeur par défaut=64) Un entier représentant le seuil pour la détection des bords. Les pixels ayant des valeurs de gradient supérieures à ce seuil sont considérés comme des bords.

source: **factor_** (unsigned short int, optional, default=1) An integer that controls the down-scaling factor of the image. A value of 1 means no down-scaling, and larger values reduce the size of the image before processing.
es: **factor_** (unsigned short int, opcional, predeterminado=1) Un entero que controla el factor de reducción de escala de la imagen. Un valor de 1 significa que no se reduce la escala, y valores más grandes reducen el tamaño de la imagen antes del procesamiento.
fr: **factor_** (entier non signé court, optionnel, valeur par défaut=1) Un entier qui contrôle le facteur de réduction de l'image. Une valeur de 1 signifie qu'il n'y a pas de réduction, et des valeurs plus grandes réduisent la taille de l'image avant le traitement.

source: None This function modifies the input surface directly (in-place).
es: Ninguno Esta función modifica la superficie de entrada directamente (in situ).
fr: None Cette fonction modifie directement la surface d'entrée (en place).

source: Invert pixels (inplace)
es: Invertir píxeles (in situ)
fr: Inverser les pixels (en place)

source: Inverting an image means inverting the pixel values. Images are represented using RGB or Red-Green-Blue values, where each channel can take an integer value between 0 and 255 (both inclusive). For example, red is represented as (255, 0, 0), white as (255, 255, 255), black as (0, 0, 0), and so on. Inverting an image means reversing the colors. For instance, the inverted color for red will be (0, 255, 255), where 255 becomes 0 and 0 becomes 255. Effectively, inverting an image is equivalent to subtracting the original RGB values from 255.
es: Invertir una imagen significa invertir los valores de los píxeles. Las imágenes se representan utilizando valores RGB o Rojo-Verde-Azul, donde cada canal puede tomar un valor entero entre 0 y 255 (ambos incluidos). Por ejemplo, el rojo se representa como (255, 0, 0), el blanco como (255, 255, 255), el negro como (0, 0, 0), y así sucesivamente. Invertir una imagen significa invertir los colores. Por ejemplo, el color invertido para el rojo será (0, 255, 255), donde 255 se convierte en 0 y 0 se convierte en 255. Efectivamente, invertir una imagen es equivalente a restar los valores RGB originales de 255.
fr: Inverser une image signifie inverser les valeurs des pixels. Les images sont représentées en utilisant des valeurs RGB ou Rouge-Vert-Bleu, où chaque canal peut avoir une valeur entière entre 0 et 255 (inclus). Par exemple, le rouge est représenté comme (255, 0, 0), le blanc comme (255, 255, 255), le noir comme (0, 0, 0), etc. Inverser une image signifie inverser les couleurs. Par exemple, la couleur inversée pour le rouge sera (0, 255, 255), où 255 devient 0 et 0 devient 255. Effectivement, inverser une image équivaut à soustraire les valeurs RGB d'origine de 255.

source: **Compatible with 24-bit and 32-bit surfaces**, with or without an alpha channel.
es: **Compatible con superficies de 24 y 32 bits**, con o sin canal alfa.
fr: **Compatible avec des surfaces 24 bits et 32 bits**, avec ou sans canal alpha.

source: **surface_** (pygame.Surface) A Pygame-compatible surface (24-bit or 32-bit) with or without an alpha channel.
es: **surface_** (pygame.Surface) Una superficie compatible con Pygame (24 o 32 bits) con o sin canal alfa.
fr: **surface_** (pygame.Surface) Une surface compatible Pygame (24 bits ou 32 bits) avec ou sans canal alpha.

source: Invert pixels and return a copy
es: Invertir píxeles y devolver una copia
fr: Inverser les pixels et retourner une copie

source: (pygame.Surface) A new surface with inverted pixels, leaving the original surface unchanged.
es: (pygame.Surface) Una nueva superficie con píxeles invertidos, dejando la superficie original sin cambios.
fr: (pygame.Surface) Une nouvelle surface avec les pixels inversés, laissant la surface originale inchangée.

source: Invert 3D array pixels (inplace)
es: Invertir píxeles de un arreglo 3D (in situ)
fr: Inverser les pixels d'un tableau 3D (en place)

source: **rgb_array** (numpy.ndarray) A 3D array with shape (w, h, n), where `w` and `h` represent the width and height of the image, and `n` is the number of channels (e.g., 3 for RGB, 4 for RGBA). The array contains pixel data in RGB(A) or similar formats, such as BGR, BGRA.
es: **rgb_array** (numpy.ndarray) Un arreglo 3D con forma (w, h, n), donde `w` y `h` representan el ancho y la altura de la imagen, y `n` es el número de canales (por ejemplo, 3 para RGB, 4 para RGBA). El arreglo contiene datos de píxeles en formato RGB(A) o formatos similares, como BGR, BGRA.
fr: **rgb_array** (numpy.ndarray) Un tableau 3D de forme (w, h, n), où `w` et `h` représentent la largeur et la hauteur de l'image, et `n` est le nombre de canaux (par exemple, 3 pour RGB, 4 pour RGBA). Le tableau contient des données de pixels au format RGB(A) ou formats similaires, comme BGR, BGRA.

source: None The function modifies the input array in place.
es: Ninguno La función modifica el arreglo de entrada in situ.
fr: None La fonction modifie le tableau d'entrée en place.

source: Invert directly a C-buffer pixel values
es: Invertir directamente los valores de píxeles de un búfer C
fr: Inverser directement les valeurs des pixels d'un tampon C

source: **rgb_array** (numpy.ndarray) A 1D array (C-buffer) with uint8 data type containing pixel data in RGB(A) format. The method works with other formats such as BGR, BGRA, etc.
es: **rgb_array** (numpy.ndarray) Un arreglo 1D (búfer C) con tipo de datos uint8 que contiene datos de píxeles en formato RGB(A). El método funciona con otros formatos como BGR, BGRA, etc.
fr: **rgb_array** (numpy.ndarray) Un tableau 1D (tampon C) avec un type de données uint8 contenant des données de pixels au format RGB(A). La méthode fonctionne avec d'autres formats tels que BGR, BGRA, etc.

source: **format_32** (bool, optional, default=False) If `True`, the array is assumed to be in RGBA format (32-bit). If `False`, the array is assumed to be in RGB format (24-bit).
es: **format_32** (bool, opcional, predeterminado=False) Si es `True`, se asume que el arreglo está en formato RGBA (32 bits). Si es `False`, se asume que el arreglo está en formato RGB (24 bits).
fr: **format_32** (booléen, optionnel, valeur par défaut=False) Si `True`, le tableau est considéré comme étant au format RGBA (32 bits). Si `False`, le tableau est considéré comme étant au format RGB (24 bits).

source: Invert directly a C-buffer pixel values (return a copy)
es: Invertir directamente los valores de píxeles de un búfer C (devolver una copia)
fr: Inverser directement les valeurs des pixels d'un tampon C (retourner une copie)

source: This function returns a copy of the input array with the pixel values inverted.
es: Esta función devuelve una copia del arreglo de entrada con los valores de píxeles invertidos.
fr: Cette fonction retourne une copie du tableau d'entrée avec les valeurs des pixels inversées.

source: numpy.ndarray A 1D array with uint8 data type, representing a copy of the input buffer with inverted pixel values.
es: numpy.ndarray Un arreglo 1D con tipo de datos uint8, que representa una copia del búfer de entrada con los valores de píxeles invertidos.
fr: numpy.ndarray Un tableau 1D avec un type de données uint8, représentant une copie du tampon d'entrée avec les valeurs des pixels inversées.

source: Apply Hue Rotation to an Image (HSL Color Space)
es: Aplicar rotación de tono a una imagen (espacio de color HSL)
fr: Appliquer une rotation de teinte à une image (espace colorimétrique HSL)

source: This function directly modifies the hue of a Pygame surface using the HSL (Hue, Saturation, Lightness) color model. Hue rotation shifts the colors of the surface in a way that corresponds to a rotation on the color wheel, allowing you to alter the overall color tone.
es: Esta función modifica directamente el tono de una superficie de Pygame utilizando el modelo de color HSL (Tono, Saturación, Luminosidad). La rotación de tono desplaza los colores de la superficie de una manera que corresponde a una rotación en la rueda de colores, permitiéndole alterar el tono general del color.
fr: Cette fonction modifie directement la teinte d'une surface Pygame en utilisant le modèle colorimétrique HSL (Teinte, Saturation, Luminosité). La rotation de la teinte déplace les couleurs de la surface de manière à correspondre à une rotation sur la roue des couleurs, vous permettant de modifier le ton global de l'image.

source: The surface must be compatible with 24-bit or 32-bit color depth, with or without an alpha layer. If the `shift` value is 0.0, the surface remains unchanged.
es: La superficie debe ser compatible con profundidad de color de 24 o 32 bits, con o sin capa alfa. Si el valor de `shift` es 0.0, la superficie permanece sin cambios.
fr: La surface doit être compatible avec une profondeur de couleur de 24 bits ou 32 bits, avec ou sans couche alpha. Si la valeur de `shift` est 0.0, la surface reste inchangée.

source: The hue shift value must be within the range [0.0, 1.0], where 0.0 represents no rotation, and 1.0 represents a 360-degree rotation.
es: El valor de desplazamiento de tono debe estar dentro del rango [0.0, 1.0], donde 0.0 representa ninguna rotación y 1.0 representa una rotación de 360 grados.
fr: La valeur de décalage de la teinte doit être comprise dans la plage [0.0, 1.0], où 0.0 représente aucune rotation, et 1.0 représente une rotation complète de 360 degrés.

source: **surface_** (pygame.Surface) A Pygame surface, compatible with 24-bit or 32-bit color formats (with or without alpha).
es: **surface_** (pygame.Surface) Una superficie de Pygame, compatible con formatos de color de 24 o 32 bits (con o sin alfa).
fr: **surface_** (pygame.Surface) Une surface Pygame, compatible avec des formats de couleur 24 bits ou 32 bits (avec ou sans alpha).

source: **shift** (float) A float value in the range [0.0, 1.0], where 0.0 corresponds to no hue shift, and 1.0 corresponds to a full 360-degree rotation of the hue.
es: **shift** (float) Un valor flotante en el rango [0.0, 1.0], donde 0.0 corresponde a ningún desplazamiento de tono y 1.0 corresponde a una rotación completa de 360 grados del tono.
fr: **shift** (float) Une valeur flottante dans la plage [0.0, 1.0], où 0.0 correspond à aucun décalage de teinte, et 1.0 correspond à une rotation complète de 360 degrés de la teinte.

source: None The function modifies the input `surface_` in place, applying the hue shift effect.
es: Ninguno La función modifica la entrada `surface_` in situ, aplicando el efecto de desplazamiento de tono.
fr: None La fonction modifie la `surface_` d'entrée en place, appliquant l'effet de rotation de teinte.

source: Apply Hue Rotation to a 3D Array (HSL Color Space)
es: Aplicar rotación de tono a un arreglo 3D (espacio de color HSL)
fr: Appliquer une rotation de teinte à un tableau 3D (espace colorimétrique HSL)

source: This function applies hue rotation to a 3D numpy array representing an image in the HSL (Hue, Saturation, Lightness) color space. The hue shift is applied directly to the array, modifying the color tone of the image.
es: Esta función aplica la rotación de tono a un arreglo 3D de numpy que representa una imagen en el espacio de color HSL (Tono, Saturación, Luminosidad). El desplazamiento de tono se aplica directamente al arreglo, modificando el tono de color de la imagen.
fr: Cette fonction applique la rotation de teinte à un tableau numpy 3D représentant une image dans l'espace colorimétrique HSL (Teinte, Saturation, Luminosité). Le décalage de teinte est appliqué directement au tableau, modifiant le ton coloré de l'image.

source: The array must be in the shape (w, h, n), where `w` is the width, `h` is the height, and `n` is the number of color channels (3 for RGB or 4 for RGBA, etc.). The data type should be uint8.
es: El arreglo debe tener la forma (w, h, n), donde `w` es el ancho, `h` es la altura y `n` es el número de canales de color (3 para RGB o 4 para RGBA, etc.). El tipo de datos debe ser uint8.
fr: Le tableau doit avoir la forme (w, h, n), où `w` est la largeur, `h` est la hauteur, et `n` est le nombre de canaux de couleur (3 pour RGB ou 4 pour RGBA, etc.). Le type de données doit être uint8.

source: The `shift` value must be within the range [0.0, 1.0], where 0.0 represents no hue rotation, and 1.0 represents a full 360-degree hue rotation.
es: El valor de `shift` debe estar dentro del rango [0.0, 1.0], donde 0.0 representa ninguna rotación de tono y 1.0 representa una rotación completa de 360 grados del tono.
fr: La valeur de `shift` doit être comprise dans la plage [0.0, 1.0], où 0.0 représente aucune rotation de teinte, et 1.0 représente une rotation complète de 360 degrés de la teinte.

source: **rgb_array** (numpy.ndarray) A 3D numpy array with shape (w, h, n) containing RGB or RGBA pixel data. The array can also represent other formats such as BGR, BGRA.
es: **rgb_array** (numpy.ndarray) Un arreglo 3D de numpy con forma (w, h, n) que contiene datos de píxeles RGB o RGBA. El arreglo también puede representar otros formatos como BGR, BGRA.
fr: **rgb_array** (numpy.ndarray) Un tableau numpy 3D de forme (w, h, n) contenant des données de pixels RGB ou RGBA. Le tableau peut également représenter d'autres formats comme BGR, BGRA.

source: **shift** (float) A float value in the range [0.0, 1.0], representing the hue rotation. A value of 0.0 means no rotation, while 1.0 corresponds to a full 360-degree hue shift.
es: **shift** (float) Un valor flotante en el rango [0.0, 1.0], que representa la rotación de tono. Un valor de 0.0 significa ninguna rotación, mientras que 1.0 corresponde a un desplazamiento de tono completo de 360 grados.
fr: **shift** (float) Une valeur flottante dans la plage [0.0, 1.0], représentant la rotation de teinte. Une valeur de 0.0 signifie aucune rotation, tandis que 1.0 correspond à un décalage complet de 360 degrés de la teinte.

source: None The function modifies the input `rgb_array` in place, applying the hue shift.
es: Ninguno La función modifica el arreglo de entrada `rgb_array` in situ, aplicando el desplazamiento de tono.
fr: None La fonction modifie le `rgb_array` d'entrée en place, appliquant le changement de teinte.

source: Apply Hue Rotation to a C-buffer (HSL Color Space)
es: Aplicar rotación de tono a un búfer C (espacio de color HSL)
fr: Appliquer une rotation de teinte à un tampon C (espace colorimétrique HSL)

source: This function performs hue rotation on a C-buffer (1D array) containing pixel data in RGB(A) format using the HSL (Hue, Saturation, Lightness) color model. It modifies the array in place.
es: Esta función realiza la rotación de tono en un búfer C (arreglo 1D) que contiene datos de píxeles en formato RGB(A) utilizando el modelo de color HSL (Tono, Saturación, Luminosidad). Modifica el arreglo in situ.
fr: Cette fonction effectue une rotation de teinte sur un tampon C (tableau 1D) contenant des données de pixels au format RGB(A) en utilisant le modèle de couleur HSL (Teinte, Saturation, Luminosité). Elle modifie le tableau en place.

source: The function supports pixel formats like RGB, BGR, RGBA, and BGRA, adjusting the hue of each pixel according to the specified `shift`. The `shift` value should be in the range [0.0, 1.0], which corresponds to a rotation of 0.0 to 360.0 degrees on the hue color wheel.
es: La función admite formatos de píxeles como RGB, BGR, RGBA y BGRA, ajustando el tono de cada píxel según el `shift` especificado. El valor de `shift` debe estar en el rango [0.0, 1.0], que corresponde a una rotación de 0.0 a 360.0 grados en la rueda de colores de tono.
fr: La fonction prend en charge des formats de pixels comme RGB, BGR, RGBA et BGRA, ajustant la teinte de chaque pixel en fonction du `shift` spécifié. La valeur de `shift` doit être dans la plage [0.0, 1.0], ce qui correspond à une rotation de 0.0 à 360.0 degrés sur la roue des couleurs de teinte.

source: **bgr_array** (numpy.ndarray) A 1D numpy array (C-buffer) of type uint8 containing pixel data in RGB(A) format. The array can also represent other formats such as BGR, BGRA.
es: **bgr_array** (numpy.ndarray) Un arreglo 1D de numpy (búfer C) de tipo uint8 que contiene datos de píxeles en formato RGB(A). El arreglo también puede representar otros formatos como BGR, BGRA.
fr: **bgr_array** (numpy.ndarray) Un tableau numpy 1D (tampon C) de type uint8 contenant des données de pixels au format RGB(A). Le tableau peut également représenter d'autres formats tels que BGR, BGRA.

source: **shift** (float) A float value in the range [0.0, 1.0] representing the hue rotation. A value of 0.0 means no rotation, while 1.0 corresponds to a full 360-degree rotation.
es: **shift** (float) Un valor flotante en el rango [0.0, 1.0] que representa la rotación de tono. Un valor de 0.0 significa ninguna rotación, mientras que 1.0 corresponde a una rotación completa de 360 grados.
fr: **shift** (float) Une valeur flottante dans la plage [0.0, 1.0] représentant la rotation de la teinte. Une valeur de 0.0 signifie aucune rotation, tandis que 1.0 correspond à une rotation complète de 360 degrés.

source: **format_32** (bool, optional, default=False) If `True`, the input array is assumed to be in 32-bit RGBA format. If `False`, the array is assumed to be in 24-bit RGB format.
es: **format_32** (bool, opcional, predeterminado=False) Si es `True`, se asume que el arreglo de entrada está en formato RGBA de 32 bits. Si es `False`, se asume que el arreglo está en formato RGB de 24 bits.
fr: **format_32** (bool, optionnel, par défaut=False) Si `True`, le tableau d'entrée est supposé être au format RGBA 32 bits. Si `False`, le tableau est supposé être au format RGB 24 bits.

source: None The function modifies the input `bgr_array` in place by applying the hue shift.
es: Ninguno La función modifica el arreglo de entrada `bgr_array` in situ aplicando el desplazamiento de tono.
fr: Aucune La fonction modifie directement le `bgr_array` en appliquant le changement de teinte.

source: Rotate hue (HSL) directly to a C-buffer (return a copy)
es: Rotar el tono (HSL) directamente en un búfer C (devolver una copia)
fr: Faire une rotation de la teinte (HSL) directement sur un C-buffer (retourner une copie)

source: This function performs a hue rotation in the HSL (Hue, Saturation, Lightness) color space on a C-buffer (1D array) containing pixel data in RGB(A) format, returning a modified copy of the array.
es: Esta función realiza una rotación de tono en el espacio de color HSL (Tono, Saturación, Luminosidad) en un búfer C (arreglo 1D) que contiene datos de píxeles en formato RGB(A), devolviendo una copia modificada del arreglo.
fr: Cette fonction effectue une rotation de la teinte dans l'espace colorimétrique HSL (Teinte, Saturation, Luminosité) sur un C-buffer (tableau 1D) contenant des données de pixels au format RGB(A), retournant une copie modifiée du tableau.

source: The method works with pixel formats like RGB, BGR, RGBA, and BGRA. The hue shift (`shift`) value should be in the range [0.0, 1.0], corresponding to a rotation of 0.0 to 360.0 degrees.
es: El método funciona con formatos de píxeles como RGB, BGR, RGBA y BGRA. El valor de desplazamiento de tono (`shift`) debe estar en el rango [0.0, 1.0], correspondiendo a una rotación de 0.0 a 360.0 grados.
fr: La méthode fonctionne avec des formats de pixels comme RGB, BGR, RGBA et BGRA. La valeur du décalage de teinte (`shift`) doit être dans la plage [0.0, 1.0], correspondant à une rotation de 0.0 à 360.0 degrés.

source: **shift** (float) A float value in the range [0.0, 1.0], representing the hue rotation. A value of 0.0 means no rotation, while 1.0 corresponds to a full 360-degree rotation.
es: **shift** (float) Un valor flotante en el rango [0.0, 1.0], que representa la rotación de tono. Un valor de 0.0 significa ninguna rotación, mientras que 1.0 corresponde a una rotación completa de 360 grados.
fr: **shift** (float) Une valeur flottante dans la plage [0.0, 1.0], représentant la rotation de la teinte. Une valeur de 0.0 signifie aucune rotation, tandis que 1.0 correspond à une rotation complète de 360 degrés.

source: **numpy.ndarray** A 1D numpy array of type uint8 containing the pixel data with the rotated hue.
es: **numpy.ndarray** Un arreglo 1D de numpy de tipo uint8 que contiene los datos de píxeles con el tono rotado.
fr: **numpy.ndarray** Un tableau 1D numpy de type uint8 contenant les données de pixels avec la teinte tournante.

source: Apply Hue Rotation to a Surface (HSV Color Space)
es: Aplicar rotación de tono a una superficie (espacio de color HSV)
fr: Appliquer la rotation de la teinte à une surface (espace de couleur HSV)

source: This function applies a hue rotation to a Pygame surface using the HSV (Hue, Saturation, Value) color model. It modifies the surface in place, rotating the hue of the colors on the surface based on the specified shift.
es: Esta función aplica una rotación de tono a una superficie de Pygame utilizando el modelo de color HSV (Tono, Saturación, Valor). Modifica la superficie in situ, rotando el tono de los colores en la superficie según el desplazamiento especificado.
fr: Cette fonction applique une rotation de la teinte à une surface Pygame en utilisant le modèle de couleur HSV (Teinte, Saturation, Valeur). Elle modifie directement la surface, en faisant tourner la teinte des couleurs sur la surface selon le changement spécifié.
