Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: `amplitude` (float, optional): The amplitude of the lateral dampening effect. This value controls the maximum displacement of the surface. A higher value results in larger horizontal movement. Default is 50.0.
es: `amplitude` (float, opcional): La amplitud del efecto de amortiguación lateral. Este valor controla el desplazamiento máximo de la superficie. Un valor más alto resulta en un movimiento horizontal más grande. El valor predeterminado es 50.0.
fr: `amplitude` (float, optionnel) : L'amplitude de l'effet d'amortissement latéral. Cette valeur contrôle le déplacement maximal de la surface. Une valeur plus élevée entraîne un mouvement horizontal plus important. La valeur par défaut est 50.0.

source: `duration` (int, optional): The total duration of the effect, in terms of frames. This defines how long the oscillations will last. The default value is 30 frames.
es: `duration` (int, opcional): La duración total del efecto, en términos de fotogramas. Esto define cuánto tiempo durarán las oscilaciones. El valor predeterminado es 30 fotogramas.
fr: `duration` (int, optionnel) : La durée totale de l'effet, en termes de frames. Elle définit combien de temps durera l'oscillation. La valeur par défaut est 30 frames.

source: `freq` (float, optional): The frequency of the dampening oscillation. This controls how fast the oscillations occur. A lower value makes the effect take longer to complete (slower oscillation), while a higher value speeds up the oscillation. Default is 20.0.
es: `freq` (float, opcional): La frecuencia de la oscilación amortiguada. Esto controla la rapidez con la que ocurren las oscilaciones. Un valor más bajo hace que el efecto tarde más en completarse (oscilación más lenta), mientras que un valor más alto acelera la oscilación. El valor predeterminado es 20.0.
fr: `freq` (float, optionnel) : La fréquence de l'oscillation amortie. Cela contrôle la rapidité des oscillations. Une valeur plus faible fait durer plus longtemps l'effet (oscillation plus lente), tandis qu'une valeur plus élevée accélère l'oscillation. La valeur par défaut est 20.0.

source: float: The lateral displacement value (x) that can be used to shift the object horizontally on the screen (e.g., when blitting an image). The value will oscillate within a range determined by the amplitude.
es: float: El valor de desplazamiento lateral (x) que se puede utilizar para desplazar el objeto horizontalmente en la pantalla (por ejemplo, al blitear una imagen). El valor oscilará dentro de un rango determinado por la amplitud.
fr: float : La valeur de déplacement latéral (x) qui peut être utilisée pour déplacer l'objet horizontalement à l'écran (par exemple, lors du dessin d'une image). La valeur oscillera dans une plage déterminée par l'amplitude.

source: **Example usage**: .. code-block:: python
es: **Ejemplo de uso**: .. code-block:: python
fr: **Exemple d'utilisation** : .. code-block:: python

source: # Apply lateral dampening effect to a surface tm = lateral_dampening(frame, amplitude=50.0, duration=35, freq=5.0) SCREEN.blit(BCK, (tm, 0), special_flags=0)
es: # Aplicar efecto de amortiguación lateral a una superficie tm = lateral_dampening(frame, amplitude=50.0, duration=35, freq=5.0) SCREEN.blit(BCK, (tm, 0), special_flags=0)
fr: # Appliquer un effet d'amortissement latéral à une surface tm = lateral_dampening(frame, amplitude=50.0, duration=35, freq=5.0) SCREEN.blit(BCK, (tm, 0), special_flags=0)

source: **Notes**:
es: **Notas**:

source: The displacement follows a damped oscillation model, where the value decays over time based on the frequency and duration parameters.
es: El desplazamiento sigue un modelo de oscilación amortiguada, donde el valor decae con el tiempo según los parámetros de frecuencia y duración.
fr: Le déplacement suit un modèle d'oscillation amortie, où la valeur décroît au fil du temps en fonction des paramètres de fréquence et de durée.

source: Perform alpha blending of two 32-bit images.
es: Realizar mezcla alfa de dos imágenes de 32 bits.
fr: Effectuer un mélange alpha de deux images 32 bits.

source: This function blends two 32-bit images together, taking into account their alpha channels (transparency). The `source` image is drawn on top of the `destination` image. The blending uses the alpha channel to determine how transparent each pixel is in the source image.
es: Esta función mezcla dos imágenes de 32 bits, teniendo en cuenta sus canales alfa (transparencia). La imagen `source` se dibuja sobre la imagen `destination`. La mezcla utiliza el canal alfa para determinar cuán transparente es cada píxel en la imagen de origen.
fr: Cette fonction mélange deux images 32 bits ensemble, en tenant compte de leurs canaux alpha (transparence). L'image `source` est dessinée par-dessus l'image `destination`. Le mélange utilise le canal alpha pour déterminer la transparence de chaque pixel de l'image source.

source: `source` (pygame.Surface): The source image to be blended with the destination image. It must be a 32-bit image with an alpha channel.
es: `source` (pygame.Surface): La imagen de origen que se mezclará con la imagen de destino. Debe ser una imagen de 32 bits con un canal alfa.
fr: `source` (pygame.Surface) : L'image source à mélanger avec l'image destination. Elle doit être une image 32 bits avec un canal alpha.

source: `destination` (pygame.Surface): The destination image onto which the source image will be blended. It must also be a 32-bit image with an alpha channel.
es: `destination` (pygame.Surface): La imagen de destino sobre la cual se mezclará la imagen de origen. También debe ser una imagen de 32 bits con un canal alfa.
fr: `destination` (pygame.Surface) : L'image de destination sur laquelle l'image source sera mélangée. Elle doit également être une image 32 bits avec un canal alpha.

source: pygame.Surface: A new 32-bit Pygame surface with the two images blended together, based on their alpha values.
es: pygame.Surface: Una nueva superficie de Pygame de 32 bits con las dos imágenes mezcladas, basadas en sus valores alfa.
fr: pygame.Surface : Une nouvelle surface Pygame 32 bits avec les deux images mélangées ensemble, basée sur leurs valeurs alpha.

source: This function returns a new surface and does not modify the original `source` or `destination` images.
es: Esta función devuelve una nueva superficie y no modifica las imágenes originales `source` o `destination`.
fr: Cette fonction retourne une nouvelle surface et ne modifie pas les images `source` ou `destination` originales.

source: Both images must have an alpha channel to ensure proper blending of transparency.
es: Ambas imágenes deben tener un canal alfa para garantizar una mezcla adecuada de la transparencia.
fr: Les deux images doivent avoir un canal alpha pour garantir un mélange correct de la transparence.

source: Perform alpha blending on two images in-place.
es: Realizar mezcla alfa en dos imágenes in situ.
fr: Effectuer un mélange alpha sur deux images directement.

source: This function blends two images with the same dimensions together, modifying the first image (`image1`). The blending is performed based on the alpha channel, where the second image (`image2`) is blended into the first image.
es: Esta función mezcla dos imágenes con las mismas dimensiones, modificando la primera imagen (`image1`). La mezcla se realiza basándose en el canal alfa, donde la segunda imagen (`image2`) se mezcla en la primera imagen.
fr: Cette fonction mélange deux images de mêmes dimensions, en modifiant la première image (`image1`). Le mélange est effectué en fonction du canal alpha, où la deuxième image (`image2`) est mélangée dans la première image.

source: Both images must be 32-bit with an alpha channel and should have the same dimensions. The blending process uses the alpha values of both images to calculate the transparency of the pixels.
es: Ambas imágenes deben ser de 32 bits con un canal alfa y deben tener las mismas dimensiones. El proceso de mezcla utiliza los valores alfa de ambas imágenes para calcular la transparencia de los píxeles.
fr: Les deux images doivent être 32 bits avec un canal alpha et doivent avoir les mêmes dimensions. Le processus de mélange utilise les valeurs alpha des deux images pour calculer la transparence des pixels.

source: `image1` (pygame.Surface): The first image to be blended with the second image. It must be a 32-bit image with an alpha channel. This image is modified in place.
es: `image1` (pygame.Surface): La primera imagen que se mezclará con la segunda imagen. Debe ser una imagen de 32 bits con un canal alfa. Esta imagen se modifica in situ.
fr: `image1` (pygame.Surface) : La première image à mélanger avec la deuxième image. Elle doit être une image 32 bits avec un canal alpha. Cette image est modifiée directement.

source: `image2` (pygame.Surface): The second image to be blended into the first image. It must also be a 32-bit image with an alpha channel.
es: `image2` (pygame.Surface): La segunda imagen que se mezclará en la primera imagen. También debe ser una imagen de 32 bits con un canal alfa.
fr: `image2` (pygame.Surface) : La deuxième image à mélanger dans la première image. Elle doit également être une image 32 bits avec un canal alpha.

source: None: This function modifies the first image (`image1`) in place and does not return a new surface.
es: None: Esta función modifica la primera imagen (`image1`) in situ y no devuelve una nueva superficie.
fr: None : Cette fonction modifie la première image (`image1`) directement et ne retourne pas une nouvelle surface.

source: This function performs blending in place, modifying the `image1` surface.
es: Esta función realiza la mezcla in situ, modificando la superficie `image1`.
fr: Cette fonction effectue le mélange directement, en modifiant la surface `image1`.

source: Both `image1` and `image2` must have the same dimensions and include an alpha channel.
es: Tanto `image1` como `image2` deben tener las mismas dimensiones e incluir un canal alfa.
fr: Les images `image1` et `image2` doivent avoir les mêmes dimensions et inclure un canal alpha.

source: If either of the images does not have an alpha channel or have mismatched dimensions, an exception will be raised.
es: Si alguna de las imágenes no tiene un canal alfa o tiene dimensiones no coincidentes, se lanzará una excepción.
fr: Si l'une des images n'a pas de canal alpha ou si les dimensions ne correspondent pas, une exception sera levée.

source: Generates a realistic lighting effect on a Pygame surface or texture.
es: Genera un efecto de iluminación realista en una superficie o textura de Pygame.
fr: Génère un effet lumineux réaliste sur une surface ou une texture Pygame.

source: This function simulates a light effect that can be blended onto a surface using additive blending (`BLEND_RGBA_ADD` in Pygame). The effect is generated based on a mask texture and can include optional enhancements such as bloom, heat waves, and saturation adjustments.
es: Esta función simula un efecto de luz que puede mezclarse en una superficie usando mezcla aditiva (`BLEND_RGBA_ADD` en Pygame). El efecto se genera basado en una textura de máscara y puede incluir mejoras opcionales como bloom, ondas de calor y ajustes de saturación.
fr: Cette fonction simule un effet lumineux qui peut être mélangé sur une surface en utilisant le mélange additif (`BLEND_RGBA_ADD` dans Pygame). L'effet est généré à partir d'une texture de masque et peut inclure des améliorations optionnelles telles que le bloom, des vagues de chaleur et des ajustements de saturation.

source: **Example Usage**:
es: **Ejemplo de uso**:
fr: **Exemple d'utilisation** :

source: `x` (int): The X-coordinate of the light source. It must be within the screen width.
es: `x` (int): La coordenada X de la fuente de luz. Debe estar dentro del ancho de la pantalla.
fr: `x` (int) : La coordonnée X de la source lumineuse. Elle doit être dans la largeur de l'écran.

source: `y` (int): The Y-coordinate of the light source. It must be within the screen height.
es: `y` (int): La coordenada Y de la fuente de luz. Debe estar dentro de la altura de la pantalla.
fr: `y` (int) : La coordonnée Y de la source lumineuse. Elle doit être dans la hauteur de l'écran.

source: `background_rgb` (numpy.ndarray, shape (w, h, 3), dtype uint8): A 3D NumPy array representing the RGB values of the background surface.
es: `background_rgb` (numpy.ndarray, forma (w, h, 3), dtype uint8): Un array 3D de NumPy que representa los valores RGB de la superficie de fondo.
fr: `background_rgb` (numpy.ndarray, forme (w, h, 3), dtype uint8) : Un tableau NumPy 3D représentant les valeurs RGB de la surface de fond.

source: `mask_alpha` (numpy.ndarray, shape (w, h), dtype uint8): A 2D NumPy array containing the alpha (transparency) values of the light mask. Using a radial gradient mask with maximum intensity at the center is recommended.
es: `mask_alpha` (numpy.ndarray, forma (w, h), dtype uint8): Un array 2D de NumPy que contiene los valores alfa (transparencia) de la máscara de luz. Se recomienda usar una máscara de gradiente radial con intensidad máxima en el centro.
fr: `mask_alpha` (numpy.ndarray, forme (w, h), dtype uint8) : Un tableau NumPy 2D contenant les valeurs alpha (transparence) du masque lumineux. L'utilisation d'un masque de gradient radial avec une intensité maximale au centre est recommandée.

source: `intensity` (float, optional, default=1.0): Light intensity in the range [0.0, 20.0]. Higher values produce a stronger effect.
es: `intensity` (float, opcional, predeterminado=1.0): Intensidad de la luz en el rango [0.0, 20.0]. Valores más altos producen un efecto más fuerte.
fr: `intensity` (float, optionnel, défaut=1.0) : Intensité de la lumière dans la plage [0.0, 20.0]. Des valeurs plus élevées produisent un effet plus fort.

source: `color` (numpy.ndarray, optional, default=[128.0, 128.0, 128.0]): A 3-element NumPy array representing the RGB color of the light in float format (values in the range [0.0, 255.0]).
es: `color` (numpy.ndarray, opcional, predeterminado=[128.0, 128.0, 128.0]): Un array de 3 elementos de NumPy que representa el color RGB de la luz en formato float (valores en el rango [0.0, 255.0]).
fr: `color` (numpy.ndarray, optionnel, défaut=[128.0, 128.0, 128.0]) : Un tableau NumPy à 3 éléments représentant la couleur RGB de la lumière au format float (valeurs dans la plage [0.0, 255.0]).

source: `smooth` (bool, optional, default=False): If `True`, applies a blur effect to smooth the lighting.
es: `smooth` (bool, opcional, predeterminado=False): Si es `True`, aplica un efecto de desenfoque para suavizar la iluminación.
fr: `smooth` (bool, optionnel, défaut=False) : Si `True`, applique un effet de flou pour lisser l'éclairage.

source: `saturation` (bool, optional, default=False): If `True`, applies a saturation effect to enhance color vibrancy.
es: `saturation` (bool, opcional, predeterminado=False): Si es `True`, aplica un efecto de saturación para mejorar la vibración del color.
fr: `saturation` (bool, optionnel, défaut=False) : Si `True`, applique un effet de saturation pour améliorer la vivacité des couleurs.

source: `sat_value` (float, optional, default=0.2): Adjusts the saturation level. The valid range is [-1.0, 1.0].
es: `sat_value` (float, opcional, predeterminado=0.2): Ajusta el nivel de saturación. El rango válido es [-1.0, 1.0].
fr: `sat_value` (float, optionnel, défaut=0.2) : Ajuste le niveau de saturation. Le range valide est [-1.0, 1.0].

source: `bloom` (bool, optional, default=False): If `True`, enables a bloom effect, which enhances the brightness of intense areas.
es: `bloom` (bool, opcional, predeterminado=False): Si es `True`, habilita un efecto de bloom, que mejora el brillo de las áreas intensas.
fr: `bloom` (bool, optionnel, défaut=False) : Si `True`, active un effet de bloom, qui améliore la luminosité des zones intenses.

source: `threshold` (int, optional, default=110): The brightness threshold used in the bloom effect. Pixels above this value contribute to the bloom.
es: `threshold` (int, opcional, predeterminado=110): El umbral de brillo utilizado en el efecto de bloom. Los píxeles por encima de este valor contribuyen al bloom.
fr: `threshold` (int, optionnel, défaut=110) : Le seuil de luminosité utilisé pour l'effet de bloom. Les pixels au-dessus de cette valeur contribuent au bloom.

source: `heat` (bool, optional, default=False): If `True`, applies a heat wave effect that distorts the lighting dynamically.
es: `heat` (bool, opcional, predeterminado=False): Si es `True`, aplica un efecto de onda de calor que distorsiona la iluminación dinámicamente.
fr: `heat` (bool, optionnel, défaut=False) : Si `True`, applique un effet de vagues de chaleur qui déforme dynamiquement l'éclairage.

source: `frequency` (float, optional, default=1): Determines the frequency of the heat wave effect. Must be an increasing value.
es: `frequency` (float, opcional, predeterminado=1): Determina la frecuencia del efecto de onda de calor. Debe ser un valor creciente.
fr: `frequency` (float, optionnel, défaut=1) : Détermine la fréquence de l'effet des vagues de chaleur. Cela doit être une valeur croissante.

source: `tuple`: A tuple containing:
es: `tuple`: Una tupla que contiene:
fr: `tuple` : Un tuple contenant :

source: A 24-bit Pygame surface representing the generated light effect.
es: Una superficie de Pygame de 24 bits que representa el efecto de luz generado.
fr: Une surface Pygame 24 bits représentant l'effet lumineux généré.

source: The surface width (`sw`).
es: El ancho de la superficie (`sw`).
fr: La largeur de la surface (`sw`).

source: The surface height (`sh`).
es: La altura de la superficie (`sh`).
fr: La hauteur de la surface (`sh`).

source: The output surface does not contain per-pixel alpha information.
es: La superficie de salida no contiene información alfa por píxel.
fr: La surface de sortie ne contient pas d'informations alpha par pixel.

source: Use `BLEND_RGBA_ADD` when blitting the surface to achieve an additive lighting effect.
es: Use `BLEND_RGBA_ADD` al blitear la superficie para lograr un efecto de iluminación aditiva.
fr: Utilisez `BLEND_RGBA_ADD` lors du blitting de la surface pour obtenir un effet de lumière additive.

source: Create a bloom effect on a Pygame surface (compatible 24-bit surface).
es: Crea un efecto de bloom en una superficie de Pygame (superficie compatible de 24 bits).
fr: Crée un effet de bloom sur une surface Pygame (surface 24 bits compatible).

source: **Definition**:
es: **Definición**:
fr: **Définition** :

source: Bloom is a computer graphics effect used in video games, demos, and high dynamic range rendering to reproduce an imaging artifact of real-world cameras. The effect simulates the bright areas of an image glowing and spreading to adjacent areas, enhancing the lighting and visual quality of the scene.
es: Bloom es un efecto de gráficos por computadora utilizado en videojuegos, demos y renderizado de alto rango dinámico para reproducir un artefacto de imagen de cámaras del mundo real. El efecto simula áreas brillantes de una imagen que brillan y se extienden a áreas adyacentes, mejorando la iluminación y la calidad visual de la escena.
fr: Le bloom est un effet de graphisme informatique utilisé dans les jeux vidéo, les démonstrations et le rendu à plage dynamique élevée pour reproduire un artefact d'image des caméras du monde réel. L'effet simule les zones lumineuses d'une image qui brillent et se propagent vers les zones adjacentes, améliorant l'éclairage et la qualité visuelle de la scène.

source: `surface_` (pygame.Surface): A Pygame surface in 24-bit format on which the bloom effect will be applied.
es: `surface_` (pygame.Surface): Una superficie de Pygame en formato de 24 bits sobre la cual se aplicará el efecto de bloom.
fr: `surface_` (pygame.Surface) : Une surface Pygame au format 24 bits sur laquelle l'effet de bloom sera appliqué.

source: `threshold_` (unsigned char): Threshold value used by the bright pass algorithm. Default is 128, and it determines which pixels are considered "bright enough" to contribute to the bloom effect.
es: `threshold_` (unsigned char): Valor de umbral utilizado por el algoritmo de paso brillante. El valor predeterminado es 128 y determina qué píxeles se consideran "lo suficientemente brillantes" para contribuir al efecto de bloom.
fr: `threshold_` (char non signé) : Valeur de seuil utilisée par l'algorithme de passage lumineux. Par défaut, la valeur est 128, et elle détermine quels pixels sont considérés comme "assez lumineux" pour contribuer à l'effet de bloom.

source: `smooth_` (int, optional, default=1): The number of Gaussian blur (5x5) iterations to apply to downscaled images. Increasing this value will create a stronger smoothing effect.
es: `smooth_` (int, opcional, predeterminado=1): El número de iteraciones de desenfoque gaussiano (5x5) para aplicar a las imágenes reducidas. Aumentar este valor creará un efecto de suavizado más fuerte.
fr: `smooth_` (int, optionnel, défaut=1) : Le nombre d'itérations de flou gaussien (5x5) à appliquer aux images réduites. Augmenter cette valeur créera un effet de lissage plus fort.

source: `mask_` (pygame.Surface, optional, default=None): A Pygame surface representing the mask alpha. The alpha values in this mask determine how much of the surface should be affected by the bloom effect. Alpha values of 255 will fully render and bloom the image, while zero will hide the corresponding pixels.
es: `mask_` (pygame.Surface, opcional, predeterminado=None): Una superficie de Pygame que representa el alfa de la máscara. Los valores alfa en esta máscara determinan cuánto de la superficie debe verse afectado por el efecto de bloom. Los valores alfa de 255 renderizarán y aplicarán bloom a la imagen por completo, mientras que cero ocultará los píxeles correspondientes.
fr: `mask_` (pygame.Surface, optionnel, défaut=None) : Une surface Pygame représentant le masque alpha. Les valeurs alpha de ce masque déterminent combien de la surface doit être affectée par l'effet de bloom. Les valeurs alpha de 255 rendent complètement l'image et provoquent un effet de bloom, tandis que zéro masque les pixels correspondants.

source: `fast_` (bool, optional, default=False): If `True`, speeds up the bloom process by using a 16x surface and an optimized bright pass filter, which involves downscaling the texture size by a factor of 4 before processing.
es: `fast_` (bool, opcional, predeterminado=False): Si es `True`, acelera el proceso de bloom utilizando una superficie 16x y un filtro de paso brillante optimizado, lo que implica reducir el tamaño de la textura en un factor de 4 antes del procesamiento.
fr: `fast_` (bool, optionnel, défaut=False) : Si `True`, accélère le processus de bloom en utilisant une surface 16x et un filtre de passage lumineux optimisé, ce qui implique une réduction de la taille de la texture par un facteur de 4 avant le traitement.

source: `pygame.Surface`: A new Pygame surface with the applied bloom effect (24-bit surface).
es: `pygame.Surface`: Una nueva superficie de Pygame con el efecto de bloom aplicado (superficie de 24 bits).
fr: `pygame.Surface` : Une nouvelle surface Pygame avec l'effet de bloom appliqué (surface 24 bits).

source: The function applies a bloom effect by first performing a bright pass on the image, then applying Gaussian blur and blending the result with the original surface.
es: La función aplica un efecto de bloom realizando primero un paso brillante en la imagen, luego aplicando un desenfoque gaussiano y mezclando el resultado con la superficie original.
fr: La fonction applique un effet de bloom en effectuant d'abord un passage lumineux sur l'image, puis en appliquant un flou gaussien et en mélangeant le résultat avec la surface originale.
