Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader_gpu.po
Languages: es, fr

source: Ensure that the grid and block values are optimized for GPU performance.
es: Asegúrese de que los valores de la cuadrícula y el bloque estén optimizados para el rendimiento de la GPU.
fr: Assurez-vous que les valeurs de la grille et du bloc sont optimisées pour les performances du GPU.

source: Apply a brightness adjustment to an image using GPU acceleration.
fr: Appliquez un ajustement de la luminosité à une image en utilisant l'accélération GPU.
