Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: The function is compatible with both 24-bit and 32-bit images. If the dithering process is not applied to the image, check the `format_32` flag. The flag should be set to `True` for images containing per-pixel transparency or equivalent array shapes (w, h, 4). For 24-bit images, set `format_32` to `False` (array shape (w, h, 3)).
es: La función es compatible con imágenes de 24 y 32 bits. Si el proceso de difuminado no se aplica a la imagen, verifica la bandera `format_32`. La bandera debe establecerse en `True` para imágenes que contengan transparencia por píxel o formas de array equivalentes (w, h, 4). Para imágenes de 24 bits, establece `format_32` en `False` (forma del array (w, h, 3)).
fr: La fonction est compatible avec les images 24 bits et 32 bits. Si le processus de dithering n'est pas appliqué à l'image, vérifiez le flag `format_32`. Le flag doit être défini sur `True` pour les images contenant de la transparence par pixel ou des formes de tableau équivalentes (w, h, 4). Pour les images 24 bits, définissez `format_32` sur `False` (forme du tableau (w, h, 3)).

source: `w` (int): The width of the array.
es: `w` (int): El ancho del array.
fr: `w` (int) : La largeur du tableau.

source: `h` (int): The height of the array.
es: `h` (int): La altura del array.
fr: `h` (int) : La hauteur du tableau.

source: `c_buffer` (C-Buffer or memoryviewslice or 1d numpy.ndarray): The 1D array or memory view containing BGR pixels or any other pixel format (datatype uint8).
es: `c_buffer` (C-Buffer o memoryviewslice o numpy.ndarray 1D): El array 1D o vista de memoria que contiene píxeles BGR o cualquier otro formato de píxel (tipo de dato uint8).
fr: `c_buffer` (C-Buffer ou memoryviewslice ou 1d numpy.ndarray) : Le tableau 1D ou la vue mémoire contenant des pixels BGR ou tout autre format de pixel (type de données uint8).

source: `format_32` (bool, optional): - `True` if the array represents a 32-bit image (BGRA format with transparency). - `False` for a 24-bit image (BGR format). The default is `False`.
es: `format_32` (bool, opcional): - `True` si el array representa una imagen de 32 bits (formato BGRA con transparencia). - `False` para una imagen de 24 bits (formato BGR). El valor predeterminado es `False`.
fr: `format_32` (bool, optionnel) : - `True` si le tableau représente une image 32 bits (format BGRA avec transparence). - `False` pour une image 24 bits (format BGR). La valeur par défaut est `False`.

source: `None`: This function modifies the array in place. It does not return a new array.
es: `None`: Esta función modifica el array in situ. No devuelve un nuevo array.
fr: `None` : Cette fonction modifie le tableau sur place. Elle ne retourne pas un nouveau tableau.

source: Pixelate a Pygame Surface
es: Pixelar una superficie de Pygame
fr: Pixelisation d'une surface Pygame

source: Pixelation in computer graphics refers to the effect caused by displaying a bitmap or a section of a bitmap at such a large size that individual pixels become visible. When applied to an image, pixelation reduces the resolution of the image by increasing the size of individual pixels, creating a blocky, pixelated appearance.
es: La pixelación en gráficos por computadora se refiere al efecto causado al mostrar un mapa de bits o una sección de un mapa de bits a un tamaño tan grande que los píxeles individuales se vuelven visibles. Cuando se aplica a una imagen, la pixelación reduce la resolución de la imagen al aumentar el tamaño de los píxeles individuales, creando una apariencia bloqueada y pixelada.
fr: La pixelisation en graphisme informatique désigne l'effet causé par l'affichage d'un bitmap ou d'une section de bitmap à une taille si grande que les pixels individuels deviennent visibles. Lorsqu'elle est appliquée à une image, la pixelisation réduit la résolution de l'image en augmentant la taille des pixels individuels, créant ainsi une apparence de blocs ou de pixels.

source: This function pixelates a Pygame surface by dividing the image into square blocks, with each block representing the average color of the pixels inside it. The block size is specified by the `blocksize_` parameter (default is 64).
es: Esta función pixeliza una superficie de Pygame dividiendo la imagen en bloques cuadrados, donde cada bloque representa el color promedio de los píxeles dentro de él. El tamaño del bloque se especifica con el parámetro `blocksize_` (el valor predeterminado es 64).
fr: Cette fonction pixelise une surface Pygame en divisant l'image en blocs carrés, chaque bloc représentant la couleur moyenne des pixels à l'intérieur. La taille des blocs est spécifiée par le paramètre `blocksize_` (par défaut, 64).

source: `surface_` (pygame.Surface): The Pygame surface to be pixelated.
es: `surface_` (pygame.Surface): La superficie de Pygame que se pixelará.
fr: `surface_` (pygame.Surface) : La surface Pygame à pixeliser.

source: `blocksize_` (unsigned int, optional): The block size used for the pixelation process, default is 64. This value determines the size of each pixelated block (e.g., 64x64 pixel blocks).
es: `blocksize_` (unsigned int, opcional): El tamaño del bloque utilizado para el proceso de pixelación, el valor predeterminado es 64. Este valor determina el tamaño de cada bloque pixelado (por ejemplo, bloques de 64x64 píxeles).
fr: `blocksize_` (int non signé, optionnel) : La taille des blocs utilisée pour le processus de pixelisation, la valeur par défaut est 64. Cette valeur détermine la taille de chaque bloc pixelisé (par exemple, des blocs de 64x64 pixels).

source: `pygame.Surface`: A new surface with the pixelation effect applied.
es: `pygame.Surface`: Una nueva superficie con el efecto de pixelación aplicado.
fr: `pygame.Surface` : Une nouvelle surface avec l'effet de pixelisation appliqué.

source: Alpha Blending
es: Mezcla Alfa
fr: Mélange alpha

source: Blend two images together using alpha blending, where one image is overlaid on top of another with a specified transparency level. The function allows you to blend the `source` image onto the `destination` image based on a percentage value, where 0% means no blending and 100% means full blending of the source image over the destination.
es: Mezcla dos imágenes utilizando mezcla alfa, donde una imagen se superpone sobre otra con un nivel de transparencia especificado. La función permite mezclar la imagen `source` sobre la imagen `destination` según un valor de porcentaje, donde 0% significa que no hay mezcla y 100% significa que la imagen `source` reemplaza completamente la imagen `destination`.
fr: Fusionner deux images à l'aide du mélange alpha, où une image est superposée sur une autre avec un niveau de transparence spécifié. La fonction permet de fusionner l'image `source` sur l'image `destination` en fonction d'une valeur de pourcentage, où 0% signifie aucune fusion et 100% signifie une fusion complète de l'image source sur l'image de destination.

source: `source` (pygame.Surface): The source image (compatible with 24 or 32-bit).
es: `source` (pygame.Surface): La imagen de origen (compatible con 24 o 32 bits).
fr: `source` (pygame.Surface) : L'image source (compatible avec les formats 24 ou 32 bits).

source: `destination` (pygame.Surface): The destination image (compatible with 24 or 32-bit).
es: `destination` (pygame.Surface): La imagen de destino (compatible con 24 o 32 bits).
fr: `destination` (pygame.Surface) : L'image de destination (compatible avec les formats 24 ou 32 bits).

source: `percentage` (float): The percentage value between 0.0 and 100.0 that determines the level of blending. 0.0 means the source image is completely transparent, and 100.0 means the source image completely replaces the destination image.
es: `percentage` (float): El valor de porcentaje entre 0.0 y 100.0 que determina el nivel de mezcla. 0.0 significa que la imagen de origen es completamente transparente, y 100.0 significa que la imagen de origen reemplaza completamente la imagen de destino.
fr: `percentage` (float) : La valeur du pourcentage entre 0,0 et 100,0 qui détermine le niveau de fusion. 0,0 signifie que l'image source est complètement transparente, et 100,0 signifie que l'image source remplace complètement l'image de destination.

source: `pygame.Surface`: A new surface (24-bit) that represents the blended result of the `source` and `destination` images.
es: `pygame.Surface`: Una nueva superficie (24 bits) que representa el resultado mezclado de las imágenes `source` y `destination`.
fr: `pygame.Surface` : Une nouvelle surface (24 bits) représentant le résultat fusionné des images `source` et `destination`.

source: Alpha Blending (1D Array)
es: Mezcla Alfa (Array 1D)
fr: Mélange alpha (tableau 1D)

source: Blend two 1D image buffers together using alpha blending. This method allows you to blend two images by providing the image buffers as the source and destination. The `percentage` argument allows you to control how much of each image contributes to the final result. For example, if `percentage` is set to 25%, the source image will contribute 25% while the destination image contributes 75%.
es: Mezcla dos buffers de imagen 1D utilizando mezcla alfa. Este método permite mezclar dos imágenes proporcionando los buffers de imagen como origen y destino. El argumento `percentage` permite controlar cuánto contribuye cada imagen al resultado final. Por ejemplo, si `percentage` se establece en 25%, la imagen de origen contribuirá un 25% mientras que la imagen de destino contribuirá un 75%.
fr: Fusionner deux tampons d'image 1D à l'aide du mélange alpha. Cette méthode vous permet de fusionner deux images en fournissant les tampons d'images comme source et destination. L'argument `percentage` permet de contrôler l'impact de chaque image sur le résultat final. Par exemple, si `percentage` est défini sur 25%, l'image source contribuera à hauteur de 25% tandis que l'image de destination contribuera à hauteur de 75%.

source: The `modes` argument specifies the pixel format of the source and destination buffers, which can either be 'RGB(X)' or 'BGR(X)', where 'X' refers to the alpha channel if present. The `format_32` argument should be set to `True` if the source and destination buffers contain alpha transparency (RGBA format).
es: El argumento `modes` especifica el formato de píxel de los buffers de origen y destino, que puede ser 'RGB(X)' o 'BGR(X)', donde 'X' se refiere al canal alfa si está presente. El argumento `format_32` debe establecerse en `True` si los buffers de origen y destino contienen transparencia alfa (formato RGBA).
fr: L'argument `modes` spécifie le format des pixels des tampons source et destination, qui peuvent être soit 'RGB(X)' ou 'BGR(X)', où 'X' fait référence au canal alpha si présent. L'argument `format_32` doit être défini sur `True` si les tampons source et destination contiennent de la transparence alpha (format RGBA).

source: `w` (int): Width of the source array.
es: `w` (int): Ancho del array de origen.
fr: `w` (int) : Largeur du tableau source.

source: `h` (int): Height of the source array.
es: `h` (int): Altura del array de origen.
fr: `h` (int) : Hauteur du tableau source.

source: `source` (numpy.ndarray): 1D array of type uint8 representing the source image in RGB(A) or BGR(A) format.
es: `source` (numpy.ndarray): Array 1D de tipo uint8 que representa la imagen de origen en formato RGB(A) o BGR(A).
fr: `source` (numpy.ndarray) : Tableau 1D de type uint8 représentant l'image source en format RGB(A) ou BGR(A).

source: `destination` (numpy.ndarray): 1D array of type uint8 representing the destination image in the same format as `source`.
es: `destination` (numpy.ndarray): Array 1D de tipo uint8 que representa la imagen de destino en el mismo formato que `source`.
fr: `destination` (numpy.ndarray) : Tableau 1D de type uint8 représentant l'image de destination dans le même format que `source`.

source: `percentage` (float): Blending percentage value between 0 and 100. A value of 0 means only the destination image is visible, while 100 means only the source image is visible.
es: `percentage` (float): Valor de porcentaje de mezcla entre 0 y 100. Un valor de 0 significa que solo la imagen de destino es visible, mientras que 100 significa que solo la imagen de origen es visible.
fr: `percentage` (float) : Valeur du pourcentage de fusion entre 0 et 100. Une valeur de 0 signifie que seule l'image de destination est visible, tandis que 100 signifie que seule l'image source est visible.

source: `modes` (str): A string representing the pixel format of the source and destination arrays. Use 'RGB(X)' for RGB or RGBA format and 'BGR(X)' for BGR or BGRA format.
es: `modes` (str): Una cadena que representa el formato de píxel de los arrays de origen y destino. Usa 'RGB(X)' para formato RGB o RGBA y 'BGR(X)' para formato BGR o BGRA.
fr: `modes` (str) : Une chaîne représentant le format des pixels des tableaux source et destination. Utilisez 'RGB(X)' pour le format RGB ou RGBA et 'BGR(X)' pour le format BGR ou BGRA.

source: `format_32` (bool): If `True`, the source and destination arrays contain alpha transparency (RGBA or BGRA format). Default is `False`.
es: `format_32` (bool): Si es `True`, los arrays de origen y destino contienen transparencia alfa (formato RGBA o BGRA). El valor predeterminado es `False`.
fr: `format_32` (bool) : Si `True`, les tableaux source et destination contiennent une transparence alpha (format RGBA ou BGRA). Par défaut, `False`.

source: `pygame.Surface`: A new surface with the blended effect applied, which can be either 24-bit or 32-bit depending on the source and destination array formats.
es: `pygame.Surface`: Una nueva superficie con el efecto de mezcla aplicado, que puede ser de 24 o 32 bits dependiendo de los formatos de los arrays de origen y destino.
fr: `pygame.Surface` : Une nouvelle surface avec l'effet de fusion appliqué, qui peut être soit en format 24 bits, soit en format 32 bits, selon les formats des tableaux source et destination.

source: Alpha Blending (Inplace)
es: Mezcla Alfa (In situ)
fr: Mélange alpha (en place)

source: This function blends the `source` image into the `destination` image, modifying the destination image directly. The `source` and `destination` textures must be of the same size. The `percentage` argument controls how much of each image contributes to the final result. For example, if the `percentage` is set to 25%, the source image will contribute 25% while the destination image will contribute 75%.
es: Esta función mezcla la imagen `source` en la imagen `destination`, modificando la imagen de destino directamente. Las texturas `source` y `destination` deben tener el mismo tamaño. El argumento `percentage` controla cuánto contribuye cada imagen al resultado final. Por ejemplo, si `percentage` se establece en 25%, la imagen de origen contribuirá un 25% mientras que la imagen de destino contribuirá un 75%.
fr: Cette fonction fusionne l'image `source` dans l'image `destination`, modifiant directement l'image de destination. Les textures `source` et `destination` doivent être de la même taille. L'argument `percentage` contrôle la contribution de chaque image au résultat final. Par exemple, si `percentage` est défini sur 25%, l'image source contribuera à hauteur de 25% tandis que l'image de destination contribuera à hauteur de 75%.

source: The function is compatible with both 24-bit and 32-bit surfaces.
es: La función es compatible con superficies de 24 y 32 bits.
fr: La fonction est compatible avec les surfaces 24 bits et 32 bits.

source: `destination` (pygame.Surface): The surface that will be modified, compatible with 24-bit or 32-bit surfaces.
es: `destination` (pygame.Surface): La superficie que se modificará, compatible con superficies de 24 o 32 bits.
fr: `destination` (pygame.Surface) : La surface qui sera modifiée, compatible avec les surfaces 24 bits ou 32 bits.

source: `source` (pygame.Surface): The surface to blend into the destination, compatible with 24-bit or 32-bit surfaces.
es: `source` (pygame.Surface): La superficie que se mezclará en la destino, compatible con superficies de 24 o 32 bits.
fr: `source` (pygame.Surface) : La surface à fusionner dans la destination, compatible avec les surfaces 24 bits ou 32 bits.

source: `percentage` (float): A value between 0.0 and 100.0 indicating the blending percentage. A value of 0.0 means no effect from the source, and 100.0 means the source completely replaces the destination.
es: `percentage` (float): Un valor entre 0.0 y 100.0 que indica el porcentaje de mezcla. Un valor de 0.0 significa que no hay efecto de la imagen de origen, y 100.0 significa que la imagen de origen reemplaza completamente la imagen de destino.
fr: `percentage` (float) : Une valeur entre 0,0 et 100,0 indiquant le pourcentage de fusion. Une valeur de 0,0 signifie aucun effet de la source, et 100,0 signifie que la source remplace complètement la destination.

source: `void`: The operation is performed inplace, meaning the destination surface is modified directly.
es: `void`: La operación se realiza in situ, lo que significa que la superficie de destino se modifica directamente.
fr: `void` : L'opération est effectuée en place, ce qui signifie que la surface de destination est modifiée directement.

source: Apply a cartoon effect to an image.
es: Aplicar un efecto de dibujo animado a una imagen.
fr: Appliquer un effet cartoon à une image.

source: This function applies a cartoon-like effect to a given surface. It utilizes a Sobel filter for edge detection and combines it with median filtering and color reduction to create a simplified and stylized cartoon effect. The function is compatible with both 24-bit and 32-bit images.
es: Esta función aplica un efecto de dibujo animado a una superficie dada. Utiliza un filtro Sobel para la detección de bordes y lo combina con filtrado de mediana y reducción de color para crear un efecto de dibujo animado simplificado y estilizado. La función es compatible con imágenes de 24 y 32 bits.
fr: Cette fonction applique un effet de type cartoon à une surface donnée. Elle utilise un filtre Sobel pour la détection des contours et le combine avec un filtrage médian et une réduction des couleurs pour créer un effet cartoon simplifié et stylisé. La fonction est compatible avec les images 24 bits et 32 bits.

source: `surface_` (pygame.Surface): The surface to which the cartoon effect will be applied. It can be either 24-bit or 32-bit.
es: `surface_` (pygame.Surface): La superficie a la que se aplicará el efecto de dibujo animado. Puede ser de 24 o 32 bits.
fr: `surface_` (pygame.Surface) : La surface à laquelle l'effet cartoon sera appliqué. Elle peut être soit en 24 bits, soit en 32 bits.

source: `sobel_threshold` (unsigned int, optional): The Sobel filter threshold for edge detection. Default is 128.
es: `sobel_threshold` (unsigned int, opcional): El umbral del filtro Sobel para la detección de bordes. El valor predeterminado es 128.
fr: `sobel_threshold` (unsigned int, optionnel) : Le seuil du filtre Sobel pour la détection des contours. Par défaut, 128.

source: `median_kernel` (unsigned int, optional): The size of the kernel used for median filtering. Default is 2.
es: `median_kernel` (unsigned int, opcional): El tamaño del kernel utilizado para el filtrado de mediana. El valor predeterminado es 2.
fr: `median_kernel` (unsigned int, optionnel) : La taille du noyau utilisé pour le filtrage médian. Par défaut, 2.

source: `color` (unsigned int, optional): The maximum color reduction level (i.e., the number of colors in the image after reduction). Default is 8.
es: `color` (unsigned int, opcional): El nivel máximo de reducción de color (es decir, el número de colores en la imagen después de la reducción). El valor predeterminado es 8.
fr: `color` (unsigned int, optionnel) : Le niveau maximal de réduction des couleurs (c'est-à-dire, le nombre de couleurs dans l'image après réduction). Par défaut, 8.

source: `flag` (unsigned int, optional): The blend flag for blending the final cartoon image. Default is `BLEND_RGB_ADD`.
es: `flag` (unsigned int, opcional): La bandera de mezcla para combinar la imagen de dibujo animado final. El valor predeterminado es `BLEND_RGB_ADD`.
fr: `flag` (unsigned int, optionnel) : Le drapeau de fusion pour fusionner l'image cartoon finale. Par défaut, `BLEND_RGB_ADD`.

source: `pygame.Surface`: The input surface with the cartoon effect applied.
es: `pygame.Surface`: La superficie de entrada con el efecto de dibujo animado aplicado.
fr: `pygame.Surface` : La surface d'entrée avec l'effet cartoon appliqué.

source: Convert an image to a reduced color palette of 27 colors (inplace).
es: Convertir una imagen a una paleta de colores reducida de 27 colores (in situ).
fr: Convertir une image en une palette de couleurs réduite de 27 couleurs (en place).

source: This function reduces the color depth of an image by applying an algorithm that converts it to only 27 distinct colors. The operation is performed in place, meaning that the original surface is modified directly.
es: Esta función reduce la profundidad de color de una imagen aplicando un algoritmo que la convierte a solo 27 colores distintos. La operación se realiza in situ, lo que significa que la superficie original se modifica directamente.
fr: Cette fonction réduit la profondeur de couleur d'une image en appliquant un algorithme qui la convertit en seulement 27 couleurs distinctes. L'opération est effectuée en place, ce qui signifie que la surface originale est modifiée directement.

source: `surface_` (pygame.Surface): The surface (image) that will be converted to a reduced color palette. It is compatible with both 24-bit and 32-bit image formats.
es: `surface_` (pygame.Surface): La superficie (imagen) que se convertirá a una paleta de colores reducida. Es compatible con formatos de imagen de 24 y 32 bits.
fr: `surface_` (pygame.Surface) : La surface (image) qui sera convertie en une palette de couleurs réduite. Elle est compatible avec les formats d'images 24 bits et 32 bits.

source: `void`: The function modifies the surface in place and does not return a new surface.
es: `void`: La función modifica la superficie in situ y no devuelve una nueva superficie.
fr: `void` : La fonction modifie la surface en place et ne retourne pas une nouvelle surface.

source: Apply bilateral filtering to an image and return a filtered copy.
es: Aplicar un filtrado bilateral a una imagen y devolver una copia filtrada.
fr: Appliquer un filtrage bilatéral à une image et retourner une copie filtrée.

source: Bilateral filtering is a non-linear, edge-preserving, and noise-reducing smoothing filter. It replaces the intensity of each pixel with a weighted average of intensities from nearby pixels, with weights based on both spatial proximity and intensity similarity. This allows the filter to blur smooth regions while preserving sharp edges.
es: El filtrado bilateral es un filtro de suavizado no lineal que preserva bordes y reduce el ruido. Reemplaza la intensidad de cada píxel con un promedio ponderado de las intensidades de los píxeles cercanos, donde los pesos se basan tanto en la proximidad espacial como en la similitud de intensidad. Esto permite que el filtro difumine regiones suaves mientras preserva los bordes nítidos.
fr: Le filtrage bilatéral est un filtre de lissage non linéaire, préservant les contours et réduisant le bruit. Il remplace l'intensité de chaque pixel par une moyenne pondérée des intensités des pixels voisins, avec des poids basés à la fois sur la proximité spatiale et la similarité d'intensité. Cela permet au filtre de flouter les régions lisses tout en préservant les bords nets.

source: The filter relies on two key parameters:
es: El filtro depende de dos parámetros clave:
fr: Le filtre repose sur deux paramètres clés :
