Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: **shift_** (float) A float value in the range [-1.0, +1.0] controlling the saturation level. A value of 1.0 corresponds to maximum saturation, 0.0 will leave the surface unchanged, and -1.0 will result in no color saturation.
es: **shift_** (flotante) Un valor flotante en el rango [-1.0, +1.0] que controla el nivel de saturación. Un valor de 1.0 corresponde a la saturación máxima, 0.0 dejará la superficie sin cambios, y -1.0 resultará en ausencia de saturación de color.
fr: **shift_** (float) Une valeur flottante dans la plage [-1.0, +1.0] contrôlant le niveau de saturation. Une valeur de 1.0 correspond à la saturation maximale, 0.0 laissera la surface inchangée, et -1.0 entraînera une absence de saturation des couleurs.

source: **None** This function modifies the `surface_` in place, adjusting its saturation.
es: **Ninguno** Esta función modifica la `surface_` en su lugar, ajustando su saturación.
fr: **None** Cette fonction modifie la `surface_` en place, ajustant sa saturation.

source: Saturate 3D array directly (inplace)
es: Saturar array 3D directamente (en su lugar)
fr: Saturer un tableau 3D directement (en place)

source: This function adjusts the saturation level of an image by modifying its 3D array data. The array should be in the `uint8` format with a shape of `(w, h, 3)` and should contain RGB pixel data. Other pixel formats may also be compatible. The resulting image will be in 24-bit format without an alpha layer.
es: Esta función ajusta el nivel de saturación de una imagen modificando los datos de su array 3D. El array debe estar en formato `uint8` con una forma de `(w, h, 3)` y debe contener datos de píxeles RGB. Otros formatos de píxeles también pueden ser compatibles. La imagen resultante estará en formato de 24 bits sin capa alfa.
fr: Cette fonction ajuste le niveau de saturation d'une image en modifiant les données de son tableau 3D. Le tableau doit être au format `uint8` avec une forme de `(w, h, 3)` et doit contenir des données de pixels RGB. D'autres formats de pixels peuvent également être compatibles. L'image résultante sera en format 24 bits sans couche alpha.

source: **rgb_array** (numpy.ndarray) A 3D numpy array (or memory view) with shape `(w, h, 3)` and type `uint8`, containing RGB or another pixel format. It should reference an SDL surface or image data.
es: **rgb_array** (numpy.ndarray) Un array 3D de numpy (o vista de memoria) con forma `(w, h, 3)` y tipo `uint8`, que contiene datos RGB o de otro formato de píxel. Debe hacer referencia a una superficie SDL o a datos de imagen.
fr: **rgb_array** (numpy.ndarray) Un tableau numpy 3D (ou vue mémoire) avec une forme `(w, h, 3)` et un type `uint8`, contenant des données RGB ou un autre format de pixel. Il doit faire référence à une surface SDL ou des données d'image.

source: **shift** (float) A float value in the range [-1.0, +1.0] controlling the saturation level. A value of 1.0 corresponds to maximum saturation, 0.0 leaves the image unchanged, and -1.0 decreases saturation.
es: **shift** (flotante) Un valor flotante en el rango [-1.0, +1.0] que controla el nivel de saturación. Un valor de 1.0 corresponde a la saturación máxima, 0.0 deja la imagen sin cambios, y -1.0 disminuye la saturación.
fr: **shift** (float) Une valeur flottante dans la plage [-1.0, +1.0] contrôlant le niveau de saturation. Une valeur de 1.0 correspond à la saturation maximale, 0.0 laisse l'image inchangée, et -1.0 diminue la saturation.

source: **None** This function modifies the `rgb_array` in place, adjusting the saturation of the referenced image data.
es: **Ninguno** Esta función modifica el `rgb_array` en su lugar, ajustando la saturación de los datos de imagen referenciados.
fr: **None** Cette fonction modifie le `rgb_array` en place, ajustant la saturation des données d'image référencées.

source: Saturate 1D array directly (inplace)
es: Saturar array 1D directamente (en su lugar)
fr: Saturer un tableau 1D directement (en place)

source: This function adjusts the saturation level of an image by modifying its 1D data buffer. The buffer should be in `uint8` format with a shape of `(w,)`, and it can contain RGB(A), BGR(A), or other pixel formats. For 32-bit images, the alpha channel must be at the end of the pixel (e.g., RGB(A) or BGR(A)).
es: Esta función ajusta el nivel de saturación de una imagen modificando su búfer de datos 1D. El búfer debe estar en formato `uint8` con una forma de `(w,)`, y puede contener formatos de píxeles RGB(A), BGR(A) o otros. Para imágenes de 32 bits, el canal alfa debe estar al final del píxel (por ejemplo, RGB(A) o BGR(A)).
fr: Cette fonction ajuste le niveau de saturation d'une image en modifiant son tampon de données 1D. Le tampon doit être au format `uint8` avec une forme de `(w,)`, et il peut contenir des formats de pixels RGB(A), BGR(A) ou d'autres. Pour les images 32 bits, le canal alpha doit être à la fin du pixel (par exemple, RGB(A) ou BGR(A)).

source: **buffer** (numpy.ndarray or memoryviewslice) A 1D array (or memory view) with shape `(w,)` and type `uint8`, containing pixel data in RGB(A), BGR(A), or other formats. This should reference an SDL surface or image buffer.
es: **buffer** (numpy.ndarray o memoryviewslice) Un array 1D (o vista de memoria) con forma `(w,)` y tipo `uint8`, que contiene datos de píxeles en formatos RGB(A), BGR(A) u otros. Este debe hacer referencia a una superficie SDL o a un búfer de imagen.
fr: **buffer** (numpy.ndarray ou memoryviewslice) Un tableau 1D (ou vue mémoire) avec une forme `(w,)` et un type `uint8`, contenant des données de pixels au format RGB(A), BGR(A), ou d'autres formats. Il doit faire référence à une surface SDL ou un tampon d'image.

source: **format_32** (bool, optional) A flag indicating the pixel format: - `True` for 'RGBA' (32-bit format with an alpha channel). - `False` for 'RGB' (24-bit format without alpha).
es: **format_32** (bool, opcional) Un indicador del formato de píxel: - `True` para 'RGBA' (formato de 32 bits con canal alfa). - `False` para 'RGB' (formato de 24 bits sin alfa).
fr: **format_32** (bool, optionnel) Un indicateur du format des pixels : - `True` pour 'RGBA' (format 32 bits avec un canal alpha). - `False` pour 'RGB' (format 24 bits sans alpha).

source: **None** This function modifies the `buffer` in place, adjusting the saturation of the referenced image data. The final image retains the same pixel format as the input image.
es: **Ninguno** Esta función modifica el `buffer` en su lugar, ajustando la saturación de los datos de imagen referenciados. La imagen final conserva el mismo formato de píxel que la imagen de entrada.
fr: **None** Cette fonction modifie le `buffer` en place, ajustant la saturation des données d'image référencées. L'image finale conserve le même format de pixel que l'image d'entrée.

source: Saturate an image using a C-buffer (return copy)
es: Saturar una imagen usando un C-buffer (devolver copia)
fr: Saturer une image en utilisant un C-buffer (retourner une copie)

source: This function adjusts the saturation level of an image by modifying its 1D data buffer, and returns a new array with the adjusted saturation. The `buffer` should be in `uint8` format with a shape of `(w,)`, and can contain RGB(A), BGR(A), or other pixel formats. For 32-bit images, the alpha channel must be placed at the end of the pixel format (e.g., RGB(A) or BGR(A)).
es: Esta función ajusta el nivel de saturación de una imagen modificando su búfer de datos 1D y devuelve un nuevo array con la saturación ajustada. El `buffer` debe estar en formato `uint8` con una forma de `(w,)`, y puede contener formatos de píxeles RGB(A), BGR(A) u otros. Para imágenes de 32 bits, el canal alfa debe colocarse al final del formato de píxel (por ejemplo, RGB(A) o BGR(A)).
fr: Cette fonction ajuste le niveau de saturation d'une image en modifiant son tampon de données 1D et retourne un nouveau tableau avec la saturation ajustée. Le `buffer` doit être au format `uint8` avec une forme de `(w,)`, et peut contenir des formats de pixels RGB(A), BGR(A) ou d'autres formats. Pour les images 32 bits, le canal alpha doit être placé à la fin du format de pixel (par exemple, RGB(A) ou BGR(A)).

source: **numpy.ndarray** A new 1D array with shape `(w,)` and type `uint8`, containing the same pixel format as the input array, but with the adjusted saturation level.
es: **numpy.ndarray** Un nuevo array 1D con forma `(w,)` y tipo `uint8`, que contiene el mismo formato de píxel que el array de entrada, pero con el nivel de saturación ajustado.
fr: **numpy.ndarray** Un nouveau tableau 1D avec une forme `(w,)` et un type `uint8`, contenant le même format de pixel que le tableau d'entrée, mais avec le niveau de saturation ajusté.

source: Heat flow convection
es: Convección de flujo de calor
fr: Convection de flux thermique

source: This function simulates heat flow convection (or convective heat transfer) by applying a Gaussian transformation to an image, creating a vertical flow effect. The transformation is influenced by the parameters, such as amplitude, center, sigma, and mu, which modify the intensity and direction of the effect.
es: Esta función simula la convección de flujo de calor (o transferencia de calor por convección) aplicando una transformación gaussiana a una imagen, creando un efecto de flujo vertical. La transformación se ve influenciada por los parámetros, como amplitud, centro, sigma y mu, que modifican la intensidad y la dirección del efecto.
fr: Cette fonction simule la convection de flux thermique (ou transfert de chaleur convectif) en appliquant une transformation gaussienne à une image, créant un effet de flux vertical. La transformation est influencée par des paramètres, tels que l'amplitude, le centre, sigma, et mu, qui modifient l'intensité et la direction de l'effet.

source: The convection effect can be used to simulate phenomena like air turbulence or heat flow. A periodic variable for `amplitude` (e.g., using a cosine function) can create dynamic, changing effects.
es: El efecto de convección se puede utilizar para simular fenómenos como turbulencia en el aire o flujo de calor. Una variable periódica para `amplitude` (por ejemplo, usando una función coseno) puede crear efectos dinámicos y cambiantes.
fr: L'effet de convection peut être utilisé pour simuler des phénomènes comme la turbulence de l'air ou le flux thermique. Une variable périodique pour `amplitude` (par exemple, en utilisant une fonction cosinus) peut créer des effets dynamiques et changeants.

source: **surface_** (pygame.Surface) A Pygame surface compatible with 24-bit or 32-bit formats. The transformation is applied directly to this surface.
es: **surface_** (pygame.Surface) Una superficie Pygame compatible con formatos de 24 bits o 32 bits. La transformación se aplica directamente a esta superficie.
fr: **surface_** (pygame.Surface) Une surface Pygame compatible avec des formats 24 bits ou 32 bits. La transformation est appliquée directement à cette surface.

source: **amplitude** (float) The maximum amplitude (vertical pixel displacement) of the Gaussian transformation. If amplitude is zero, no transformation will be applied. A periodic function can be used to create a dynamic amplitude.
es: **amplitude** (flotante) La amplitud máxima (desplazamiento vertical de píxeles) de la transformación gaussiana. Si la amplitud es cero, no se aplicará ninguna transformación. Se puede utilizar una función periódica para crear una amplitud dinámica.
fr: **amplitude** (float) L'amplitude maximale (déplacement vertical des pixels) de la transformation gaussienne. Si l'amplitude est zéro, aucune transformation ne sera appliquée. Une fonction périodique peut être utilisée pour créer une amplitude dynamique.

source: **center** (float, optional) The center of the Gaussian transformation. The default is 0.0, which centers the effect.
es: **center** (flotante, opcional) El centro de la transformación gaussiana. El valor predeterminado es 0.0, lo que centra el efecto.
fr: **center** (float, optionnel) Le centre de la transformation gaussienne. La valeur par défaut est 0.0, ce qui centre l'effet.

source: **sigma** (float, optional) The sigma value of the Gaussian equation. A small value creates a narrow effect, while a large value widens the effect. The default is 2.0.
es: **sigma** (flotante, opcional) El valor sigma de la ecuación gaussiana. Un valor pequeño crea un efecto estrecho, mientras que un valor grande amplía el efecto. El valor predeterminado es 2.0.
fr: **sigma** (float, optionnel) La valeur sigma de l'équation gaussienne. Une petite valeur crée un effet étroit, tandis qu'une valeur plus grande élargit l' effet. La valeur par défaut est 2.0.

source: **mu** (float, optional) The mu value of the Gaussian equation. When mu is periodic (e.g., using a cosine function), it allows the effect to move horizontally. The default is 0.0.
es: **mu** (flotante, opcional) El valor mu de la ecuación gaussiana. Cuando mu es periódico (por ejemplo, usando una función coseno), permite que el efecto se mueva horizontalmente. El valor predeterminado es 0.0.
fr: **mu** (float, optionnel) La valeur mu de l'équation gaussienne. Lorsque mu est périodique (par exemple, en utilisant une fonction cosinus), cela permet à l'effet de se déplacer horizontalement. La valeur par défaut est 0.0.

source: **None** The function modifies the `surface_` in place, applying the heat convection effect.
es: **Ninguno** La función modifica la `surface_` en el lugar, aplicando el efecto de convección de calor.
fr: **None** La fonction modifie le `surface_` en place, appliquant l'effet de convection thermique.

source: Horizontal glitch (inplace)
es: Glitch horizontal (en el lugar)
fr: Glitch horizontal (en place)

source: This function applies a horizontal glitch effect to a Pygame surface, deforming the image horizontally based on a signal defined by the given parameters. The effect is achieved by modifying the image's pixels in a glitchy, random manner, influenced by the deformation, frequency, and amplitude parameters.
es: Esta función aplica un efecto glitch horizontal a una superficie de Pygame, deformando la imagen horizontalmente según una señal definida por los parámetros dados. El efecto se logra modificando los píxeles de la imagen de una manera glitch aleatoria, influenciada por los parámetros de deformación, frecuencia y amplitud.
fr: Cette fonction applique un effet de glitch horizontal à une surface Pygame, déformant l'image horizontalement en fonction d'un signal défini par les paramètres donnés. L'effet est obtenu en modifiant les pixels de l'image de manière aléatoire et déformée, en fonction des paramètres de déformation, de fréquence et d'amplitude.

source: **deformation** (float) The angle in radians that controls the variation of the horizontal deformation. This value influences the overall glitch pattern.
es: **deformación** (flotante) El ángulo en radianes que controla la variación de la deformación horizontal. Este valor influye en el patrón general del glitch.
fr: **deformation** (float) L'angle en radians qui contrôle la variation de la déformation horizontale. Cette valeur influence le motif global du glitch.

source: **frequency** (float) A factor that amplifies the angle variation. It determines the rate at which the glitch effect changes over time.
es: **frecuencia** (flotante) Un factor que amplifica la variación del ángulo. Determina la velocidad a la que el efecto glitch cambia con el tiempo.
fr: **fréquence** (float) Un facteur qui amplifie la variation de l'angle. Il détermine le rythme auquel l'effet de glitch change au fil du temps.

source: **amplitude** (float) The amplitude of the cos function used to modulate the glitch effect. A higher amplitude leads to a more intense deformation.
es: **amplitud** (flotante) La amplitud de la función coseno utilizada para modular el efecto glitch. Una mayor amplitud conduce a una deformación más intensa.
fr: **amplitude** (float) L'amplitude de la fonction cosinus utilisée pour moduler l'effet de glitch. Une amplitude plus élevée conduit à une déformation plus intense.

source: **None** The function modifies the `surface_` in place, applying the horizontal glitch effect.
es: **Ninguno** La función modifica la `surface_` en el lugar, aplicando el efecto glitch horizontal.
fr: **None** La fonction modifie le `surface_` en place, appliquant l'effet de glitch horizontal.

source: Glitch for static image background (inplace)
es: Glitch para fondo de imagen estática (en el lugar)
fr: Glitch pour fond d'image statique (en place)

source: This function applies a horizontal glitch effect to a Pygame surface, modifying the image by deforming it based on a signal defined by the deformation, frequency, and amplitude parameters. It creates a glitch effect specifically for static image backgrounds.
es: Esta función aplica un efecto glitch horizontal a una superficie de Pygame, modificando la imagen al deformarla según una señal definida por los parámetros de deformación, frecuencia y amplitud. Crea un efecto glitch específicamente para fondos de imágenes estáticas.
fr: Cette fonction applique un effet de glitch horizontal à une surface Pygame, modifiant l'image en la déformant selon un signal défini par les paramètres de déformation, de fréquence et d'amplitude. Elle crée un effet de glitch spécifiquement pour les fonds d'images statiques.

source: **array_** (numpy.ndarray) A numpy array containing a pixel copy that is used for the glitch effect. This array serves as a reference for the transformation.
es: **array_** (numpy.ndarray) Un arreglo numpy que contiene una copia de píxeles utilizada para el efecto glitch. Este arreglo sirve como referencia para la transformación.
fr: **array_** (numpy.ndarray) Un tableau numpy contenant une copie des pixels utilisée pour l'effet de glitch. Ce tableau sert de référence pour la transformation.

source: **deformation** (float) The angle in radians that controls the variation of the horizontal deformation. This value determines the degree of the glitch effect.
es: **deformación** (flotante) El ángulo en radianes que controla la variación de la deformación horizontal. Este valor determina el grado del efecto glitch.
fr: **déformation** (float) L'angle en radians qui contrôle la variation de la déformation horizontale. Cette valeur détermine le degré de l'effet de glitch.

source: **frequency** (float) A factor that amplifies the angle variation, influencing the rate at which the glitch effect changes over time.
es: **frecuencia** (flotante) Un factor que amplifica la variación del ángulo, influyendo en la velocidad a la que cambia el efecto glitch con el tiempo.
fr: **fréquence** (float) Un facteur qui amplifie la variation de l'angle, influençant le rythme auquel l'effet de glitch change au fil du temps.

source: **amplitude** (float) The amplitude of the cos function that modulates the glitch effect. Higher amplitude results in more intense deformation.
es: **amplitud** (flotante) La amplitud de la función coseno que modula el efecto glitch. Una mayor amplitud da lugar a una deformación más intensa.
fr: **amplitude** (float) L'amplitude de la fonction cosinus qui module l'effet de glitch. Une plus grande amplitude conduit à une déformation plus intense.

source: **None** The function modifies the `surface_` in place, applying the horizontal glitch effect using the provided parameters.
es: **Ninguno** La función modifica la `surface_` en el lugar, aplicando el efecto glitch horizontal usando los parámetros proporcionados.
fr: **None** La fonction modifie le `surface_` en place, appliquant l'effet de glitch horizontal en utilisant les paramètres fournis.

source: BPF, bright pass filter (inplace)
es: BPF, filtro de paso de brillo (en el lugar)
fr: BPF, filtre passe-haut lumineux (en place)

source: This function applies a bright pass filter to a Pygame surface, conserving only the brightest pixels. The pixels that fall below the specified brightness threshold are excluded from the surface, effectively brightening the image.
es: Esta función aplica un filtro de paso de brillo a una superficie de Pygame, conservando solo los píxeles más brillantes. Los píxeles que caen por debajo del umbral de brillo especificado se excluyen de la superficie, aclarando efectivamente la imagen.
fr: Cette fonction applique un filtre passe-haut lumineux à une surface Pygame, conservant uniquement les pixels les plus lumineux. Les pixels dont la luminosité est inférieure au seuil spécifié sont exclus de la surface, éclaircissant ainsi l'image.

source: **threshold** (int) The bright pass threshold, with a default value of 128. Pixels with brightness below this threshold will be excluded from the transformation.
es: **umbral** (entero) El umbral de paso de brillo, con un valor predeterminado de 128. Los píxeles con brillo por debajo de este umbral serán excluidos de la transformación.
fr: **seuil** (int) Le seuil passe-haut lumineux, avec une valeur par défaut de 128. Les pixels dont la luminosité est inférieure à ce seuil seront exclus de la transformation.

source: **None** This function modifies the `surface_` in place by applying the bright pass filter.
es: **Ninguno** Esta función modifica la `surface_` en el lugar aplicando el filtro de paso de brillo.
fr: **None** Cette fonction modifie le `surface_` en place en appliquant le filtre passe-haut lumineux.

source: Create a bloom effect (inplace)
es: Crear un efecto de resplandor (en el lugar)
fr: Créer un effet bloom (en place)

source: This function applies a bloom effect to a Pygame surface or image. The bloom effect brightens the image and adds a glowing effect around bright areas. The effect can be selectively filtered using a mask, and performance can be improved with the fast option at the cost of reduced effect appearance.
es: Esta función aplica un efecto de resplandor a una superficie o imagen de Pygame. El efecto de resplandor aclara la imagen y añade un efecto de brillo alrededor de las áreas brillantes. El efecto puede ser filtrado selectivamente usando una máscara, y el rendimiento se puede mejorar con la opción rápida a costa de reducir la apariencia del efecto.
fr: Cette fonction applique un effet bloom à une surface Pygame ou une image. L'effet bloom éclaircit l'image et ajoute un effet lumineux autour des zones lumineuses. L'effet peut être filtré sélectivement à l'aide d'un masque, et les performances peuvent être améliorées avec l'option rapide, au prix d'une réduction de l'apparence de l'effet.

source: **surface_** (pygame.Surface) A Pygame surface compatible with 24-bit or 32-bit formats. This surface will be transformed in place by applying the bloom effect.
es: **surface_** (pygame.Surface) Una superficie de Pygame compatible con formatos de 24 bits o 32 bits. Esta superficie será transformada en el lugar aplicando el efecto de resplandor.
fr: **surface_** (pygame.Surface) Une surface Pygame compatible avec les formats 24 bits ou 32 bits. Cette surface sera transformée sur place en appliquant l'effet bloom.

source: **threshold_** (int) An integer threshold value in the range [0...255]. This value is used to detect bright pixels within the texture or image to apply the bloom effect.
es: **umbral_** (entero) Un valor de umbral en el rango [0...255]. Este valor se usa para detectar píxeles brillantes dentro de la textura o imagen para aplicar el efecto de resplandor.
fr: **threshold_** (int) Une valeur de seuil entière dans la plage [0...255]. Cette valeur est utilisée pour détecter les pixels lumineux dans la texture ou l'image pour appliquer l'effet bloom.
