Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: **Parameters**: - `surface_` (pygame.Surface): The surface (display or game screen) that will be modified by the dirt lens effect. It must be in a 24-bit or 32-bit format. - `lens_model_` (pygame.Surface): The lens model texture (e.g., dirt lens) to be applied to the surface. You can choose from various lens textures provided in the Assets directory. These textures must be resized to fit the display dimensions. - `flag_` (int, optional): The blending flag to apply to the lens texture. Default is `pygame.BLEND_RGB_ADD`, which adds the lens texture on top of the surface. You can use other Pygame blending flags like `BLEND_RGB_MAX`, etc. - `light_` (float, optional): A float value between -1.0 and 0.2 that adjusts the brightness of the lens texture. Values less than 0 will reduce the lens effect, while values greater than 0 will brighten the display and increase the dirt lens effect. Default is 0.0.
es: **Parámetros**: - `surface_` (pygame.Surface): La superficie (pantalla o pantalla del juego) que se modificará con el efecto de lente sucia. Debe estar en un formato de 24 o 32 bits. - `lens_model_` (pygame.Surface): La textura del modelo de lente (por ejemplo, lente sucia) que se aplicará a la superficie. Puedes elegir entre varias texturas de lente proporcionadas en el directorio Assets. Estas texturas deben redimensionarse para ajustarse a las dimensiones de la pantalla. - `flag_` (int, opcional): La bandera de mezcla que se aplicará a la textura de la lente. El valor predeterminado es `pygame.BLEND_RGB_ADD`, que añade la textura de la lente sobre la superficie. Puedes usar otras banderas de mezcla de Pygame como `BLEND_RGB_MAX`, etc. - `light_` (float, opcional): Un valor flotante entre -1.0 y 0.2 que ajusta el brillo de la textura de la lente. Valores menores que 0 reducirán el efecto de la lente, mientras que valores mayores que 0 aumentarán el brillo de la pantalla y el efecto de lente sucia. El valor predeterminado es 0.0.
fr: **Paramètres** : - `surface_` (pygame.Surface) : La surface (affichage ou écran de jeu) qui sera modifiée par l'effet de lentille sale. Elle doit être en format 24 bits ou 32 bits. - `lens_model_` (pygame.Surface) : La texture du modèle de lentille (par exemple, lentille sale) à appliquer à la surface. Vous pouvez choisir parmi diverses textures de lentilles fournies dans le dossier des ressources. Ces textures doivent être redimensionnées pour correspondre aux dimensions de l'affichage. - `flag_` (int, optionnel) : Le paramètre de fusion à appliquer à la texture de la lentille. La valeur par défaut est `pygame.BLEND_RGB_ADD`, qui ajoute la texture de lentille au-dessus de la surface. Vous pouvez utiliser d'autres paramètres de fusion Pygame comme `BLEND_RGB_MAX`, etc. - `light_` (float, optionnel) : Une valeur flottante comprise entre -1.0 et 0.2 qui ajuste la luminosité de la texture de la lentille. Des valeurs inférieures à 0 réduiront l'effet de lentille, tandis que des valeurs supérieures à 0 éclaireront l'affichage et augmenteront l'effet de lentille sale. La valeur par défaut est 0.0.

source: **Returns**: - `None`: This function modifies the input surface in-place and does not return a new object.
es: **Retorna**: - `None`: Esta función modifica la superficie de entrada in situ y no devuelve un nuevo objeto.
fr: **Retour** : - `None` : Cette fonction modifie la surface d'entrée sur place et ne retourne pas un nouvel objet.

source: Dithering Floyd-Steinberg (copy).
es: Difuminado Floyd-Steinberg (copia).
fr: Dithering Floyd-Steinberg (copie).

source: This function applies the Floyd-Steinberg dithering algorithm to a Pygame surface to create the illusion of color depth in images with a limited color palette. Dithering approximates colors that are not available in the palette by diffusing colored pixels from within the available palette. The result is a dithered image with a characteristic graininess or speckled appearance.
es: Esta función aplica el algoritmo de difuminado Floyd-Steinberg a una superficie de Pygame para crear la ilusión de profundidad de color en imágenes con una paleta de colores limitada. El difuminado aproxima colores que no están disponibles en la paleta difundiendo píxeles de color dentro de la paleta disponible. El resultado es una imagen difuminada con una apariencia característica de granulosidad o moteado.
fr: Cette fonction applique l'algorithme de dithering Floyd-Steinberg à une surface Pygame pour créer l'illusion de profondeur de couleur dans des images avec une palette de couleurs limitée. Le dithering approxime les couleurs qui ne sont pas disponibles dans la palette en diffusant des pixels colorés à partir de la palette disponible. Le résultat est une image en dithering avec une apparence granuleuse ou tachetée caractéristique.

source: The input image is converted from a Pygame surface to a 3D array (w, h, 3) with a float data type. As the image is converted to a different data type (from `uint8` to `float32`), the transformation is not applied in place, and a copy of the original image (without the alpha channel) is returned.
es: La imagen de entrada se convierte de una superficie de Pygame a un array 3D (w, h, 3) con un tipo de dato float. Como la imagen se convierte a un tipo de dato diferente (de `uint8` a `float32`), la transformación no se aplica in situ, y se devuelve una copia de la imagen original (sin el canal alfa).
fr: L'image d'entrée est convertie d'une surface Pygame en un tableau 3D (w, h, 3) avec un type de données flottant. Comme l'image est convertie en un autre type de données (de `uint8` à `float32`), la transformation n'est pas appliquée sur place, et une copie de l'image originale (sans le canal alpha) est retournée.

source: **Parameters**: - `surface_` (pygame.Surface): A Pygame surface object in 24-bit or 32-bit format. The surface to be dithered.
es: **Parámetros**: - `surface_` (pygame.Surface): Un objeto de superficie de Pygame en formato de 24 o 32 bits. La superficie que se difuminará.
fr: **Paramètres** : - `surface_` (pygame.Surface) : Un objet surface Pygame en format 24 bits ou 32 bits. La surface à dither.

source: **Returns**: - `pygame.Surface`: A new Pygame surface in 24-bit format (without the alpha channel) representing the dithered version of the input image.
es: **Retorna**: - `pygame.Surface`: Una nueva superficie de Pygame en formato de 24 bits (sin el canal alfa) que representa la versión difuminada de la imagen de entrada.
fr: **Retour** : - `pygame.Surface` : Une nouvelle surface Pygame en format 24 bits (sans le canal alpha) représentant la version en dithering de l'image d'entrée.

source: Dithering Floyd-Steinberg (inplace).
es: Difuminado Floyd-Steinberg (in situ).
fr: Dithering Floyd-Steinberg (sur place).

source: This function applies the Floyd-Steinberg dithering algorithm to a Pygame surface to create the illusion of color depth in images with a limited color palette. Dithering approximates colors that are not available in the palette by diffusing colored pixels from within the available palette. The result is a dithered image with a characteristic graininess or speckled appearance. Unlike the non-inplace version, this function modifies the image surface in place.
es: Esta función aplica el algoritmo de difuminado Floyd-Steinberg a una superficie de Pygame para crear la ilusión de profundidad de color en imágenes con una paleta de colores limitada. El difuminado aproxima colores que no están disponibles en la paleta difundiendo píxeles de color dentro de la paleta disponible. El resultado es una imagen difuminada con una apariencia característica de granulosidad o moteado. A diferencia de la versión no in situ, esta función modifica la superficie de la imagen in situ.
fr: Cette fonction applique l'algorithme de dithering Floyd-Steinberg à une surface Pygame pour créer l'illusion de profondeur de couleur dans des images avec une palette de couleurs limitée. Le dithering approxime les couleurs qui ne sont pas disponibles dans la palette en diffusant des pixels colorés à partir de la palette disponible. Le résultat est une image en dithering avec une apparence granuleuse ou tachetée caractéristique. Contrairement à la version non-sur-place, cette fonction modifie directement la surface de l'image.

source: The input image is converted from a Pygame surface to a 3D array (w, h, 3) with a float data type. The image is modified directly, and no new object is returned.
es: La imagen de entrada se convierte de una superficie de Pygame a un array 3D (w, h, 3) con un tipo de dato float. La imagen se modifica directamente y no se devuelve un nuevo objeto.
fr: L'image d'entrée est convertie d'une surface Pygame en un tableau 3D (w, h, 3) avec un type de données flottant. L'image est modifiée directement, et aucun nouvel objet n'est retourné.

source: **Returns**: - `None`: The input surface is modified in place (i.e., no new surface is returned).
es: **Retorna**: - `None`: La superficie de entrada se modifica in situ (es decir, no se devuelve una nueva superficie).
fr: **Retour** : - `None` : La surface d'entrée est modifiée sur place (c'est-à-dire qu'aucune nouvelle surface n'est retournée).

source: Dithering Floyd-Steinberg (inplace) on a 1D array.
es: Difuminado Floyd-Steinberg (in situ) en un array 1D.
fr: Dithering Floyd-Steinberg (sur place) sur un tableau 1D.

source: This function applies the Floyd-Steinberg dithering algorithm to a 1D array, simulating the illusion of color depth in images with a limited color palette. Dithering approximates colors that are not available in the palette by diffusing colored pixels from within the available palette. The result is a dithered image with a characteristic graininess or speckled appearance. This function modifies the input array in place.
es: Esta función aplica el algoritmo de difuminado Floyd-Steinberg a un array 1D, simulando la ilusión de profundidad de color en imágenes con una paleta de colores limitada. El difuminado aproxima colores que no están disponibles en la paleta difundiendo píxeles de color dentro de la paleta disponible. El resultado es una imagen difuminada con una apariencia característica de granulosidad o moteado. Esta función modifica el array de entrada in situ.
fr: Cette fonction applique l'algorithme de dithering Floyd-Steinberg à un tableau 1D, simulant l'illusion de profondeur de couleur dans des images avec une palette de couleurs limitée. Le dithering approxime les couleurs qui ne sont pas disponibles dans la palette en diffusant des pixels colorés à partir de la palette disponible. Le résultat est une image en dithering avec une apparence granuleuse ou tachetée caractéristique. Cette fonction modifie le tableau d'entrée sur place.

source: The dithering process can handle both 24-bit and 32-bit images, with the `format_32` flag indicating whether the input is a 32-bit image (with transparency) or a 24-bit image.
es: El proceso de difuminado puede manejar imágenes de 24 y 32 bits, con la bandera `format_32` indicando si la entrada es una imagen de 32 bits (con transparencia) o una imagen de 24 bits.
fr: Le processus de dithering peut traiter des images 24 bits et 32 bits, avec le paramètre `format_32` indiquant si l'entrée est une image 32 bits (avec transparence) ou une image 24 bits.

source: `w` (int): The width of the image array.
es: `w` (int): El ancho del array de la imagen.
fr: `w` (int) : La largeur du tableau d'image.

source: `h` (int): The height of the image array.
es: `h` (int): La altura del array de la imagen.
fr: `h` (int) : La hauteur du tableau d'image.

source: `bgr_array` (numpy.ndarray): A 1D array with shape `(w, h, 3)` for 24-bit images (BGR) or `(w, h, 4)` for 32-bit images (BGRA).
es: `bgr_array` (numpy.ndarray): Un array 1D con forma `(w, h, 3)` para imágenes de 24 bits (BGR) o `(w, h, 4)` para imágenes de 32 bits (BGRA).
fr: `bgr_array` (numpy.ndarray) : Un tableau 1D avec la forme `(w, h, 3)` pour les images 24 bits (BGR) ou `(w, h, 4)` pour les images 32 bits (BGRA).

source: `format_32` (bool, optional): A flag indicating the image format. Set to `True` for 32-bit (BGRA) images, or `False` for 24-bit (BGR) images. The default is `False`.
es: `format_32` (bool, opcional): Una bandera que indica el formato de la imagen. Establece `True` para imágenes de 32 bits (BGRA) o `False` para imágenes de 24 bits (BGR). El valor predeterminado es `False`.
fr: `format_32` (booléen, optionnel) : Un indicateur du format de l'image. Défini sur `True` pour les images 32 bits (BGRA), ou `False` pour les images 24 bits (BGR). Par défaut, il est `False`.

source: **Returns**: - `None`: This function modifies the input array in place (i.e., no new array is returned).
es: **Retorna**: - `None`: Esta función modifica el array de entrada in situ (es decir, no se devuelve un nuevo array).
fr: **Retour** : - `None` : Cette fonction modifie le tableau d'entrée sur place (c'est-à-dire qu'aucun nouveau tableau n'est retourné).

source: Dithering Floyd-Steinberg (copy) on a 1D array.
es: Difuminado Floyd-Steinberg (copia) en un array 1D.
fr: Dithering Floyd-Steinberg (copie) sur un tableau 1D.

source: This function applies the Floyd-Steinberg dithering algorithm to a 1D array, simulating the illusion of color depth in images with a limited color palette. Dithering approximates colors that are not available in the palette by diffusing colored pixels from within the available palette. The result is a dithered image with a characteristic graininess or speckled appearance. Unlike `dithering1d`, this function returns a new array with the dithering effect applied, rather than modifying the array in place.
es: Esta función aplica el algoritmo de difuminado Floyd-Steinberg a un array 1D, simulando la ilusión de profundidad de color en imágenes con una paleta de colores limitada. El difuminado aproxima colores que no están disponibles en la paleta difundiendo píxeles de color dentro de la paleta disponible. El resultado es una imagen difuminada con una apariencia característica de granulosidad o moteado. A diferencia de `dithering1d`, esta función devuelve un nuevo array con el efecto de difuminado aplicado, en lugar de modificar el array in situ.
fr: Cette fonction applique l'algorithme de dithering Floyd-Steinberg à un tableau 1D, simulant l'illusion de profondeur de couleur dans des images avec une palette de couleurs limitée. Le dithering approxime les couleurs qui ne sont pas disponibles dans la palette en diffusant des pixels colorés à partir de la palette disponible. Le résultat est une image en dithering avec une apparence granuleuse ou tachetée caractéristique. Contrairement à `dithering1d`, cette fonction retourne un nouveau tableau avec l'effet de dithering appliqué, plutôt que de modifier le tableau sur place.

source: The dithering process can handle both 24-bit and 32-bit images. The `format_32` flag indicates whether the input is a 32-bit image (with transparency) or a 24-bit image.
es: El proceso de difuminado puede manejar imágenes de 24 y 32 bits. La bandera `format_32` indica si la entrada es una imagen de 32 bits (con transparencia) o una imagen de 24 bits.
fr: Le processus de dithering peut traiter des images 24 bits et 32 bits. Le paramètre `format_32` indique si l'entrée est une image 32 bits (avec transparence) ou une image 24 bits.

source: `rgb_array` (numpy.ndarray): A 1D array with shape `(w, h, 3)` for 24-bit images (RGB) or `(w, h, 4)` for 32-bit images (RGBA).
es: `rgb_array` (numpy.ndarray): Un array 1D con forma `(w, h, 3)` para imágenes de 24 bits (RGB) o `(w, h, 4)` para imágenes de 32 bits (RGBA).
fr: `rgb_array` (numpy.ndarray) : Un tableau 1D avec la forme `(w, h, 3)` pour les images 24 bits (RGB) ou `(w, h, 4)` pour les images 32 bits (RGBA).

source: `format_32` (bool, optional): A flag indicating the image format. Set to `True` for 32-bit (RGBA) images, or `False` for 24-bit (RGB) images. The default is `False`.
es: `format_32` (bool, opcional): Una bandera que indica el formato de la imagen. Establece `True` para imágenes de 32 bits (RGBA) o `False` para imágenes de 24 bits (RGB). El valor predeterminado es `False`.
fr: `format_32` (booléen, optionnel) : Un indicateur du format de l'image. Défini sur `True` pour les images 32 bits (RGBA), ou `False` pour les images 24 bits (RGB). Par défaut, il est `False`.

source: `numpy.ndarray`: A new 1D array with the dithering effect applied. The array shape is `(w, h, 3)` for 24-bit images or `(w, h, 4)` for 32-bit images.
es: `numpy.ndarray`: Un nuevo array 1D con el efecto de difuminado aplicado. La forma del array es `(w, h, 3)` para imágenes de 24 bits o `(w, h, 4)` para imágenes de 32 bits.
fr: `numpy.ndarray` : Un nouveau tableau 1D avec l'effet de dithering appliqué. La forme du tableau est `(w, h, 3)` pour les images 24 bits ou `(w, h, 4)` pour les images 32 bits.

source: Dithering Atkinson (copy)
es: Difuminado Atkinson (copia)
fr: Dithering Atkinson (copie)

source: Atkinson dithering is a variant of Floyd–Steinberg dithering, developed by Bill Atkinson at Apple Computer and used in the original Macintosh computer. This dithering technique is used to create the illusion of "color depth" in images with a limited color palette, also known as color quantization. Colors that are not available in the palette are approximated by diffusing colored pixels from within the available palette. The human eye perceives this diffusion as a mixture of the colors, often resulting in a characteristic grainy or speckled appearance.
es: El difuminado Atkinson es una variante del difuminado Floyd-Steinberg, desarrollado por Bill Atkinson en Apple Computer y utilizado en la computadora Macintosh original. Esta técnica de difuminado se utiliza para crear la ilusión de "profundidad de color" en imágenes con una paleta de colores limitada, también conocida como cuantización de color. Los colores que no están disponibles en la paleta se aproximan difundiendo píxeles de color dentro de la paleta disponible. El ojo humano percibe esta difusión como una mezcla de los colores, lo que a menudo resulta en una apariencia característica de granulosidad o moteado.
fr: Le dithering Atkinson est une variante du dithering Floyd-Steinberg, développé par Bill Atkinson chez Apple Computer et utilisé dans l'ordinateur Macintosh original. Cette technique de dithering est utilisée pour créer l'illusion de "profondeur de couleur" dans des images avec une palette de couleurs limitée, également connue sous le nom de quantification des couleurs. Les couleurs qui ne sont pas disponibles dans la palette sont approximées en diffusant des pixels colorés à partir de la palette disponible. L'œil humain perçoit cette diffusion comme un mélange des couleurs, ce qui entraîne souvent une apparence granuleuse ou tachetée caractéristique.

source: This function applies Atkinson dithering to an image represented by a Pygame surface. The image is converted to a 3D array format with the shape `(w, h, 3)` and type `float32` (single precision). Since the image is converted to a different data type (from `uint8` to `float32`), the transformation cannot be applied in place.
es: Esta función aplica el difuminado Atkinson a una imagen representada por una superficie de Pygame. La imagen se convierte a un formato de array 3D con la forma `(w, h, 3)` y tipo `float32` (precisión simple). Dado que la imagen se convierte a un tipo de dato diferente (de `uint8` a `float32`), la transformación no se puede aplicar in situ.
fr: Cette fonction applique le dithering Atkinson à une image représentée par une surface Pygame. L'image est convertie en un format de tableau 3D avec la forme `(w, h, 3)` et le type `float32` (précision simple). Puisque l'image est convertie en un type de données différent (de `uint8` à `float32`), la transformation ne peut pas être appliquée sur place.

source: The function returns a new image with the dithering effect applied.
es: La función devuelve una nueva imagen con el efecto de difuminado aplicado.
fr: La fonction retourne une nouvelle image avec l'effet de dithering appliqué.

source: `surface_` (pygame.Surface): A Pygame surface in 24-bit or 32-bit format that will undergo Atkinson dithering.
es: `surface_` (pygame.Surface): Una superficie de Pygame en formato de 24 o 32 bits que se someterá al difuminado Atkinson.
fr: `surface_` (pygame.Surface) : Une surface Pygame au format 24 bits ou 32 bits qui subira le dithering Atkinson.

source: `pygame.Surface`: A new Pygame surface in 24-bit format with the dithering effect applied (without the alpha channel).
es: `pygame.Surface`: Una nueva superficie de Pygame en formato de 24 bits con el efecto de difuminado aplicado (sin el canal alfa).
fr: `pygame.Surface` : Une nouvelle surface Pygame au format 24 bits avec l'effet de dithering appliqué (sans le canal alpha).

source: Atkinson Dithering for 1D Array (inplace)
es: Difuminado Atkinson para Array 1D (in situ)
fr: Dithering Atkinson pour un tableau 1D (sur place)

source: Atkinson dithering is a variant of Floyd–Steinberg dithering, developed by Bill Atkinson at Apple Computer, and used in the original Macintosh computer. This dithering technique is employed to create the illusion of "color depth" in images with a limited color palette, a process also known as color quantization. In a dithered image, colors not available in the palette are approximated by diffusing colored pixels from within the available palette. The human eye perceives this diffusion as a mixture of colors, often leading to a characteristic grainy or speckled appearance.
es: El difuminado Atkinson es una variante del difuminado Floyd-Steinberg, desarrollado por Bill Atkinson en Apple Computer y utilizado en la computadora Macintosh original. Esta técnica de difuminado se emplea para crear la ilusión de "profundidad de color" en imágenes con una paleta de colores limitada, un proceso también conocido como cuantización de color. En una imagen difuminada, los colores no disponibles en la paleta se aproximan difundiendo píxeles de color dentro de la paleta disponible. El ojo humano percibe esta difusión como una mezcla de colores, lo que a menudo resulta en una apariencia característica de granulosidad o moteado.
fr: Le dithering Atkinson est une variante du dithering Floyd-Steinberg, développé par Bill Atkinson chez Apple Computer, et utilisé dans l'ordinateur Macintosh original. Cette technique de dithering est utilisée pour créer l'illusion de "profondeur de couleur" dans des images avec une palette de couleurs limitée, un processus également connu sous le nom de quantification des couleurs. Dans une image en dithering, les couleurs non disponibles dans la palette sont approximées en diffusant des pixels colorés à partir de la palette disponible. L'œil humain perçoit cette diffusion comme un mélange des couleurs, ce qui entraîne souvent une apparence granuleuse ou tachetée caractéristique.

source: This function applies Atkinson dithering to an image represented by a 1D array in memory. It operates directly on the array (in-place), modifying the pixel values to achieve the dithering effect.
es: Esta función aplica el difuminado Atkinson a una imagen representada por un array 1D en memoria. Opera directamente sobre el array (in situ), modificando los valores de los píxeles para lograr el efecto de difuminado.
fr: Cette fonction applique le dithering Atkinson à une image représentée par un tableau 1D en mémoire. Elle fonctionne directement sur le tableau (sur place), modifiant les valeurs des pixels pour obtenir l'effet de dithering.
