Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader_gpu.po
Languages: es, fr

source: **percentage_** (*float*): The blending percentage, a value between 0.0 and 100.0, representing the proportion of the source to blend with the destination.
es: **percentage_** (*float*): El porcentaje de mezcla, un valor entre 0.0 y 100.0, que representa la proporción de la fuente que se mezclará con el destino.
fr: **percentage_** (*float*) : Le pourcentage de fusion, une valeur entre 0,0 et 100,0, représentant la proportion de la source à fusionner avec la destination.

source: **pygame.Surface**: A new 24-bit Pygame surface with the blended result.
es: **pygame.Surface**: Una nueva superficie de Pygame de 24 bits con el resultado mezclado.
fr: **pygame.Surface** : Une nouvelle surface Pygame 24 bits avec le résultat fusionné.

source: The function assumes that the source and destination surfaces are of the same size.
es: La función asume que las superficies fuente y destino tienen el mismo tamaño.
fr: La fonction suppose que les surfaces source et destination sont de la même taille.

source: The output surface is converted for fast blitting using the `convert()` method.
es: La superficie de salida se convierte para un blitting rápido utilizando el método `convert()`.
fr: La surface de sortie est convertie pour un rendu rapide à l'aide de la méthode `convert()`.

source: The blending mode used is `BLEND_RGB_ADD`, which adds the source color to the destination color. This mode can be adjusted by changing the `flag_` parameter.
es: El modo de mezcla utilizado es `BLEND_RGB_ADD`, que agrega el color de la fuente al color del destino. Este modo se puede ajustar cambiando el parámetro `flag_`.
fr: Le mode de fusion utilisé est `BLEND_RGB_ADD`, qui ajoute la couleur source à la couleur de destination. Ce mode peut être ajusté en modifiant le paramètre `flag_`.

source: Apply a sharpening filter to the given pygame.Surface image using a generic filter kernel.
es: Aplica un filtro de enfoque a la imagen pygame.Surface dada utilizando un kernel de filtro genérico.
fr: Appliquer un filtre de netteté à l'image pygame.Surface donnée à l'aide d'un noyau de filtre générique.

source: The function sharpens the input image by applying a sharpening kernel to each RGB channel (red, green, blue) independently. The sharpened image is returned as a 24-bit pygame.Surface format.
es: La función enfoca la imagen de entrada aplicando un kernel de enfoque a cada canal RGB (rojo, verde, azul) de forma independiente. La imagen enfocada se devuelve en formato pygame.Surface de 24 bits.
fr: La fonction aiguise l'image d'entrée en appliquant un noyau de netteté à chaque canal RGB (rouge, vert, bleu) indépendamment. L'image aiguisée est retournée au format pygame.Surface 24 bits.

source: **surface_** (*pygame.Surface*): A pygame surface object that represents the input image to be sharpened.
es: **surface_** (*pygame.Surface*): Un objeto de superficie pygame que representa la imagen de entrada que se enfocará.
fr: **surface_** (*pygame.Surface*) : Un objet surface Pygame représentant l'image d'entrée à aiguiser.

source: **pygame.Surface**: A new pygame surface with the sharpened image in 24-bit format (RGB).
es: **pygame.Surface**: Una nueva superficie pygame con la imagen enfocada en formato de 24 bits (RGB).
fr: **pygame.Surface** : Une nouvelle surface Pygame avec l'image aiguisée au format 24 bits (RGB).

source: **ValueError**: If the input surface is not a valid pygame.Surface or has zero dimensions.
es: **ValueError**: Si la superficie de entrada no es una pygame.Surface válida o tiene dimensiones cero.
fr: **ValueError** : Si la surface d'entrée n'est pas une pygame.Surface valide ou a des dimensions nulles.

source: The sharpening effect is achieved through convolution with a sharpening kernel.
es: El efecto de enfoque se logra mediante la convolución con un kernel de enfoque.
fr: L'effet de netteté est obtenu par convolution avec un noyau de netteté.

source: Apply a water drop (ripple) effect to a texture using GPU acceleration.
es: Aplica un efecto de gota de agua (ondulación) a una textura utilizando aceleración por GPU.
fr: Appliquez un effet de goutte d'eau (vague) à une texture en utilisant l'accélération GPU.

source: This function uses a CUDA kernel (`ripple_kernel`) to compute the ripple effect on the texture. It works by manipulating the `previous` and `current` state of the ripple effect and applying it to the texture. The effect is computed in parallel on the GPU, making it efficient for handling large textures or simulations.
es: Esta función utiliza un kernel CUDA (`ripple_kernel`) para calcular el efecto de ondulación en la textura. Funciona manipulando el estado `previous` y `current` del efecto de ondulación y aplicándolo a la textura. El efecto se calcula en paralelo en la GPU, lo que lo hace eficiente para manejar texturas grandes o simulaciones.
fr: Cette fonction utilise un noyau CUDA (`ripple_kernel`) pour calculer l'effet de vague sur la texture. Elle fonctionne en manipulant l'état `précédent` et `actuel` de l'effet de vague et en l'appliquant à la texture. L'effet est calculé en parallèle sur le GPU, ce qui le rend efficace pour le traitement de grandes textures ou simulations.

source: **grid** (*tuple*): Tuple defining the grid size for CUDA kernel execution, e.g., (25, 25). The grid size should match the texture size for efficient parallel processing.
es: **grid** (*tuple*): Tupla que define el tamaño de la cuadrícula para la ejecución del kernel CUDA, por ejemplo, (25, 25). El tamaño de la cuadrícula debe coincidir con el tamaño de la textura para un procesamiento paralelo eficiente.
fr: **grid** (*tuple*): Tuple définissant la taille de la grille pour l'exécution du noyau CUDA, par exemple, (25, 25). La taille de la grille doit correspondre à la taille de la texture pour un traitement parallèle efficace.

source: **block** (*tuple*): Tuple defining the block size for CUDA kernel execution, e.g., (32, 32). The maximum number of threads is 1024 (block_x * block_y).
es: **block** (*tuple*): Tupla que define el tamaño del bloque para la ejecución del kernel CUDA, por ejemplo, (32, 32). El número máximo de hilos es 1024 (block_x * block_y).
fr: **block** (*tuple*): Tuple définissant la taille du bloc pour l'exécution du noyau CUDA, par exemple, (32, 32). Le nombre maximal de threads est 1024 (block_x * block_y).

source: **w** (*int*): The width of the texture and arrays.
es: **w** (*int*): El ancho de la textura y los arreglos.
fr: **w** (*int*): La largeur de la texture et des tableaux.

source: **h** (*int*): The height of the texture and arrays.
es: **h** (*int*): La altura de la textura y los arreglos.
fr: **h** (*int*): La hauteur de la texture et des tableaux.

source: **previous** (*cupy.ndarray*): A CuPy array of shape (w, h), containing the previous state of the ripple effect (float32).
es: **previous** (*cupy.ndarray*): Un arreglo de CuPy con forma (w, h), que contiene el estado anterior del efecto de ondas (float32).
fr: **previous** (*cupy.ndarray*): Un tableau CuPy de forme (w, h), contenant l'état précédent de l'effet de vague (float32).

source: **current** (*cupy.ndarray*): A CuPy array of shape (w, h), containing the current state of the ripple effect (float32).
es: **current** (*cupy.ndarray*): Un arreglo de CuPy con forma (w, h), que contiene el estado actual del efecto de ondas (float32).
fr: **current** (*cupy.ndarray*): Un tableau CuPy de forme (w, h), contenant l'état actuel de l'effet de vague (float32).

source: **texture_array** (*cupy.ndarray*): A CuPy array of shape (w, h, 3), containing the source texture in RGB (uint8).
es: **texture_array** (*cupy.ndarray*): Un arreglo de CuPy con forma (w, h, 3), que contiene la textura de origen en RGB (uint8).
fr: **texture_array** (*cupy.ndarray*): Un tableau CuPy de forme (w, h, 3), contenant la texture source en RGB (uint8).

source: **background_array** (*cupy.ndarray*): A CuPy array of shape (w, h, 3), representing the background texture to apply the effect to (uint8).
es: **background_array** (*cupy.ndarray*): Un arreglo de CuPy con forma (w, h, 3), que representa la textura de fondo a la que se aplicará el efecto (uint8).
fr: **background_array** (*cupy.ndarray*): Un tableau CuPy de forme (w, h, 3), représentant la texture de fond à laquelle appliquer l'effet (uint8).

source: **tuple**: A tuple containing two CuPy arrays, the updated `previous` and `current` states of the ripple effect.
es: **tuple**: Una tupla que contiene dos arreglos de CuPy, los estados actualizados de `previous` y `current` del efecto de ondas.
fr: **tuple** : Un tuple contenant deux tableaux CuPy, les états mis à jour de `previous` et `current` de l'effet de vague.

source: The grid and block sizes must be chosen appropriately based on the texture size and available GPU resources.
es: El tamaño de la cuadrícula y los bloques debe elegirse adecuadamente según el tamaño de la textura y los recursos disponibles de la GPU.
fr: La taille de la grille et du bloc doit être choisie de manière appropriée en fonction de la taille de la texture et des ressources GPU disponibles.

source: The kernel computation is done on the GPU using CuPy for faster execution.
es: El cálculo del kernel se realiza en la GPU utilizando CuPy para una ejecución más rápida.
fr: Le calcul du noyau est effectué sur le GPU à l'aide de CuPy pour une exécution plus rapide.

source: Sharpen an image using a raw kernel.
es: Aumenta la nitidez de una imagen usando un kernel sin procesar.
fr: Aiguisez une image en utilisant un noyau brut.

source: This function sharpens the input image by applying a sharpening kernel to each RGB channel (red, green, blue) independently. The borders are not computed with the kernel (value = 0).
es: Esta función aumenta la nitidez de la imagen de entrada aplicando un kernel de enfoque a cada canal RGB (rojo, verde, azul) de forma independiente. Los bordes no se procesan con el kernel (valor = 0).
fr: Cette fonction aiguise l'image d'entrée en appliquant un noyau de netteté à chaque canal RGB (rouge, vert, bleu) indépendamment. Les bords ne sont pas calculés avec le noyau (valeur = 0).

source: **surface_** (*pygame.Surface*): The input image surface to be sharpened.
es: **surface_** (*pygame.Surface*): La superficie de imagen de entrada a afilar.
fr: **surface_** (*pygame.Surface*): La surface de l'image d'entrée à aiguiser.

source: **grid_** (*tuple*): Grid dimensions for CUDA kernel execution, e.g., (25, 25). The grid values and block values must match the texture and array sizes.
es: **grid_** (*tuple*): Dimensiones de la cuadrícula para la ejecución del kernel de CUDA, por ejemplo, (25, 25). Los valores de la cuadrícula y los bloques deben coincidir con los tamaños de la textura y los arreglos.
fr: **grid_** (*tuple*): Dimensions de la grille pour l'exécution du noyau CUDA, par exemple, (25, 25). Les valeurs de la grille et du bloc doivent correspondre aux tailles de la texture et des tableaux.

source: **block_** (*tuple*): Block dimensions for CUDA kernel execution, e.g., (32, 32). Maximum threads are 1024. Max threads = block_x * block_y.
es: **block_** (*tuple*): Dimensiones de los bloques para la ejecución del kernel de CUDA, por ejemplo, (32, 32). El número máximo de hilos es 1024. Máx. hilos = block_x * block_y.
fr: **block_** (*tuple*): Dimensions du bloc pour l'exécution du noyau CUDA, par exemple, (32, 32). Le nombre maximal de threads est 1024. Threads max = block_x * block_y.

source: **pygame.Surface**: A new Pygame surface with the sharpened image in 24-bit format (RGB).
es: **pygame.Surface**: Una nueva superficie de Pygame con la imagen afilada en formato de 24 bits (RGB).
fr: **pygame.Surface** : Une nouvelle surface Pygame avec l'image affinée en format 24 bits (RGB).

source: Apply a mirror effect to an image using GPU acceleration.
es: Aplica un efecto espejo a una imagen utilizando aceleración GPU.
fr: Appliquez un effet miroir à une image en utilisant l'accélération GPU.

source: This function creates a mirrored version of an image represented as a `pygame.Surface`. It supports 32-bit and 24-bit image formats and outputs a 24-bit format image. The mirror orientation (horizontal or vertical) is controlled using the `format_` parameter.
es: Esta función crea una versión reflejada de una imagen representada como `pygame.Surface`. Admite formatos de imagen de 32 y 24 bits y genera una imagen en formato de 24 bits. La orientación del espejo (horizontal o vertical) se controla mediante el parámetro `format_`.
fr: Cette fonction crée une version miroir d'une image représentée sous la forme d'une `pygame.Surface`. Elle prend en charge les formats d'image 32 bits et 24 bits et génère une image au format 24 bits. L'orientation du miroir (horizontale ou verticale) est contrôlée à l'aide du paramètre `format_`.

source: **surface_** (*pygame.Surface*): The input image as a `pygame.Surface` object.
es: **surface_** (*pygame.Surface*): La imagen de entrada como un objeto `pygame.Surface`.
fr: **surface_** (*pygame.Surface*): L'image d'entrée sous forme d'un objet `pygame.Surface`.

source: **grid_** (*tuple*): Defines the grid dimensions as `(grid_y, grid_x)`, e.g., `(25, 25)`. The grid and block dimensions must match the texture and array sizes.
es: **grid_** (*tuple*): Define las dimensiones de la cuadrícula como `(grid_y, grid_x)`, por ejemplo, `(25, 25)`. Las dimensiones de la cuadrícula y los bloques deben coincidir con los tamaños de la textura y los arreglos.
fr: **grid_** (*tuple*): Définit les dimensions de la grille sous la forme `(grid_y, grid_x)`, par exemple, `(25, 25)`. Les dimensions de la grille et du bloc doivent correspondre aux tailles de la texture et des tableaux.

source: **block_** (*tuple*): Specifies the block dimensions as `(block_y, block_x)`, e.g., `(32, 32)`. The maximum number of threads per block is 1024, following the condition: `Max threads = block_x * block_y`.
es: **block_** (*tuple*): Especifica las dimensiones de los bloques como `(block_y, block_x)`, por ejemplo, `(32, 32)`. El número máximo de hilos por bloque es 1024, siguiendo la condición: `Máx. hilos = block_x * block_y`.
fr: **block_** (*tuple*): Spécifie les dimensions du bloc sous la forme `(block_y, block_x)`, par exemple, `(32, 32)`. Le nombre maximal de threads par bloc est 1024, suivant la condition : `Threads max = block_x * block_y`.

source: **format_** (*bool*, optional, default=`False`): Determines the mirror orientation: - `False` (0) → Horizontal mirroring (default). - `True` (1) → Vertical mirroring.
es: **format_** (*bool*, opcional, por defecto=`False`): Determina la orientación del espejo: - `False` (0) → Reflejo horizontal (por defecto). - `True` (1) → Reflejo vertical.
fr: **format_** (*bool*, optionnel, défaut=`False`): Détermine l'orientation du miroir : - `False` (0) → Miroir horizontal (par défaut). - `True` (1) → Miroir vertical.

source: **pygame.Surface**: A 24-bit `pygame.Surface` with the applied mirror effect.
es: **pygame.Surface**: Un `pygame.Surface` de 24 bits con el efecto espejo aplicado.
fr: **pygame.Surface** : Une `pygame.Surface` 24 bits avec l'effet miroir appliqué.

source: **ValueError**: If `surface_` has an invalid format or dimensions (`w` or `h` is 0).
es: **ValueError**: Si `surface_` tiene un formato o dimensiones no válidas (`w` o `h` es 0).
fr: **ValueError** : Si `surface_` a un format ou des dimensions invalides (si `w` ou `h` est 0).

source: **ValueError**: If `surface_` cannot be referenced as a 3D array.
es: **ValueError**: Si `surface_` no se puede referenciar como un arreglo 3D.
fr: **ValueError** : Si `surface_` ne peut pas être référencé comme un tableau 3D.

source: The function extracts pixel data from `surface_` and converts it into a 3D array.
es: La función extrae los datos de píxeles de `surface_` y los convierte en un arreglo 3D.
fr: La fonction extrait les données des pixels de `surface_` et les convertit en un tableau 3D.

source: The `mirroring_cupy` function performs GPU-accelerated mirroring and returns the processed image.
es: La función `mirroring_cupy` realiza el reflejo acelerado por GPU y devuelve la imagen procesada.
fr: La fonction `mirroring_cupy` effectue un mirroring accéléré par GPU et renvoie l'image traitée.

source: Adjusts the saturation level of a given image using GPU acceleration.
es: Ajusta el nivel de saturación de una imagen dada utilizando aceleración GPU.
fr: Ajuste le niveau de saturation d'une image donnée en utilisant l'accélération GPU.

source: This function modifies the saturation of an image represented as a `pygame.Surface`. It supports 32-bit and 24-bit image formats, producing an output in 24-bit format. The saturation adjustment value must be within the range [-1.0, 1.0].
es: Esta función modifica la saturación de una imagen representada como `pygame.Surface`. Admite formatos de imagen de 32 y 24 bits, generando una salida en formato de 24 bits. El valor de ajuste de saturación debe estar dentro del rango [-1.0, 1.0].
fr: Cette fonction modifie la saturation d'une image représentée sous la forme d'une `pygame.Surface`. Elle prend en charge les formats d'image 32 bits et 24 bits, produisant une sortie au format 24 bits. La valeur d'ajustement de la saturation doit être comprise dans la plage [-1.0, 1.0].

source: **val_** (*float*, optional, default=`1.0`): Saturation adjustment level in the range `[-1.0, 1.0]`. - `-1.0` → Completely desaturated (grayscale). - `0.0` → No change in saturation. - `1.0` → Fully saturated.
es: **val_** (*float*, opcional, por defecto=`1.0`): Nivel de ajuste de saturación en el rango `[-1.0, 1.0]`. - `-1.0` → Completamente desaturado (escala de grises). - `0.0` → Sin cambios en la saturación. - `1.0` → Totalmente saturado.
fr: **val_** (*float*, optionnel, défaut=`1.0`): Niveau d'ajustement de la saturation dans la plage `[-1.0, 1.0]`. - `-1.0` → Complètement désaturé (niveau de gris). - `0.0` → Aucun changement de saturation. - `1.0` → Totalement saturé.

source: **pygame.Surface**: A 24-bit `pygame.Surface` with the adjusted saturation level.
es: **pygame.Surface**: Un `pygame.Surface` de 24 bits con el nivel de saturación ajustado.
fr: **pygame.Surface** : Une `pygame.Surface` 24 bits avec le niveau de saturation ajusté.

source: **ValueError**: If `val_` is outside the range `[-1.0, 1.0]`.
es: **ValueError**: Si `val_` está fuera del rango `[-1.0, 1.0]`.
fr: **ValueError** : Si `val_` est hors de la plage `[-1.0, 1.0]`.

source: The `saturation_cupy` function performs GPU-accelerated saturation adjustment and returns the processed image.
es: La función `saturation_cupy` realiza el ajuste de saturación acelerado por GPU y devuelve la imagen procesada.
fr: La fonction `saturation_cupy` effectue un ajustement de saturation accéléré par GPU et renvoie l'image traitée.

source: Apply a bilateral filter to a 32-bit or 24-bit image using the GPU.
es: Aplica un filtro bilateral a una imagen de 32 o 24 bits usando la GPU.
fr: Appliquez un filtre bilatéral à une image 32 bits ou 24 bits en utilisant le GPU.

source: A bilateral filter is a non-linear, edge-preserving, and noise-reducing smoothing filter. It replaces the intensity of each pixel with a weighted average of nearby pixels, where the weights are determined by both spatial proximity and intensity differences, following a Gaussian distribution.
es: El filtro bilateral es un filtro de suavizado no lineal que conserva los bordes y reduce el ruido. Reemplaza la intensidad de cada píxel con un promedio ponderado de los píxeles cercanos, donde los pesos se determinan tanto por la proximidad espacial como por las diferencias de intensidad, siguiendo una distribución gaussiana.
fr: Un filtre bilatéral est un filtre non linéaire, préservant les bords et réduisant le bruit. Il remplace l'intensité de chaque pixel par une moyenne pondérée des pixels voisins, où les poids sont déterminés à la fois par la proximité spatiale et les différences d'intensité, suivant une distribution gaussienne.

source: The filter parameters (sigma_r & sigma_s) are pre-defined within the GPU kernel. This function is compatible with 32-bit and 24-bit images.
es: Los parámetros del filtro (`sigma_r` y `sigma_s`) están predefinidos dentro del kernel de la GPU. Esta función es compatible con imágenes de 32 y 24 bits.
fr: Les paramètres du filtre (sigma_r & sigma_s) sont prédéfinis dans le noyau GPU. Cette fonction est compatible avec les images 32 bits et 24 bits.

source: **kernel_size_** (*int*): The kernel size, determining the number of neighboring pixels included in the calculation.
es: **kernel_size_** (*int*): Tamaño del kernel, que determina el número de píxeles adyacentes incluidos en el cálculo.
fr: **kernel_size_** (*int*): La taille du noyau, déterminant le nombre de pixels voisins inclus dans le calcul.

source: **pygame.Surface**: A new 24-bit `pygame.Surface` with the bilateral filtering effect applied.
es: **pygame.Surface**: Un `pygame.Surface` nuevo de 24 bits con el efecto de filtrado bilateral aplicado.
fr: **pygame.Surface** : Une nouvelle `pygame.Surface` 24 bits avec l'effet de filtrage bilatéral appliqué.

source: **TypeError**: If `surface_` is not an instance of `pygame.Surface`.
es: **TypeError**: Si `surface_` no es una instancia de `pygame.Surface`.
fr: **TypeError** : Si `surface_` n'est pas une instance de `pygame.Surface`.

source: **ValueError**: If the surface dimensions are zero or if `kernel_size_` is negative.
es: **ValueError**: Si las dimensiones de `surface_` son cero o si `kernel_size_` es negativo.
fr: **ValueError** : Si les dimensions de la surface sont nulles ou si `kernel_size_` est négatif.

source: The `bilateral_cupy` function performs GPU-accelerated bilateral filtering and returns the processed image.
es: La función `bilateral_cupy` realiza el filtrado bilateral acelerado por GPU y devuelve la imagen procesada.
fr: La fonction `bilateral_cupy` effectue un filtrage bilatéral accéléré par GPU et renvoie l'image traitée.

source: Apply an emboss effect to a 32-bit or 24-bit image using a 5x5 convolution kernel.
es: Aplica un efecto de relieve a una imagen de 32 o 24 bits utilizando un kernel de convolución 5x5.

source: The embossing kernel used:
es: El kernel de relieve utilizado:
fr: Le noyau d'embossage utilisé :

source: Each RGB channel of the input image is processed independently using convolution. The input image must be in 32-bit or 24-bit format, and the output will be a 24-bit image.
es: Cada canal RGB de la imagen de entrada se procesa de forma independiente mediante convolución. La imagen de entrada debe estar en formato de 32 o 24 bits, y la salida será una imagen de 24 bits.
fr: Chaque canal RGB de l'image d'entrée est traité indépendamment à l'aide d'une convolution. L'image d'entrée doit être au format 32 bits ou 24 bits, et l'image de sortie sera en 24 bits.

source: **pygame.Surface**: A new 24-bit `pygame.Surface` with the emboss effect applied.
es: **pygame.Surface**: Un `pygame.Surface` nuevo de 24 bits con el efecto de relieve aplicado.
fr: **pygame.Surface** : Un nouveau `pygame.Surface` en 24 bits avec l'effet d'embossage appliqué.

source: **ValueError**: If the surface's pixel data cannot be accessed or if its width/height is zero.
es: **ValueError**: Si no se puede acceder a los datos de píxeles de `surface_` o si su ancho/alto es cero.
fr: **ValueError** : Si les données de pixels de la surface ne peuvent pas être accessibles ou si sa largeur/hauteur est nulle.

source: The `emboss_cupy` function performs GPU-accelerated embossing and returns the processed image.
es: La función `emboss_cupy` realiza el efecto de relieve acelerado por GPU y devuelve la imagen procesada.
fr: La fonction `emboss_cupy` applique un embossage accéléré par GPU et renvoie l'image traitée.
