Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: This function modifies the input surface directly, without creating a new one.
es: Esta función modifica la superficie de entrada directamente, sin crear una nueva.
fr: Cette fonction modifie directement la surface d'entrée, sans créer de nouvelle surface.

source: Convert image into greyscale using YIQ (luma information).
es: Convertir imagen a escala de grises usando YIQ (información de luminancia).
fr: Convertir l'image en niveaux de gris en utilisant YIQ (information de luminance).

source: This function converts the provided image into a greyscale image by utilizing the YIQ color model, which focuses on the luma (brightness) information. The function modifies the input image in place.
es: Esta función convierte la imagen proporcionada en una imagen en escala de grises utilizando el modelo de color YIQ, que se centra en la información de luminancia (brillo). La función modifica la imagen de entrada in situ.
fr: Cette fonction convertit l'image fournie en une image en niveaux de gris en utilisant le modèle de couleurs YIQ, qui se concentre sur l'information de luminance (luminosité). La fonction modifie l'image d'entrée sur place.

source: `surface_` (pygame.Surface): The Pygame surface to convert into greyscale. This surface can be in any color format supported by Pygame.
es: `surface_` (pygame.Surface): La superficie de Pygame que se convertirá a escala de grises. Esta superficie puede estar en cualquier formato de color compatible con Pygame.
fr: `surface_` (pygame.Surface) : La surface Pygame à convertir en niveaux de gris. Cette surface peut être dans n'importe quel format de couleur pris en charge par Pygame.

source: The function modifies the input `surface_` in place, converting it to greyscale. It does not return a new surface.
es: La función modifica la `surface_` de entrada in situ, convirtiéndola a escala de grises. No devuelve una nueva superficie.
fr: La fonction modifie la surface d'entrée `surface_` sur place, la convertissant en niveaux de gris. Elle ne renvoie pas une nouvelle surface.

source: The conversion uses the YIQ color model, specifically the luma (Y) component, which represents the brightness of the image.
es: La conversión utiliza el modelo de color YIQ, específicamente el componente de luminancia (Y), que representa el brillo de la imagen.
fr: La conversion utilise le modèle de couleurs YIQ, en particulier la composante luma (Y), qui représente la luminosité de l'image.

source: The input surface is modified directly, and no new surface is returned.
es: La superficie de entrada se modifica directamente y no se devuelve una nueva superficie.
fr: La surface d'entrée est modifiée directement et aucune nouvelle surface n'est renvoyée.

source: **Returns**: - `tuple`: A tuple containing two arrays `(current_, previous_)`, which represent the updated states of the ripple. See the Parameters section for the sizes of each array.
fr: **Retour** : - `tuple` : Un tuple contenant deux tableaux `(current_, previous_)`, qui représentent les états mis à jour des vagues. Voir la section Paramètres pour les tailles de chaque tableau.
