Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader_gpu.po
Languages: es, fr

source: This function uses a GPU kernel to apply a Sepia effect to an image stored in either a BGR or BGRA format. The operation is performed on the input image buffer (`bgr_array`), which is a 1D array or memoryview representing the pixel data in either BGR or BGRA format.
es: Esta función utiliza un kernel de GPU para aplicar un efecto Sepia a una imagen almacenada en formato BGR o BGRA. La operación se realiza en el búfer de imagen de entrada (`bgr_array`), que es un arreglo 1D o una vista de memoria que representa los datos de píxeles en formato BGR o BGRA.
fr: Cette fonction utilise un noyau GPU pour appliquer un effet Sepia à une image stockée soit au format BGR, soit BGRA. L'opération est effectuée sur le tampon d'image d'entrée (`bgr_array`), qui est un tableau 1D ou un memoryview représentant les données des pixels au format BGR ou BGRA.

source: The function assumes the buffer is laid out as a 1D array, where each pixel consists of 3 or 4 bytes (depending on whether it is in BGR or BGRA format). The Sepia effect is applied in parallel on the GPU using a CUDA kernel, and the result is stored directly in the input buffer.
es: La función asume que el búfer está organizado como un arreglo 1D, donde cada píxel consta de 3 o 4 bytes (dependiendo de si está en formato BGR o BGRA). El efecto Sepia se aplica en paralelo en la GPU utilizando un kernel CUDA, y el resultado se almacena directamente en el búfer de entrada.
fr: La fonction suppose que le tampon est disposé sous forme de tableau 1D, où chaque pixel consiste en 3 ou 4 octets (selon qu'il soit en format BGR ou BGRA). L'effet Sepia est appliqué en parallèle sur le GPU à l'aide d'un noyau CUDA, et le résultat est stocké directement dans le tampon d'entrée.

source: **grid_** (*tuple*): The block grid dimensions to be used for the kernel launch, typically obtained from a helper function such as `block_grid()`.
es: **grid_** (*tuple*): Las dimensiones de la cuadrícula de bloques que se utilizarán para el lanzamiento del kernel, generalmente obtenidas de una función auxiliar como `block_grid()`.
fr: **grid_** (*tuple*) : Les dimensions de la grille de blocs à utiliser pour le lancement du noyau, généralement obtenues à partir d'une fonction d'assistance telle que `block_grid()`.

source: **block_** (*tuple*): The block dimensions to be used for the kernel launch, typically obtained from a helper function such as `block_grid()`.
es: **block_** (*tuple*): Las dimensiones de los bloques que se utilizarán para el lanzamiento del kernel, generalmente obtenidas de una función auxiliar como `block_grid()`.
fr: **block_** (*tuple*) : Les dimensions du bloc à utiliser pour le lancement du noyau, généralement obtenues à partir d'une fonction d'assistance telle que `block_grid()`.

source: **w** (*Py_ssize_t*): The width of the image, in pixels. Must be greater than 0.
es: **w** (*Py_ssize_t*): El ancho de la imagen, en píxeles. Debe ser mayor que 0.
fr: **w** (*Py_ssize_t*) : La largeur de l'image, en pixels. Doit être supérieure à 0.

source: **h** (*Py_ssize_t*): The height of the image, in pixels. Must be greater than 0.
es: **h** (*Py_ssize_t*): La altura de la imagen, en píxeles. Debe ser mayor que 0.
fr: **h** (*Py_ssize_t*) : La hauteur de l'image, en pixels. Doit être supérieure à 0.

source: **bgr_array** (*unsigned char [::1]*): A 1D array or memoryview containing the image pixel data. This array represents the image in either BGR (3 channels) or BGRA (4 channels) format, with each pixel occupying 3 or 4 consecutive bytes.
es: **bgr_array** (*unsigned char [::1]*): Un arreglo 1D o una vista de memoria que contiene los datos de píxeles de la imagen. Este arreglo representa la imagen en formato BGR (3 canales) o BGRA (4 canales), donde cada píxel ocupa 3 o 4 bytes consecutivos.
fr: **bgr_array** (*unsigned char [::1]*) : Un tableau 1D ou un memoryview contenant les données des pixels de l'image. Ce tableau représente l'image en format BGR (3 canaux) ou BGRA (4 canaux), chaque pixel occupant 3 ou 4 octets consécutifs.

source: **format_32** (*bint*, optional): A boolean flag indicating whether the input array is in BGRA format (True) or BGR format (False). Default is False (BGR format).
es: **format_32** (*bint*, opcional): Una bandera booleana que indica si el arreglo de entrada está en formato BGRA (True) o BGR (False). El valor predeterminado es False (formato BGR).
fr: **format_32** (*bint*, optionnel) : Un indicateur booléen indiquant si le tableau d'entrée est au format BGRA (True) ou BGR (False). Par défaut, c'est False (format BGR).

source: **None**: This function modifies the input `bgr_array` in-place and returns nothing.
es: **None**: Esta función modifica el arreglo de entrada `bgr_array` in situ y no devuelve nada.
fr: **None** : Cette fonction modifie le `bgr_array` en place et ne retourne rien.

source: **TypeError**: If `bgr_array` is not a valid numpy.ndarray or memoryview.
es: **TypeError**: Si `bgr_array` no es un numpy.ndarray o una vista de memoria válida.
fr: **TypeError** : Si `bgr_array` n'est pas un numpy.ndarray ou memoryview valide.

source: **ValueError**: If the dimensions of the input image or the buffer length do not match the expected values based on the width, height, and pixel format.
es: **ValueError**: Si las dimensiones de la imagen de entrada o la longitud del búfer no coinciden con los valores esperados basados en el ancho, la altura y el formato de píxel.
fr: **ValueError** : Si les dimensions de l'image d'entrée ou la longueur du tampon ne correspondent pas aux valeurs attendues en fonction de la largeur, de la hauteur et du format des pixels.

source: Ensure that the input array is of dtype `numpy.uint8` and has three or four dimensions representing the RGB or RGBA channels.
es: Asegúrese de que el arreglo de entrada sea de tipo `numpy.uint8` y tenga tres o cuatro dimensiones que representen los canales RGB o RGBA.
fr: Assurez-vous que le tableau d'entrée soit de type `numpy.uint8` et ait trois ou quatre dimensions représentant les canaux RGB ou RGBA.

source: Apply a Bright Pass Filter (BPF) effect to a Pygame surface using GPU acceleration.
es: Aplica un filtro de paso brillante (BPF) a una superficie de Pygame utilizando aceleración por GPU.
fr: Applique un filtre Bright Pass (BPF) à une surface Pygame en utilisant l'accélération GPU.

source: This function applies a Bright Pass Filter to an image represented by a Pygame.Surface. The filter retains pixels with brightness values above a specified threshold and sets others to black. The operation is performed on the GPU to enhance performance.
es: Esta función aplica un filtro de paso brillante a una imagen representada por una superficie de Pygame. El filtro conserva los píxeles con valores de brillo superiores a un umbral especificado y establece los demás en negro. La operación se realiza en la GPU para mejorar el rendimiento.
fr: Cette fonction applique un filtre Bright Pass à une image représentée par une pygame.Surface. Le filtre conserve les pixels dont les valeurs de luminosité sont supérieures à un seuil spécifié et met les autres à noir. L'opération est effectuée sur le GPU pour améliorer les performances.

source: **surface_** (*pygame.Surface*): The input surface (image) on which the Bright Pass Filter effect will be applied.
es: **surface_** (*pygame.Surface*): La superficie de entrada (imagen) a la que se aplicará el efecto de filtro de paso brillante.
fr: **surface_** (*pygame.Surface*) : La surface d'entrée (image) sur laquelle l'effet Bright Pass Filter sera appliqué.

source: **threshold_** (*int*, optional): The brightness threshold in the range [0, 255]. Pixels with a brightness value greater than or equal to the threshold will retain their color, while those below will be set to black. Default is 128.
es: **threshold_** (*int*, opcional): El umbral de brillo en el rango [0, 255]. Los píxeles con un valor de brillo mayor o igual al umbral conservarán su color, mientras que los que estén por debajo se establecerán en negro. El valor predeterminado es 128.
fr: **threshold_** (*int*, optionnel) : Le seuil de luminosité dans la plage [0, 255]. Les pixels dont la valeur de luminosité est supérieure ou égale au seuil conserveront leur couleur, tandis que ceux en dessous seront mis à noir. Par défaut, il est de 128.

source: **pygame.Surface**: A new Pygame.Surface with the Bright Pass Filter effect applied, in RGB format, with the same width and height as the input surface.
es: **pygame.Surface**: Una nueva superficie de Pygame con el efecto de filtro de paso brillante aplicado, en formato RGB, con el mismo ancho y altura que la superficie de entrada.
fr: **pygame.Surface** : Une nouvelle Pygame.Surface avec l'effet Bright Pass Filter appliqué, au format RGB, avec la même largeur et hauteur que la surface d'entrée.

source: **TypeError**: If `surface_` is not a `pygame.Surface` type.
es: **TypeError**: Si `surface_` no es de tipo `pygame.Surface`.
fr: **TypeError** : Si `surface_` n'est pas de type `pygame.Surface`.

source: **ValueError**: If there is an issue referencing the surface pixels into a 3D array, or if the surface dimensions are invalid.
es: **ValueError**: Si hay un problema al referenciar los píxeles de la superficie en un arreglo 3D, o si las dimensiones de la superficie no son válidas.
fr: **ValueError** : S'il y a un problème pour référencer les pixels de la surface dans un tableau 3D, ou si les dimensions de la surface sont invalides.

source: The function utilizes GPU acceleration to apply the Bright Pass Filter efficiently.
es: La función utiliza aceleración por GPU para aplicar el filtro de paso brillante de manera eficiente.
fr: La fonction utilise l'accélération GPU pour appliquer efficacement l'effet Bright Pass Filter.

source: The input surface is not modified; a new surface with the Bright Pass Filter effect is returned.
es: La superficie de entrada no se modifica; se devuelve una nueva superficie con el efecto de filtro de paso brillante aplicado.
fr: La surface d'entrée n'est pas modifiée ; une nouvelle surface avec l'effet Bright Pass Filter est retournée.

source: Apply a Bright Pass Filter (BPF) to a Pygame surface in-place using GPU acceleration.
es: Aplica un filtro de paso brillante (BPF) a una superficie de Pygame in situ utilizando aceleración por GPU.
fr: Applique un filtre Bright Pass (BPF) à une surface Pygame en place en utilisant l'accélération GPU.

source: This function applies a Bright Pass Filter effect to an image on the GPU. The filter retains pixels with brightness values greater than or equal to a specified threshold, setting others to black. The operation is done in-place, modifying the input surface directly.
es: Esta función aplica un efecto de filtro de paso brillante a una imagen en la GPU. El filtro conserva los píxeles con valores de brillo mayores o iguales a un umbral especificado, estableciendo los demás en negro. La operación se realiza in situ, modificando directamente la superficie de entrada.
fr: Cette fonction applique un effet Bright Pass Filter à une image sur le GPU. Le filtre conserve les pixels dont la luminosité est supérieure ou égale à un seuil spécifié et met les autres à noir. L'opération est effectuée en place, modifiant directement la surface d'entrée.

source: **surface_** (*pygame.Surface*): The input surface (image) on which the Bright Pass Filter effect will be applied. The surface should be in RGB format.
es: **surface_** (*pygame.Surface*): La superficie de entrada (imagen) a la que se aplicará el efecto de filtro de paso brillante. La superficie debe estar en formato RGB.
fr: **surface_** (*pygame.Surface*) : La surface d'entrée (image) sur laquelle l'effet Bright Pass Filter sera appliqué. La surface doit être au format RGB.

source: **grid_** (*tuple*): Specifies the grid configuration for the GPU kernel. This determines how the work is divided across multiple threads in the GPU. Grid dimensions should match the texture and array sizes.
es: **grid_** (*tuple*): Especifica la configuración de la cuadrícula para el kernel de la GPU. Esto determina cómo se divide el trabajo entre múltiples hilos en la GPU. Las dimensiones de la cuadrícula deben coincidir con los tamaños de la textura y el arreglo.
fr: **grid_** (*tuple*) : Spécifie la configuration de la grille pour le noyau GPU. Cela détermine la répartition du travail entre plusieurs threads sur le GPU. Les dimensions de la grille doivent correspondre aux tailles de la texture et du tableau.

source: **block_** (*tuple*): Specifies the block configuration for the GPU kernel. This defines the number of threads within a block. The maximum number of threads per block is 1024. Block size should be chosen to optimize performance on the hardware.
es: **block_** (*tuple*): Especifica la configuración del bloque para el kernel de la GPU. Esto define el número de hilos dentro de un bloque. El número máximo de hilos por bloque es 1024. El tamaño del bloque debe elegirse para optimizar el rendimiento en el hardware.
fr: **block_** (*tuple*) : Spécifie la configuration des blocs pour le noyau GPU. Cela définit le nombre de threads par bloc. Le nombre maximal de threads par bloc est de 1024. La taille des blocs doit être choisie pour optimiser les performances du matériel.

source: **threshold_** (*int*, optional): The brightness threshold (in the range [0, 255]) that determines which pixels are kept. Pixels with a brightness value greater than or equal to the threshold remain unchanged, while pixels below the threshold are set to black. Default is 128.
es: **threshold_** (*int*, opcional): El umbral de brillo (en el rango [0, 255]) que determina qué píxeles se conservan. Los píxeles con un valor de brillo mayor o igual al umbral permanecen sin cambios, mientras que los píxeles por debajo del umbral se establecen en negro. El valor predeterminado es 128.
fr: **threshold_** (*int*, optionnel) : Le seuil de luminosité (dans la plage [0, 255]) qui détermine quels pixels sont conservés. Les pixels dont la valeur de luminosité est supérieure ou égale au seuil restent inchangés, tandis que ceux en dessous sont mis à noir. Par défaut, il est de 128.

source: **None**: The function modifies the input `surface_` in-place and returns nothing.
es: **None**: La función modifica la superficie de entrada `surface_` in situ y no devuelve nada.
fr: **None** : La fonction modifie `surface_` en place et ne retourne rien.

source: The input surface is modified directly; no new surface is created.
es: La superficie de entrada se modifica directamente; no se crea una nueva superficie.
fr: La surface d'entrée est modifiée directement ; aucune nouvelle surface n'est créée.

source: Apply a band-pass filter (BPF) to an image buffer using GPU acceleration.
es: Aplica un filtro de paso de banda (BPF) a un búfer de imagen utilizando aceleración por GPU.
fr: Applique un filtre passe-bande (BPF) à un tampon d'image en utilisant l'accélération GPU.

source: This function processes an image buffer represented by a 1D array or memoryview in either BGR or BGRA format. The BPF retains pixels with brightness values within a specified range and sets others to black. The operation is performed on the GPU to enhance performance.
es: Esta función procesa un búfer de imagen representado por un arreglo 1D o una vista de memoria en formato BGR o BGRA. El BPF conserva los píxeles con valores de brillo dentro de un rango especificado y establece los demás en negro. La operación se realiza en la GPU para mejorar el rendimiento.
fr: Cette fonction traite un tampon d'image représenté par un tableau 1D ou un memoryview au format BGR ou BGRA. Le filtre BPF conserve les pixels dont la luminosité est comprise dans une plage spécifiée et met les autres à noir. L'opération est effectuée sur le GPU pour améliorer les performances.

source: **grid** (*tuple*): Grid size for GPU kernel execution (blocks per grid).
es: **grid** (*tuple*): Tamaño de la cuadrícula para la ejecución del kernel de la GPU (bloques por cuadrícula).
fr: **grid** (*tuple*) : Taille de la grille pour l'exécution du noyau GPU (blocs par grille).

source: **block** (*tuple*): Block size for GPU kernel execution (threads per block).
es: **block** (*tuple*): Tamaño del bloque para la ejecución del kernel de la GPU (hilos por bloque).
fr: **block** (*tuple*) : Taille des blocs pour l'exécution du noyau GPU (threads par bloc).

source: **w** (*int*): Width of the image in pixels.
es: **w** (*int*): Ancho de la imagen en píxeles.
fr: **w** (*int*) : Largeur de l'image en pixels.

source: **h** (*int*): Height of the image in pixels.
es: **h** (*int*): Altura de la imagen en píxeles.
fr: **h** (*int*) : Hauteur de l'image en pixels.

source: **bgr_array** (*numpy.ndarray* or *memoryview*): Input image buffer in BGR or BGRA format.
es: **bgr_array** (*numpy.ndarray* o *memoryview*): Búfer de imagen de entrada en formato BGR o BGRA.
fr: **bgr_array** (*numpy.ndarray* ou *memoryview*) : Tampon d'image d'entrée au format BGR ou BGRA.

source: **threshold_** (*int*, optional): Threshold value used for filtering (default: 128).
es: **threshold_** (*int*, opcional): Valor de umbral utilizado para el filtrado (predeterminado: 128).
fr: **threshold_** (*int*, optionnel) : Valeur seuil utilisée pour le filtrage (par défaut : 128).

source: **format_32** (*bool*, optional): If True, treats the input buffer as BGRA (4 bytes per pixel). If False, treats it as BGR (3 bytes per pixel).
es: **format_32** (*bool*, opcional): Si es True, trata el búfer de entrada como BGRA (4 bytes por píxel). Si es False, lo trata como BGR (3 bytes por píxel).
fr: **format_32** (*bool*, optionnel) : Si True, considère le tampon d'entrée comme BGRA (4 octets par pixel). Si False, le considère comme BGR (3 octets par pixel).

source: **None**: The function modifies `bgr_array` in-place with the filtered image.
es: **None**: La función modifica `bgr_array` in situ con la imagen filtrada.
fr: **None** : La fonction modifie `bgr_array` en place avec l'image filtrée.

source: **TypeError**: If `bgr_array` is not a numpy.ndarray or memoryview.
es: **TypeError**: Si `bgr_array` no es un numpy.ndarray o una vista de memoria.
fr: **TypeError** : Si `bgr_array` n'est pas un numpy.ndarray ou un memoryview.

source: **ValueError**: If `bgr_array` is empty or does not match the expected size.
es: **ValueError**: Si `bgr_array` está vacío o no coincide con el tamaño esperado.
fr: **ValueError** : Si `bgr_array` est vide ou ne correspond pas à la taille attendue.

source: The function utilizes GPU acceleration to apply the BPF efficiently.
es: La función utiliza aceleración por GPU para aplicar el BPF de manera eficiente.
fr: La fonction utilise l'accélération GPU pour appliquer efficacement le filtre BPF.

source: Converts a Pygame surface to grayscale using GPU acceleration.
es: Convierte una superficie de Pygame a escala de grises utilizando aceleración por GPU.
fr: Convertit une surface Pygame en niveaux de gris en utilisant l'accélération GPU.

source: This function takes a Pygame surface in 24-bit or 32-bit format, processes it on the GPU to convert it to grayscale, and returns a new 24-bit grayscale surface.
es: Esta función toma una superficie de Pygame en formato de 24 bits o 32 bits, la procesa en la GPU para convertirla a escala de grises y devuelve una nueva superficie de 24 bits en escala de grises.
fr: Cette fonction prend une surface Pygame au format 24 bits ou 32 bits, la traite sur le GPU pour la convertir en niveaux de gris, et retourne une nouvelle surface 24 bits en niveaux de gris.

source: **surface_** (*pygame.Surface*): A Pygame surface with a 24-bit or 32-bit color format.
es: **surface_** (*pygame.Surface*): Una superficie de Pygame con un formato de color de 24 bits o 32 bits.
fr: **surface_** (*pygame.Surface*) : Une surface Pygame avec un format de couleur 24 bits ou 32 bits.

source: **pygame.Surface**: A new 24-bit grayscale Pygame surface.
es: **pygame.Surface**: Una nueva superficie de Pygame de 24 bits en escala de grises.
fr: **pygame.Surface** : Une nouvelle surface Pygame en niveaux de gris 24 bits.

source: **TypeError**: If `surface_` is not a Pygame surface.
es: **TypeError**: Si `surface_` no es una superficie de Pygame.

source: **ValueError**: If the surface cannot be converted into a 3D array view, or if the surface width or height is zero.
es: **ValueError**: Si la superficie no se puede convertir en una vista de arreglo 3D, o si el ancho o la altura de la superficie es cero.

source: The function utilizes GPU acceleration to perform the grayscale conversion efficiently.
es: La función utiliza aceleración por GPU para realizar la conversión a escala de grises de manera eficiente.

source: The input surface is not modified; a new surface with the grayscale effect is returned.
es: La superficie de entrada no se modifica; se devuelve una nueva superficie con el efecto de escala de grises aplicado.

source: Converts a Pygame surface to grayscale using GPU acceleration with a luminance-based method.
es: Convierte una superficie de Pygame a escala de grises utilizando aceleración por GPU con un método basado en luminancia.

source: This function takes a Pygame surface in 24-bit or 32-bit format, processes it on the GPU using a luminance-based grayscale conversion, and returns a new 24-bit grayscale Pygame surface.
es: Esta función toma una superficie de Pygame en formato de 24 bits o 32 bits, la procesa en la GPU utilizando una conversión a escala de grises basada en luminancia y devuelve una nueva superficie de Pygame de 24 bits en escala de grises.

source: Apply a median filter to a Pygame surface using GPU acceleration.
es: Aplica un filtro de mediana a una superficie de Pygame utilizando aceleración por GPU.

source: This function utilizes a generic median filter, which processes each pixel based on neighboring values. The filter operates on 24-bit and 32-bit surfaces by applying a kernel function.
es: Esta función utiliza un filtro de mediana genérico, que procesa cada píxel en función de los valores vecinos. El filtro opera en superficies de 24 bits y 32 bits aplicando una función de kernel.

source: **Performance Consideration:** The median filter uses a kernel with a buffer of type `double`, which may result in lower performance compared to specialized GPU-based median filtering methods.
es: **Consideración de rendimiento:** El filtro de mediana utiliza un kernel con un búfer de tipo `double`, lo que puede resultar en un rendimiento más bajo en comparación con métodos especializados de filtrado de mediana basados en GPU.

source: **surface_** (*pygame.Surface*): The input Pygame surface, expected to be in 24-bit or 32-bit format.
es: **surface_** (*pygame.Surface*): La superficie de Pygame de entrada, que se espera que esté en formato de 24 bits o 32 bits.

source: **size_** (*int*, optional): The size of the neighborhood window used for the median filter. Must be greater than zero. Default is 5.
es: **size_** (*int*, opcional): El tamaño de la ventana de vecindad utilizada para el filtro de mediana. Debe ser mayor que cero. El valor predeterminado es 5.

source: **pygame.Surface**: A new Pygame surface with the median filter applied.
es: **pygame.Surface**: Una nueva superficie de Pygame con el filtro de mediana aplicado.

source: **ValueError**: If `size_` is less than or equal to zero, or if the input surface has zero width or height.
es: **ValueError**: Si `size_` es menor o igual a cero, o si la superficie de entrada tiene un ancho o altura de cero.

source: **TypeError**: If `surface_` is not a valid `pygame.Surface`.
es: **TypeError**: Si `surface_` no es una `pygame.Surface` válida.
