Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: This function applies an RGB split effect to an image directly, modifying the original image without creating a new copy. The function shifts the red, green, and blue channels based on the provided offset value, either rearranging the channels or applying the specified offset.
es: Esta función aplica un efecto de división RGB a una imagen directamente, modificando la imagen original sin crear una nueva copia. La función desplaza los canales rojo, verde y azul según el valor de desplazamiento proporcionado, ya sea reorganizando los canales o aplicando el desplazamiento especificado.
fr: Cette fonction applique un effet de séparation RGB directement à une image, modifiant l'image d'origine sans créer de nouvelle copie. La fonction décale les canaux rouge, vert et bleu en fonction de la valeur de décalage fournie, réorganisant les canaux ou appliquant le décalage spécifié.

source: `surface_` (pygame.Surface): A Pygame surface compatible with 24-bit or 32-bit color format (RGB). The input image on which the RGB split effect will be applied, and the changes will be applied directly to this surface.
es: `surface_` (pygame.Surface): Una superficie de Pygame compatible con formatos de color de 24 o 32 bits (RGB). La imagen de entrada a la que se aplicará el efecto de división RGB, y los cambios se aplicarán directamente a esta superficie.
fr: `surface_` (pygame.Surface) : Une surface Pygame compatible avec un format de couleur 24 bits ou 32 bits (RGB). L'image d'entrée sur laquelle l'effet de séparation RGB sera appliqué, et les modifications seront appliquées directement à cette surface.

source: `array_` (numpy.ndarray, optional): A numpy array with the shape (w, h, 3) and type `uint8`. If provided, this array will be used to speed up the process by directly applying the transformation to it. This parameter is optional.
es: `array_` (numpy.ndarray, opcional): Un array de numpy con la forma (w, h, 3) y tipo `uint8`. Si se proporciona, este array se utilizará para acelerar el proceso al aplicar directamente la transformación a él. Este parámetro es opcional.
fr: `array_` (numpy.ndarray, optionnel) : Un tableau numpy avec la forme (w, h, 3) et le type `uint8`. Si fourni, ce tableau sera utilisé pour accélérer le processus en appliquant directement la transformation dessus. Ce paramètre est optionnel.

source: `void`: The changes are applied directly to the input surface, so no new surface is returned.
es: `void`: Los cambios se aplican directamente a la superficie de entrada, por lo que no se devuelve una nueva superficie.
fr: `void` : Les modifications sont appliquées directement à la surface d'entrée, aucune nouvelle surface n'est retournée.

source: Convert a wavelength to RGB color.
es: Convertir una longitud de onda a color RGB.
fr: Convertir une longueur d'onde en couleur RGB.

source: This function maps a given wavelength (in nanometers) to an RGB color. The wavelength is interpreted within the visible spectrum (380–750 nm), and the corresponding color is returned in the RGB color model. The function optionally allows for gamma correction, which adjusts the color brightness.
es: Esta función mapea una longitud de onda dada (en nanómetros) a un color RGB. La longitud de onda se interpreta dentro del espectro visible (380–750 nm), y el color correspondiente se devuelve en el modelo de color RGB. La función permite opcionalmente la corrección gamma, que ajusta el brillo del color.
fr: Cette fonction associe une longueur d'onde donnée (en nanomètres) à une couleur RGB. La longueur d'onde est interprétée dans le spectre visible (380–750 nm), et la couleur correspondante est retournée dans le modèle de couleur RGB. La fonction permet optionnellement d'appliquer une correction gamma, qui ajuste la luminosité de la couleur.

source: `wavelength` (int): The wavelength of light in nanometers (nm), typically within the visible spectrum range of 380–750 nm. The function uses this value to determine the corresponding color.
es: `wavelength` (int): La longitud de onda de la luz en nanómetros (nm), típicamente dentro del rango del espectro visible de 380–750 nm. La función utiliza este valor para determinar el color correspondiente.
fr: `wavelength` (int) : La longueur d'onde de la lumière en nanomètres (nm), généralement dans la plage du spectre visible de 380 à 750 nm. La fonction utilise cette valeur pour déterminer la couleur correspondante.

source: `gamma` (float, optional): A gamma correction factor applied to the color. The default value is `1.0`, meaning no correction is applied. Values greater than `1.0` increase the brightness of the color, while values less than `1.0` darken it.
es: `gamma` (float, opcional): Un factor de corrección gamma aplicado al color. El valor predeterminado es `1.0`, lo que significa que no se aplica ninguna corrección. Valores mayores que `1.0` aumentan el brillo del color, mientras que valores menores que `1.0` lo oscurecen.
fr: `gamma` (float, optionnel) : Un facteur de correction gamma appliqué à la couleur. La valeur par défaut est `1.0`, ce qui signifie qu'aucune correction n'est appliquée. Les valeurs supérieures à `1.0` augmentent la luminosité de la couleur, tandis que les valeurs inférieures à `1.0` l'assombrissent.

source: `tuple`: A tuple of three integers representing the RGB components of the color, with each value in the range of 0 to 255.
es: `tuple`: Una tupla de tres enteros que representan los componentes RGB del color, con cada valor en el rango de 0 a 255.
fr: `tuple` : Un tuple de trois entiers représentant les composants RGB de la couleur, chaque valeur étant dans la plage de 0 à 255.

source: Map a wavelength to a customized RGB color based on a user-defined wavelength domain.
es: Mapear una longitud de onda a un color RGB personalizado basado en un dominio de longitud de onda definido por el usuario.
fr: Associer une longueur d'onde à une couleur RGB personnalisée en fonction d'un domaine de longueurs d'onde défini par l'utilisateur.

source: Unlike the `wavelength2rgb` function that returns RGB values corresponding to a wavelength within the standard visible spectrum (380–750 nm), this function allows the user to define a customized wavelength domain and returns the corresponding RGB color for a wavelength in that domain.
es: A diferencia de la función `wavelength2rgb` que devuelve valores RGB correspondientes a una longitud de onda dentro del espectro visible estándar (380–750 nm), esta función permite al usuario definir un dominio de longitud de onda personalizado y devuelve el color RGB correspondiente para una longitud de onda en ese dominio.
fr: Contrairement à la fonction `wavelength2rgb` qui retourne des valeurs RGB correspondant à une longueur d'onde dans le spectre visible standard (380–750 nm), cette fonction permet à l'utilisateur de définir un domaine de longueurs d'onde personnalisé et retourne la couleur RGB correspondante pour une longueur d'onde dans ce domaine.

source: `wavelength` (int): The wavelength of light in nanometers (nm). This value is mapped to the customized wavelength domain defined in `color_array`.
es: `wavelength` (int): La longitud de onda de la luz en nanómetros (nm). Este valor se mapea al dominio de longitud de onda personalizado definido en `color_array`.
fr: `wavelength` (int) : La longueur d'onde de la lumière en nanomètres (nm). Cette valeur est associée au domaine de longueurs d'onde personnalisé défini dans `color_array`.

source: `color_array` (numpy.ndarray): A 1D array of integers representing the wavelength boundaries of different colors. The array should contain pairs of values for each color (e.g., [min, max] ranges for colors such as yellow, orange, red, etc.). These ranges define the domain in which the colors will be applied.
es: `color_array` (numpy.ndarray): Un array 1D de enteros que representa los límites de longitud de onda de diferentes colores. El array debe contener pares de valores para cada color (por ejemplo, rangos [min, max] para colores como amarillo, naranja, rojo, etc.). Estos rangos definen el dominio en el que se aplicarán los colores.
fr: `color_array` (numpy.ndarray) : Un tableau 1D d'entiers représentant les bornes de longueurs d'onde de différentes couleurs. Le tableau doit contenir des paires de valeurs pour chaque couleur (par exemple, des plages [min, max] pour des couleurs comme le jaune, l'orange, le rouge, etc.). Ces plages définissent le domaine dans lequel les couleurs seront appliquées.

source: `gamma` (float, optional): A gamma correction factor applied to the resulting RGB color. The default value is `1.0`, which means no gamma correction. Values greater than `1.0` will brighten the color, while values less than `1.0` will darken it.
es: `gamma` (float, opcional): Un factor de corrección gamma aplicado al color RGB resultante. El valor predeterminado es `1.0`, lo que significa que no se aplica corrección gamma. Valores mayores que `1.0` aumentarán el brillo del color, mientras que valores menores que `1.0` lo oscurecerán.
fr: `gamma` (float, optionnel) : Un facteur de correction gamma appliqué à la couleur RGB résultante. La valeur par défaut est `1.0`, ce qui signifie qu'aucune correction gamma n'est appliquée. Les valeurs supérieures à `1.0` éclairciront la couleur, tandis que les valeurs inférieures à `1.0` l'assombriront.

source: `tuple`: A tuple containing the RGB values (0-255) for the color corresponding to the given wavelength within the customized domain.
es: `tuple`: Una tupla que contiene los valores RGB (0-255) para el color correspondiente a la longitud de onda dada dentro del dominio personalizado.
fr: `tuple` : Un tuple contenant les valeurs RGB (0-255) pour la couleur correspondant à la longueur d'onde donnée dans le domaine personnalisé.

source: Map a specific wavelength to a blue-toned RGB color.
es: Mapear una longitud de onda específica a un color RGB con tono azul.
fr: Associer une longueur d'onde spécifique à une couleur RGB à tonalité bleue.

source: This function takes a wavelength (in nanometers) and returns the corresponding RGB values with a focus on generating a blue color. It uses a simple mapping based on the provided wavelength and applies a gamma correction for more refined color adjustments.
es: Esta función toma una longitud de onda (en nanómetros) y devuelve los valores RGB correspondientes con un enfoque en generar un color azul. Utiliza un mapeo simple basado en la longitud de onda proporcionada y aplica una corrección gamma para ajustes de color más refinados.
fr: Cette fonction prend une longueur d'onde (en nanomètres) et retourne les valeurs RGB correspondantes en mettant l'accent sur la génération d'une couleur bleue. Elle utilise un mappage simple basé sur la longueur d'onde fournie et applique une correction gamma pour des ajustements de couleur plus précis.

source: `wavelength` (int): The wavelength of light in nanometers (nm). This value is mapped to the blue-toned RGB value.
es: `wavelength` (int): La longitud de onda de la luz en nanómetros (nm). Este valor se mapea al valor RGB con tono azul.
fr: `wavelength` (int) : La longueur d'onde de la lumière en nanomètres (nm). Cette valeur est associée à la valeur RGB à tonalité bleue.

source: `tuple`: A tuple containing the RGB values (0-255) for the blue-toned color corresponding to the given wavelength.
es: `tuple`: Una tupla que contiene los valores RGB (0-255) para el color con tono azul correspondiente a la longitud de onda dada.
fr: `tuple` : Un tuple contenant les valeurs RGB (0-255) pour la couleur à tonalité bleue correspondant à la longueur d'onde donnée.

source: Apply a blue color filter to an image, transforming it into a blue-toned version.
es: Aplicar un filtro de color azul a una imagen, transformándola en una versión con tono azul.
fr: Appliquer un filtre de couleur bleue à une image, la transformant en une version à tonalité bleue.

source: This function uses the wavelength range from 450 to 495 nm, which corresponds to blue light in the visible spectrum, to convert the image into various shades of blue.
es: Esta función utiliza el rango de longitud de onda de 450 a 495 nm, que corresponde a la luz azul en el espectro visible, para convertir la imagen en varios tonos de azul.
fr: Cette fonction utilise la plage de longueurs d'onde de 450 à 495 nm, qui correspond à la lumière bleue dans le spectre visible, pour convertir l'image en différentes nuances de bleu.

source: `surface_` (pygame.Surface): The Pygame surface (image) that will be transformed into blue shades.
es: `surface_` (pygame.Surface): La superficie de Pygame (imagen) que se transformará en tonos azules.
fr: `surface_` (pygame.Surface) : La surface Pygame (image) qui sera transformée en nuances de bleu.

source: `void`: This function modifies the provided surface in place, so there is no return value.
es: `void`: Esta función modifica la superficie proporcionada in situ, por lo que no hay valor de retorno.
fr: `void` : Cette fonction modifie la surface fournie en place, il n'y a pas de valeur de retour.

source: Return the RGB components corresponding to a specific wavelength in the red spectrum.
es: Devolver los componentes RGB correspondientes a una longitud de onda específica en el espectro rojo.
fr: Retourner les composants RGB correspondant à une longueur d'onde spécifique dans le spectre rouge.

source: This function maps a given wavelength (in nm) to the appropriate RGB values for the red portion of the visible spectrum. It can be used to generate red-based colors based on a given wavelength.
es: Esta función mapea una longitud de onda dada (en nm) a los valores RGB apropiados para la porción roja del espectro visible. Se puede utilizar para generar colores basados en rojo según una longitud de onda dada.
fr: Cette fonction associe une longueur d'onde donnée (en nm) aux valeurs RGB appropriées pour la partie rouge du spectre visible. Elle peut être utilisée pour générer des couleurs basées sur le rouge à partir d'une longueur d'onde donnée.

source: `wavelength` (int): The wavelength in nanometers (nm) for which the corresponding RGB values are calculated.
es: `wavelength` (int): La longitud de onda en nanómetros (nm) para la cual se calculan los valores RGB correspondientes.
fr: `wavelength` (int) : La longueur d'onde en nanomètres (nm) pour laquelle les valeurs RGB correspondantes sont calculées.

source: `gamma` (float, optional): A gamma correction value to adjust the brightness of the colors. The default is `1.0` (no correction).
es: `gamma` (float, opcional): Un valor de corrección gamma para ajustar el brillo de los colores. El valor predeterminado es `1.0` (sin corrección).
fr: `gamma` (float, optionnel) : Une valeur de correction gamma pour ajuster la luminosité des couleurs. La valeur par défaut est `1.0` (aucune correction).

source: `tuple` (int, int, int): A tuple of RGB components as integers in the range (0 ... 255), corresponding to the specified wavelength.
es: `tuple` (int, int, int): Una tupla de componentes RGB como enteros en el rango (0 ... 255), correspondientes a la longitud de onda especificada.
fr: `tuple` (int, int, int) : Un tuple de composants RGB en tant qu'entiers dans la plage (0 ... 255), correspondant à la longueur d'onde spécifiée.

source: Apply a redscale effect to an image.
es: Aplicar un efecto de escala de rojo a una imagen.
fr: Appliquer un effet redscale à une image.

source: This algorithm maps the input image into shades of red by adjusting the color channels according to wavelengths typically associated with the red portion of the visible light spectrum, ranging from 620 to 750 nm. The redscale effect retains the intensity variations of the red color while reducing or removing the influence of other color channels.
es: Este algoritmo mapea la imagen de entrada en tonos de rojo ajustando los canales de color según las longitudes de onda típicamente asociadas con la porción roja del espectro de luz visible, que va de 620 a 750 nm. El efecto de escala de rojo conserva las variaciones de intensidad del color rojo mientras reduce o elimina la influencia de otros canales de color.
fr: Cet algorithme associe l'image d'entrée à des nuances de rouge en ajustant les canaux de couleurs en fonction des longueurs d'onde généralement associées à la partie rouge du spectre lumineux visible, allant de 620 à 750 nm. L'effet redscale conserve les variations d'intensité de la couleur rouge tout en réduisant ou supprimant l'influence des autres canaux de couleur.

source: `surface_` (pygame.Surface): A Pygame surface representing the image to be transformed into redscale. The surface must contain valid RGB pixel data.
es: `surface_` (pygame.Surface): Una superficie de Pygame que representa la imagen que se transformará en escala de rojo. La superficie debe contener datos de píxeles RGB válidos.
fr: `surface_` (pygame.Surface) : Une surface Pygame représentant l'image à transformer en redscale. La surface doit contenir des données valides de pixels RGB.

source: `void`: This function modifies the input surface directly and does not return a new surface.
es: `void`: Esta función modifica la superficie de entrada directamente y no devuelve una nueva superficie.
fr: `void` : Cette fonction modifie directement la surface d'entrée et ne retourne pas une nouvelle surface.

source: Apply a dampening effect to a surface.
es: Aplicar un efecto de amortiguación a una superficie.
fr: Appliquer un effet d'amortissement à une surface.

source: This effect simulates a gradual scaling or shrinking of the surface based on a damped oscillation function. The length of the effect is determined by the product of duration and frequency. The position of the surface is adjusted according to its new size to maintain its centered position on the display.
es: Este efecto simula un escalado o reducción gradual de la superficie basado en una función de oscilación amortiguada. La duración del efecto está determinada por el producto de la duración y la frecuencia. La posición de la superficie se ajusta según su nuevo tamaño para mantener su posición centrada en la pantalla.
fr: Cet effet simule un redimensionnement ou une réduction progressive de la surface basée sur une fonction d'oscillation amortie. La durée de l'effet est déterminée par le produit de la durée et de la fréquence. La position de la surface est ajustée en fonction de sa nouvelle taille pour maintenir sa position centrée sur l'affichage.

source: `surface_` (pygame.Surface): A Pygame surface that is compatible with 24-32 bit color depth.
es: `surface_` (pygame.Surface): Una superficie de Pygame compatible con una profundidad de color de 24-32 bits.
fr: `surface_` (pygame.Surface) : Une surface Pygame compatible avec une profondeur de couleur de 24 à 32 bits.

source: `frame` (int): The current frame number in the animation sequence. This should be incremented with each frame update.
es: `frame` (int): El número de fotograma actual en la secuencia de animación. Este valor debe incrementarse con cada actualización de fotograma.
fr: `frame` (int) : Le numéro de la frame actuelle dans la séquence d'animation. Il doit être incrémenté à chaque mise à jour de la frame.

source: `display_width` (int): The width of the game display window.
es: `display_width` (int): El ancho de la ventana de visualización del juego.
fr: `display_width` (int) : La largeur de la fenêtre d'affichage du jeu.

source: `display_height` (int): The height of the game display window.
es: `display_height` (int): La altura de la ventana de visualización del juego.
fr: `display_height` (int) : La hauteur de la fenêtre d'affichage du jeu.

source: `amplitude` (float, optional): The amplitude of the dampening effect, which determines the maximum amount of scaling. Default is 50.0.
es: `amplitude` (float, opcional): La amplitud del efecto de amortiguación, que determina la cantidad máxima de escalado. El valor predeterminado es 50.0.
fr: `amplitude` (float, optionnel) : L'amplitude de l'effet d'amortissement, qui détermine l'ampleur maximale du redimensionnement. La valeur par défaut est 50.0.

source: `duration` (int, optional): The duration of the effect, which controls how long the effect lasts in terms of frames. Default is 30.
es: `duration` (int, opcional): La duración del efecto, que controla cuánto tiempo dura el efecto en términos de fotogramas. El valor predeterminado es 30.
fr: `duration` (int, optionnel) : La durée de l'effet, qui contrôle combien de frames dure l'effet. La valeur par défaut est 30.

source: `freq` (float, optional): The frequency of the dampening effect, which affects how fast the scaling oscillates. A smaller value will make the effect last longer, while a larger value shortens the effect. Default is 20.0.
es: `freq` (float, opcional): La frecuencia del efecto de amortiguación, que afecta la rapidez con la que oscila el escalado. Un valor más pequeño hará que el efecto dure más, mientras que un valor más grande lo acortará. El valor predeterminado es 20.0.
fr: `freq` (float, optionnel) : La fréquence de l'effet d'amortissement, qui affecte la rapidité avec laquelle l'oscillation de redimensionnement se produit. Une valeur plus petite prolongera l'effet, tandis qu'une valeur plus grande le réduira. La valeur par défaut est 20.0.

source: tuple: A tuple containing:
es: tuple: Una tupla que contiene:
fr: tuple : Un tuple contenant :

source: A new Pygame Surface with the dampening effect applied.
es: Una nueva superficie de Pygame con el efecto de amortiguación aplicado.
fr: Une nouvelle surface Pygame avec l'effet d'amortissement appliqué.

source: The x-coordinate of the new position of the surface (top-left corner).
es: La coordenada x de la nueva posición de la superficie (esquina superior izquierda).
fr: La coordonnée x de la nouvelle position de la surface (coin supérieur gauche).

source: The y-coordinate of the new position of the surface (top-left corner).
es: La coordenada y de la nueva posición de la superficie (esquina superior izquierda).
fr: La coordonnée y de la nouvelle position de la surface (coin supérieur gauche).

source: The surface is centered in the display area.
es: La superficie está centrada en el área de visualización.
fr: La surface est centrée dans la zone d'affichage.

source: Apply lateral dampening effect to produce horizontal displacement.
es: Aplicar un efecto de amortiguación lateral para producir un desplazamiento horizontal.
fr: Appliquer un effet d'amortissement latéral pour produire un déplacement horizontal.

source: This method calculates the lateral displacement (x-coordinate) based on a dampened oscillation function. The displacement value oscillates between positive and negative values, gradually decaying according to the amplitude, frequency, and duration parameters.
es: Este método calcula el desplazamiento lateral (coordenada x) basado en una función de oscilación amortiguada. El valor de desplazamiento oscila entre valores positivos y negativos, decayendo gradualmente según los parámetros de amplitud, frecuencia y duración.
fr: Cette méthode calcule le déplacement latéral (coordonnée x) basé sur une fonction d'oscillation amortie. La valeur du déplacement oscille entre des valeurs positives et négatives, diminuant progressivement selon les paramètres d'amplitude, de fréquence et de durée.

source: `frame` (int): The current frame number in the animation sequence. This value must be incremented with each frame to produce smooth animation.
es: `frame` (int): El número de fotograma actual en la secuencia de animación. Este valor debe incrementarse con cada fotograma para producir una animación suave.
fr: `frame` (int) : Le numéro de la frame actuelle dans la séquence d'animation. Cette valeur doit être incrémentée à chaque frame pour produire une animation fluide.
