Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: The `mask_` parameter can be used to control which parts of the image will bloom based on the alpha values.
es: El parámetro `mask_` se puede utilizar para controlar qué partes de la imagen tendrán bloom basado en los valores alfa.
fr: Le paramètre `mask_` peut être utilisé pour contrôler quelles parties de l'image vont rayonner en fonction des valeurs alpha.

source: The `fast_` parameter allows for a quicker, albeit lower-quality, version of the bloom effect.
es: El parámetro `fast_` permite una versión más rápida, aunque de menor calidad, del efecto de bloom.
fr: Le paramètre `fast_` permet d'obtenir une version plus rapide, bien que de qualité inférieure, de l'effet de bloom.

source: This function simulates a light effect that can be blended onto a surface using additive blending (`BLEND_RGBA_ADD` in Pygame). It supports optional enhancements such as bloom, smoothing, and saturation adjustments.
es: Esta función simula un efecto de luz que puede mezclarse en una superficie usando mezcla aditiva (`BLEND_RGBA_ADD` en Pygame). Soporta mejoras opcionales como bloom, suavizado y ajustes de saturación.
fr: Cette fonction simule un effet lumineux qui peut être mélangé sur une surface en utilisant le mélange additif (`BLEND_RGBA_ADD` dans Pygame). Elle prend en charge des améliorations optionnelles telles que le bloom, le lissage et des ajustements de saturation.

source: **Lighting Modes**: -- - **Smooth**: Applies a Gaussian blur with a 5x5 kernel to soften the lighting effect. - **Saturation**: Adjusts color intensity using HSL color conversion. A value range of [-1.0, 1.0] is supported, with higher values increasing vibrancy and values below zero desaturating the output. - **Bloom**: Enhances brightness by applying a bloom effect, making bright areas appear more intense.
es: **Modos de iluminación**: -- - **Smooth**: Aplica un desenfoque gaussiano con un núcleo 5x5 para suavizar el efecto de iluminación. - **Saturation**: Ajusta la intensidad del color usando conversión de color HSL. Se admite un rango de valores de [-1.0, 1.0], donde valores más altos aumentan la vibración y valores por debajo de cero desaturan la salida. - **Bloom**: Mejora el brillo aplicando un efecto de bloom, haciendo que las áreas brillantes aparezcan más intensas.
fr: **Modes d'éclairage** : -- - **Lisse** : Applique un flou gaussien avec un noyau 5x5 pour adoucir l'effet lumineux. - **Saturation** : Ajuste l'intensité des couleurs en utilisant la conversion des couleurs HSL. Une plage de valeurs de [-1.0, 1.0] est prise en charge, avec des valeurs plus élevées augmentant la vivacité et des valeurs inférieures à zéro désaturant le résultat. - **Bloom** : Améliore la luminosité en appliquant un effet de bloom, rendant les zones lumineuses plus intenses.

source: **Lighting Parameters**: - - **Intensity**: Defines the brightness of the light. If set to zero, the function returns an empty `pygame.Surface` with the `RLEACCEL` flag. - **Color**: Specifies the light’s RGB coloration. Defaults to (128, 128, 128).
es: **Parámetros de iluminación**: - - **Intensity**: Define el brillo de la luz. Si se establece en cero, la función devuelve una `pygame.Surface` vacía con la bandera `RLEACCEL`. - **Color**: Especifica la coloración RGB de la luz. Por defecto es (128, 128, 128).
fr: **Paramètres d'éclairage** : - - **Intensité** : Définit la luminosité de la lumière. Si elle est réglée sur zéro, la fonction renvoie une `pygame.Surface` vide avec le drapeau `RLEACCEL`. - **Couleur** : Spécifie la couleur RGB de la lumière. Par défaut (128, 128, 128).

source: `x` (int): X-coordinate of the light source (must be within screen width).
es: `x` (int): Coordenada X de la fuente de luz (debe estar dentro del ancho de la pantalla).
fr: `x` (int) : Coordonnée X de la source lumineuse (doit être dans la largeur de l'écran).

source: `y` (int): Y-coordinate of the light source (must be within screen height).
es: `y` (int): Coordenada Y de la fuente de luz (debe estar dentro de la altura de la pantalla).
fr: `y` (int) : Coordonnée Y de la source lumineuse (doit être dans la hauteur de l'écran).

source: `mask_alpha` (numpy.ndarray, shape (w, h), dtype uint8): A 2D NumPy array containing the alpha values of the light mask. Using a radial gradient mask with maximum intensity at the center is recommended.
es: `mask_alpha` (numpy.ndarray, forma (w, h), dtype uint8): Un array 2D de NumPy que contiene los valores alfa de la máscara de luz. Se recomienda usar una máscara de gradiente radial con intensidad máxima en el centro.
fr: `mask_alpha` (numpy.ndarray, forme (w, h), dtype uint8) : Un tableau NumPy 2D contenant les valeurs alpha du masque lumineux. L'utilisation d'un masque de gradient radial avec une intensité maximale au centre est recommandée.

source: `smooth` (bool, optional, default=False): If `True`, applies a blur effect to soften the lighting.
es: `smooth` (bool, opcional, predeterminado=False): Si es `True`, aplica un efecto de desenfoque para suavizar la iluminación.
fr: `smooth` (bool, optionnel, défaut=False) : Si `True`, applique un effet de flou pour adoucir l'éclairage.

source: `saturation` (bool, optional, default=False): If `True`, increases color intensity using HSL conversion.
es: `saturation` (bool, opcional, predeterminado=False): Si es `True`, aumenta la intensidad del color usando conversión HSL.
fr: `saturation` (bool, optionnel, défaut=False) : Si `True`, augmente l'intensité des couleurs en utilisant la conversion HSL.

source: `sat_value` (float, optional, default=0.2): Adjusts the saturation level. The valid range is [-1.0, 1.0]. Higher values increase vibrancy, while negative values desaturate the effect.
es: `sat_value` (float, opcional, predeterminado=0.2): Ajusta el nivel de saturación. El rango válido es [-1.0, 1.0]. Valores más altos aumentan la vibración, mientras que valores negativos desaturan el efecto.
fr: `sat_value` (float, optionnel, défaut=0.2) : Ajuste le niveau de saturation. Le range valide est [-1.0, 1.0]. Des valeurs plus élevées augmentent la vivacité, tandis que des valeurs négatives désaturent l'effet.

source: `bloom` (bool, optional, default=False): If `True`, enables a bloom effect, enhancing brightness.
es: `bloom` (bool, opcional, predeterminado=False): Si es `True`, habilita un efecto de bloom, mejorando el brillo.
fr: `bloom` (bool, optionnel, défaut=False) : Si `True`, active un effet de bloom, améliorant la luminosité.

source: `bloom_threshold` (unsigned char, optional, default=64): The brightness threshold for the bloom effect, in the range [0, 255]. Lower values create a stronger bloom effect.
es: `bloom_threshold` (unsigned char, opcional, predeterminado=64): El umbral de brillo para el efecto de bloom, en el rango [0, 255]. Valores más bajos crean un efecto de bloom más fuerte.
fr: `bloom_threshold` (char non signé, optionnel, défaut=64) : Le seuil de luminosité pour l'effet de bloom, dans la plage [0, 255]. Des valeurs plus basses créent un effet de bloom plus fort.

source: A tuple containing: - A 24-bit Pygame surface representing the generated light effect. - The surface width (`sw`). - The surface height (`sh`).
es: Una tupla que contiene: - Una superficie de Pygame de 24 bits que representa el efecto de luz generado. - El ancho de la superficie (`sw`). - La altura de la superficie (`sh`).
fr: Un tuple contenant : - Une surface Pygame 24 bits représentant l'effet lumineux généré. - La largeur de la surface (`sw`). - La hauteur de la surface (`sh`).

source: Chromatic aberration (returns a new surface).
es: Aberración cromática (devuelve una nueva superficie).
fr: Abération chromatique (renvoie une nouvelle surface).

source: This function applies a chromatic aberration effect to a given surface. The amplitude of the effect is proportional to the distance from the center of the effect, creating a distortion of the RGB color channels. The chromatic aberration effect simulates the color shift that occurs due to optical imperfections in lenses.
es: Esta función aplica un efecto de aberración cromática a una superficie dada. La amplitud del efecto es proporcional a la distancia desde el centro del efecto, creando una distorsión en los canales de color RGB. El efecto de aberración cromática simula el cambio de color que ocurre debido a imperfecciones ópticas en las lentes.
fr: Cette fonction applique un effet d'abération chromatique à une surface donnée. L'amplitude de l'effet est proportionnelle à la distance par rapport au centre de l'effet, créant une distorsion des canaux de couleur RVB. L'effet d'abération chromatique simule le décalage de couleur qui se produit en raison des imperfections optique dans les lentilles.

source: `surface_` (pygame.Surface): A 24-bit or 32-bit compatible Pygame surface to which the chromatic aberration effect will be applied.
es: `surface_` (pygame.Surface): Una superficie de Pygame compatible de 24 o 32 bits a la que se aplicará el efecto de aberración cromática.
fr: `surface_` (pygame.Surface) : Une surface Pygame compatible 24 bits ou 32 bits sur laquelle l'effet d'abération chromatique sera appliqué.

source: `delta_x` (unsigned int): The X-coordinate of the chromatic center effect. This value must be within the range [0, surface width].
es: `delta_x` (unsigned int): La coordenada X del centro del efecto cromático. Este valor debe estar dentro del rango [0, ancho de la superficie].
fr: `delta_x` (int non signé) : La coordonnée X du centre de l'effet chromatique. Cette valeur doit être dans la plage [0, largeur de la surface].

source: `delta_y` (unsigned int): The Y-coordinate of the chromatic center effect. This value must be within the range [0, surface height].
es: `delta_y` (unsigned int): La coordenada Y del centro del efecto cromático. Este valor debe estar dentro del rango [0, altura de la superficie].
fr: `delta_y` (int non signé) : La coordonnée Y du centre de l'effet chromatique. Cette valeur doit être dans la plage [0, hauteur de la surface].

source: `zoom` (float, optional, default=0.9999): The zoom factor for the effect. A value of 0.9999 means no zoom (full image), while a value less than 1.0 will zoom in. It must be in the range [0.0, 0.9999].
es: `zoom` (float, opcional, predeterminado=0.9999): El factor de zoom para el efecto. Un valor de 0.9999 significa sin zoom (imagen completa), mientras que un valor menor que 1.0 hará zoom. Debe estar en el rango [0.0, 0.9999].
fr: `zoom` (float, optionnel, défaut=0.9999) : Le facteur de zoom pour l'effet. Une valeur de 0.9999 signifie aucun zoom (image complète), tandis qu'une valeur inférieure à 1.0 effectuera un zoom avant. Elle doit être dans la plage [0.0, 0.9999].

source: `fx` (float, optional, default=0.02): The offset applied to the RGB channels. This value determines the intensity of the chromatic aberration effect and must be in the range [0.0, 0.2].
es: `fx` (float, opcional, predeterminado=0.02): El desplazamiento aplicado a los canales RGB. Este valor determina la intensidad del efecto de aberración cromática y debe estar en el rango [0.0, 0.2].
fr: `fx` (float, optionnel, défaut=0.02) : Le décalage appliqué aux canaux RGB. Cette valeur détermine l'intensité de l'effet d'abération chromatique et doit être dans la plage [0.0, 0.2].

source: A new Pygame surface with the chromatic aberration effect applied.
es: Una nueva superficie de Pygame con el efecto de aberración cromática aplicado.
fr: Une nouvelle surface Pygame avec l'effet d'abération chromatique appliqué.

source: The function returns a new surface with the chromatic aberration effect applied.
es: La función devuelve una nueva superficie con el efecto de aberración cromática aplicado.
fr: La fonction renvoie une nouvelle surface avec l'effet d'abération chromatique appliqué.

source: The `delta_x` and `delta_y` parameters define the point at which the chromatic effect is centered, and the distortion becomes more pronounced as the distance from this point increases.
es: Los parámetros `delta_x` y `delta_y` definen el punto en el que se centra el efecto cromático, y la distorsión se vuelve más pronunciada a medida que aumenta la distancia desde este punto.
fr: Les paramètres `delta_x` et `delta_y` définissent le point où l'effet chromatique est centré, et la distorsion devient plus prononcée à mesure que la distance par rapport à ce point augmente.

source: The `zoom` and `fx` parameters control the extent and intensity of the effect, respectively.
es: Los parámetros `zoom` y `fx` controlan la extensión y la intensidad del efecto, respectivamente.
fr: Les paramètres `zoom` et `fx` contrôlent respectivement l'étendue et l'intensité de l'effet.

source: Chromatic aberration (inplace).
es: Aberración cromática (in situ).
fr: Abération chromatique (sur place).

source: This function applies a chromatic aberration effect to a given surface in place. The amplitude of the effect is proportional to the distance from the center of the effect. Unlike the `chromatic` function, this function modifies the original surface rather than returning a new surface. It simulates the optical effect of color distortion typically observed due to lens imperfections.
es: Esta función aplica un efecto de aberración cromática a una superficie dada in situ. La amplitud del efecto es proporcional a la distancia desde el centro del efecto. A diferencia de la función `chromatic`, esta función modifica la superficie original en lugar de devolver una nueva superficie. Simula el efecto óptico de distorsión de color que se observa típicamente debido a imperfecciones en las lentes.
fr: Cette fonction applique un effet d'abération chromatique à une surface donnée sur place. L'amplitude de l'effet est proportionnelle à la distance par rapport au centre de l'effet. Contrairement à la fonction `chromatic`, cette fonction modifie la surface originale plutôt que de renvoyer une nouvelle surface. Elle simule l'effet optique de distorsion des couleurs généralement observé en raison des imperfections des lentilles.

source: `surface_` (pygame.Surface): A 24-bit or 32-bit compatible Pygame surface to which the chromatic aberration effect will be applied in place.
es: `surface_` (pygame.Surface): Una superficie de Pygame compatible de 24 o 32 bits a la que se aplicará el efecto de aberración cromática in situ.
fr: `surface_` (pygame.Surface) : Une surface Pygame compatible 24 bits ou 32 bits sur laquelle l'effet d'abération chromatique sera appliqué sur place.

source: The same Pygame surface with the chromatic aberration effect applied in place.
es: La misma superficie de Pygame con el efecto de aberración cromática aplicado in situ.
fr: La même surface Pygame avec l'effet d'abération chromatique appliqué sur place.

source: The function modifies the original surface rather than returning a new one.
es: La función modifica la superficie original en lugar de devolver una nueva.
fr: La fonction modifie la surface originale plutôt que de renvoyer une nouvelle surface.

source: The `delta_x` and `delta_y` parameters define the point at which the chromatic effect is centered. The effect becomes more pronounced the farther away the pixel is from this center point.
es: Los parámetros `delta_x` y `delta_y` definen el punto en el que se centra el efecto cromático. El efecto se vuelve más pronunciado cuanto más lejos esté el píxel de este punto central.
fr: Les paramètres `delta_x` et `delta_y` définissent le point où l'effet chromatique est centré. L'effet devient plus prononcé à mesure que le pixel s'éloigne de ce point central.

source: The `zoom` and `fx` parameters control the extent and intensity of the chromatic aberration effect.
es: Los parámetros `zoom` y `fx` controlan la extensión y la intensidad del efecto de aberración cromática.
fr: Les paramètres `zoom` et `fx` contrôlent respectivement l'étendue et l'intensité de l'effet d'abération chromatique.

source: This function is useful when you want to apply the chromatic aberration effect directly to a surface without needing to create a new surface.
es: Esta función es útil cuando se desea aplicar el efecto de aberración cromática directamente a una superficie sin necesidad de crear una nueva superficie.
fr: Cette fonction est utile lorsque vous souhaitez appliquer l'effet d'abération chromatique directement à une surface sans avoir à créer une nouvelle surface.

source: Zoom within an image (return a copy).
es: Zoom dentro de una imagen (devuelve una copia).
fr: Zoom dans une image (renvoie une copie).

source: This function zooms in or zooms out on an image toward a given center point (delta_x, delta_y) using a specified zoom factor (zx). The function supports 24-bit and 32-bit image formats, and the output image will have the same format as the input. The zoom effect is more performant on 24-bit images.
es: Esta función hace zoom dentro o fuera de una imagen hacia un punto central dado (delta_x, delta_y) usando un factor de zoom especificado (zx). La función admite formatos de imagen de 24 y 32 bits, y la imagen de salida tendrá el mismo formato que la entrada. El efecto de zoom es más eficiente en imágenes de 24 bits.
fr: Cette fonction effectue un zoom avant ou arrière sur une image vers un point central spécifié (delta_x, delta_y) en utilisant un facteur de zoom (zx). La fonction prend en charge les formats d'image 24 bits et 32 bits, et l'image de sortie aura le même format que l'entrée. L'effet de zoom est plus performant sur les images 24 bits.

source: `surface_` (pygame.Surface): The Pygame surface to apply the zoom effect on. This can be a 24-bit or 32-bit compatible surface.
es: `surface_` (pygame.Surface): La superficie de Pygame sobre la cual aplicar el efecto de zoom. Puede ser una superficie compatible de 24 o 32 bits.
fr: `surface_` (pygame.Surface) : La surface Pygame sur laquelle appliquer l'effet de zoom. Cela peut être une surface compatible 24 bits ou 32 bits.

source: `delta_x` (unsigned int): The X-coordinate of the zoom center. This value must be within the range [0, surface width].
es: `delta_x` (unsigned int): La coordenada X del centro del zoom. Este valor debe estar dentro del rango [0, ancho de la superficie].
fr: `delta_x` (entier non signé) : La coordonnée X du centre du zoom. Cette valeur doit être dans la plage [0, largeur de la surface].

source: `delta_y` (unsigned int): The Y-coordinate of the zoom center. This value must be within the range [0, surface height].
es: `delta_y` (unsigned int): La coordenada Y del centro del zoom. Este valor debe estar dentro del rango [0, altura de la superficie].
fr: `delta_y` (entier non signé) : La coordonnée Y du centre du zoom. Cette valeur doit être dans la plage [0, hauteur de la surface].

source: `zx` (float, optional, default=0.9999): The zoom factor. This value must be in the range (0.0, 1.0). A value of 1.0 will result in no zoom (full image), while values closer to 0.0 zoom in. The zoom intensity is attenuated around 1.0, with the maximum zoom effect occurring as zx approaches 0.0.
es: `zx` (float, opcional, predeterminado=0.9999): El factor de zoom. Este valor debe estar en el rango (0.0, 1.0). Un valor de 1.0 resultará en ningún zoom (imagen completa), mientras que valores más cercanos a 0.0 harán zoom. La intensidad del zoom se atenúa alrededor de 1.0, con el máximo efecto de zoom ocurriendo cuando zx se acerca a 0.0.
fr: `zx` (flottant, optionnel, par défaut 0.9999) : Le facteur de zoom. Cette valeur doit être dans la plage (0.0, 1.0). Une valeur de 1.0 n'effectue pas de zoom (image entière), tandis que les valeurs proches de 0.0 effectuent un zoom avant. L'intensité du zoom est atténuée autour de 1.0, l'effet de zoom maximal se produisant lorsque zx approche 0.0.

source: A new Pygame surface with the zoom effect applied. The output image will have the same format (24-bit or 32-bit) as the input image.
es: Una nueva superficie de Pygame con el efecto de zoom aplicado. La imagen de salida tendrá el mismo formato (24 o 32 bits) que la imagen de entrada.
fr: Une nouvelle surface Pygame avec l'effet de zoom appliqué. L'image de sortie aura le même format (24 bits ou 32 bits) que l'image d'entrée.

source: The zoom effect centers around the point specified by `delta_x` and `delta_y`. The pixels closer to this center will appear less zoomed, while those farther away will experience more pronounced zooming.
es: El efecto de zoom se centra alrededor del punto especificado por `delta_x` y `delta_y`. Los píxeles más cercanos a este centro aparecerán menos ampliados, mientras que los más alejados experimentarán un zoom más pronunciado.
fr: L'effet de zoom est centré autour du point spécifié par `delta_x` et `delta_y`. Les pixels plus proches de ce centre apparaîtront moins zoomés, tandis que ceux plus éloignés subiront un zoom plus prononcé.

source: This function returns a new surface with the zoom effect applied, leaving the original surface unchanged.
es: Esta función devuelve una nueva superficie con el efecto de zoom aplicado, dejando la superficie original sin cambios.
fr: Cette fonction renvoie une nouvelle surface avec l'effet de zoom appliqué, laissant la surface originale inchangée.

source: Performance is generally better with 24-bit images due to fewer data channels to process.
es: El rendimiento es generalmente mejor con imágenes de 24 bits debido a menos canales de datos para procesar.
fr: Les performances sont généralement meilleures avec les images 24 bits en raison de moins de canaux de données à traiter.

source: Zoom within an image (inplace).
es: Zoom dentro de una imagen (in situ).
fr: Zoom dans une image (sur place).

source: This function zooms in or zooms out on an image toward a given center point (delta_x, delta_y) using a specified zoom factor (zx), modifying the image in place. The function supports 24-bit and 32-bit image formats, and the input image format remains unchanged during the process.
es: Esta función hace zoom dentro o fuera de una imagen hacia un punto central dado (delta_x, delta_y) usando un factor de zoom especificado (zx), modificando la imagen in situ. La función admite formatos de imagen de 24 y 32 bits, y el formato de la imagen de entrada permanece sin cambios durante el proceso.
fr: Cette fonction effectue un zoom avant ou arrière sur une image vers un point central spécifié (delta_x, delta_y) en utilisant un facteur de zoom (zx), modifiant l'image sur place. La fonction prend en charge les formats d'image 24 bits et 32 bits, et le format de l'image d'entrée reste inchangé pendant le processus.

source: `zx` (float, optional, default=0.9999): The zoom factor. This value must be in the range (0.0, 1.0). A value of 1.0 will result in no zoom (full image), while values closer to 0.0 zoom in. The zoom effect is attenuated around 1.0, with the maximum zoom effect occurring as zx approaches 0.0.
es: `zx` (float, opcional, predeterminado=0.9999): El factor de zoom. Este valor debe estar en el rango (0.0, 1.0). Un valor de 1.0 resultará en ningún zoom (imagen completa), mientras que valores más cercanos a 0.0 harán zoom. El efecto de zoom se atenúa alrededor de 1.0, con el máximo efecto de zoom ocurriendo cuando zx se acerca a 0.0.
fr: `zx` (flottant, optionnel, par défaut 0.9999) : Le facteur de zoom. Cette valeur doit être dans la plage (0.0, 1.0). Une valeur de 1.0 n'effectue pas de zoom (image entière), tandis que les valeurs proches de 0.0 effectuent un zoom avant. L'effet de zoom est atténué autour de 1.0, l'effet de zoom maximal se produisant lorsque zx approche 0.0.

source: This function modifies the `surface_` in place. It does not return a new surface.
es: Esta función modifica la `surface_` in situ. No devuelve una nueva superficie.
fr: Cette fonction modifie `surface_` sur place. Elle ne renvoie pas une nouvelle surface.
