Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader_gpu.po
Languages: es, fr

source: This function downscales an input GPU-based image into four progressively smaller sub-arrays with resolutions reduced by factors of 2, 4, 8, and 16. It is compatible with 24-bit and 32-bit images (RGB format, uint8).
es: Esta función reduce la resolución de una imagen basada en GPU en cuatro subarreglos progresivamente más pequeños con resoluciones reducidas por factores de 2, 4, 8 y 16. Es compatible con imágenes de 24 bits y 32 bits (formato RGB, uint8).
fr: Cette fonction réduit l'échelle d'une image basée sur le GPU en quatre sous-tableaux progressivement plus petits avec des résolutions réduites par des facteurs de 2, 4, 8 et 16. Elle est compatible avec les images 24 bits et 32 bits (format RGB, uint8).

source: **gpu_array** (*cupy.ndarray*): A 3D CuPy array with shape (height, width, 3) and dtype uint8, representing an RGB image stored on the GPU.
es: **gpu_array** (*cupy.ndarray*): Un arreglo 3D de CuPy con forma (altura, ancho, 3) y tipo de datos uint8, que representa una imagen RGB almacenada en la GPU.
fr: **gpu_array** (*cupy.ndarray*) : Un tableau 3D CuPy de forme (hauteur, largeur, 3) et de type uint8, représentant une image RGB stockée sur le GPU.

source: **tuple of cupy.ndarray**: A tuple containing four downscaled versions of the input image with shapes (H/2, W/2, 3), (H/4, W/4, 3), (H/8, W/8, 3), and (H/16, W/16, 3).
es: **tuple of cupy.ndarray**: Una tupla que contiene cuatro versiones reducidas de la imagen de entrada con formas (H/2, W/2, 3), (H/4, W/4, 3), (H/8, W/8, 3) y (H/16, W/16, 3).
fr: **tuple de cupy.ndarray** : Un tuple contenant quatre versions réduites de l'image d'entrée avec des formes (H/2, W/2, 3), (H/4, W/4, 3), (H/8, W/8, 3) et (H/16, W/16, 3).

source: The function performs downscaling using `cupyx.scipy.ndimage.zoom`, applying nearest-neighbor interpolation (`order=0`) to preserve hard edges.
es: La función realiza la reducción de resolución utilizando `cupyx.scipy.ndimage.zoom`, aplicando interpolación de vecino más cercano (`order=0`) para preservar los bordes definidos.
fr: La fonction effectue le downscaling en utilisant `cupyx.scipy.ndimage.zoom`, en appliquant une interpolation du plus proche voisin (`order=0`) pour préserver les contours nets.

source: Pixels outside the boundaries are filled with zero (`mode='constant', cval=0.0`).
es: Los píxeles fuera de los límites se rellenan con cero (`mode='constant', cval=0.0`).
fr: Les pixels en dehors des limites sont remplis avec zéro (`mode='constant', cval=0.0`).

source: GPU synchronization is performed to ensure all CUDA operations complete before returning.
es: Se realiza una sincronización de la GPU para asegurar que todas las operaciones CUDA se completen antes de devolver el resultado.
fr: La synchronisation du GPU est effectuée pour s'assurer que toutes les opérations CUDA se terminent avant le retour.

source: Upscale an image on the GPU using interpolation.
es: Amplía una imagen en la GPU utilizando interpolación.
fr: Agrandir une image sur le GPU en utilisant l'interpolation.

source: This function resizes a GPU-based image to the specified `new_width` and `new_height` using the specified interpolation order. The resizing is performed using `cupyx.scipy.ndimage.zoom`, which supports different interpolation methods.
es: Esta función redimensiona una imagen basada en GPU al `new_width` y `new_height` especificados utilizando el orden de interpolación indicado. El redimensionamiento se realiza utilizando `cupyx.scipy.ndimage.zoom`, que admite diferentes métodos de interpolación.
fr: Cette fonction redimensionne une image basée sur le GPU aux dimensions spécifiées `new_width` et `new_height` en utilisant l'ordre d'interpolation indiqué. Le redimensionnement est réalisé avec `cupyx.scipy.ndimage.zoom`, qui prend en charge différentes méthodes d'interpolation.

source: **gpu_array_** (*cupy.ndarray*): A 3D GPU array (height x width x 3) representing an RGB image in `uint8` format.
es: **gpu_array_** (*cupy.ndarray*): Un arreglo 3D en la GPU (altura x ancho x 3) que representa una imagen RGB en formato `uint8`.
fr: **gpu_array_** (*cupy.ndarray*) : Un tableau GPU 3D (hauteur x largeur x 3) représentant une image RGB au format `uint8`.

source: **new_width** (*int*): The desired width of the upscaled image.
es: **new_width** (*int*): El ancho deseado de la imagen ampliada.
fr: **new_width** (*int*) : La largeur souhaitée de l'image agrandie.

source: **new_height** (*int*): The desired height of the upscaled image.
es: **new_height** (*int*): La altura deseada de la imagen ampliada.
fr: **new_height** (*int*) : La hauteur souhaitée de l'image agrandie.

source: **order_** (*int*, optional, default=0): The interpolation order for resizing: - `0`: Nearest-neighbor interpolation. - `1`: Bilinear interpolation. - `3`: Bicubic interpolation. Higher orders provide smoother results but increase computation time.
es: **order_** (*int*, opcional, predeterminado=0): El orden de interpolación para el redimensionamiento: - `0`: Interpolación de vecino más cercano. - `1`: Interpolación bilineal. - `3`: Interpolación bicúbica. Órdenes más altos proporcionan resultados más suaves pero aumentan el tiempo de cálculo.
fr: **order_** (*int*, optionnel, valeur par défaut = 0) : L'ordre d'interpolation pour le redimensionnement : - `0` : Interpolation du plus proche voisin. - `1` : Interpolation bilinéaire. - `3` : Interpolation bicubique. Les ordres supérieurs offrent des résultats plus lisses mais augmentent le temps de calcul.

source: **cupy.ndarray**: The upscaled image as a GPU-based array with shape (`new_height`, `new_width`, 3).
es: **cupy.ndarray**: La imagen ampliada como un arreglo basado en GPU con forma (`new_height`, `new_width`, 3).
fr: **cupy.ndarray** : L'image agrandie sous forme de tableau basé sur le GPU avec une forme (`new_height`, `new_width`, 3).

source: The function ensures that the input array is of type `uint8` before processing.
es: La función asegura que el arreglo de entrada sea de tipo `uint8` antes del procesamiento.
fr: La fonction garantit que le tableau d'entrée est de type `uint8` avant le traitement.

source: The `mode='constant', cval=0.0` ensures that pixels outside the boundaries are treated as zero during interpolation.
es: El `mode='constant', cval=0.0` asegura que los píxeles fuera de los límites se traten como cero durante la interpolación.
fr: Le paramètre `mode='constant', cval=0.0` garantit que les pixels en dehors des limites sont traités comme des zéros lors de l'interpolation.

source: GPU synchronization (`cp.cuda.Stream.null.synchronize()`) is performed to ensure all operations complete before returning the result.
es: Se realiza una sincronización de la GPU (`cp.cuda.Stream.null.synchronize()`) para asegurar que todas las operaciones se completen antes de devolver el resultado.
fr: La synchronisation du GPU (`cp.cuda.Stream.null.synchronize()`) est effectuée pour s'assurer que toutes les opérations sont terminées avant de retourner le résultat.

source: Apply a Bloom Effect to a Pygame Surface using GPU Acceleration.
es: Aplica un efecto Bloom a una superficie de Pygame utilizando aceleración por GPU.
fr: Appliquer un effet Bloom à une surface Pygame en utilisant l'accélération GPU.

source: This function enhances bright regions of an image to create a glowing effect (bloom) using a multi-step process that involves: - Downscaling the image into progressively smaller sub-surfaces. - Applying a bright-pass filter to isolate bright areas. - Blurring the bright regions using a Gaussian filter. - Upscaling and blending the processed layers back into the original surface.
es: Esta función mejora las regiones brillantes de una imagen para crear un efecto de resplandor (bloom) utilizando un proceso de varios pasos que incluye: - Reducir la resolución de la imagen en sub-superficies progresivamente más pequeñas. - Aplicar un filtro de paso brillante para aislar las áreas brillantes. - Desenfocar las regiones brillantes utilizando un filtro gaussiano. - Ampliar y mezclar las capas procesadas de nuevo en la superficie original.
fr: Cette fonction améliore les régions lumineuses d'une image pour créer un effet de halo (bloom) en utilisant un processus en plusieurs étapes, comprenant : - Une réduction progressive de l'image en sous-surfaces plus petites. - L'application d'un filtre de luminance pour isoler les zones lumineuses. - Un flou appliqué aux régions lumineuses à l'aide d'un filtre gaussien. - Une mise à l'échelle et un mélange des couches traitées avec la surface originale.

source: **surface_** (*pygame.Surface*): The input surface to apply the bloom effect on.
es: **surface_** (*pygame.Surface*): La superficie de entrada a la que se aplicará el efecto bloom.
fr: **surface_** (*pygame.Surface*) : La surface d'entrée sur laquelle appliquer l'effet bloom.

source: **threshold_** (*int*, optional, default=128): The brightness threshold for the bright-pass filter. Pixels with intensity above this value contribute to the bloom effect. Must be in range [0, 255].
es: **threshold_** (*int*, opcional, predeterminado=128): El umbral de brillo para el filtro de paso brillante. Los píxeles con intensidad por encima de este valor contribuyen al efecto bloom. Debe estar en el rango [0, 255].
fr: **threshold_** (*int*, optionnel, valeur par défaut = 128) : Le seuil de luminance pour le filtre de luminance. Les pixels ayant une intensité supérieure à cette valeur contribuent à l'effet bloom. Doit être compris dans l'intervalle [0, 255].

source: **fast_** (*bool*, optional, default=True): When `True`, only the lowest-resolution downsample (x16) is used for bloom. When `False`, multiple downsampled layers (x2, x4, x8, x16) are processed and blended for a more detailed effect.
es: **fast_** (*bool*, opcional, predeterminado=True): Cuando es `True`, solo se utiliza la reducción de resolución de menor resolución (x16) para el bloom. Cuando es `False`, se procesan y mezclan múltiples capas reducidas (x2, x4, x8, x16) para un efecto más detallado.
fr: **fast_** (*bool*, optionnel, valeur par défaut = True) : Lorsque `True`, seule la réduction d'échelle la plus faible (x16) est utilisée pour l'effet bloom. Lorsque `False`, plusieurs niveaux de réduction d'échelle (x2, x4, x8, x16) sont traités et mélangés pour un effet plus détaillé.

source: **flag_** (*int*, optional, default=pygame.BLEND_RGB_ADD): The blending mode used when merging the bloom effect back onto the original surface. Common flags include: - `pygame.BLEND_RGB_ADD` (default) - `pygame.BLEND_RGB_MULT`, etc.
es: **flag_** (*int*, opcional, predeterminado=pygame.BLEND_RGB_ADD): El modo de mezcla utilizado al fusionar el efecto bloom de nuevo en la superficie original. Los modos comunes incluyen: - `pygame.BLEND_RGB_ADD` (predeterminado) - `pygame.BLEND_RGB_MULT`, etc.
fr: **flag_** (*int*, optionnel, valeur par défaut = pygame.BLEND_RGB_ADD) : Le mode de fusion utilisé lors de l'ajout de l'effet bloom à la surface originale. Modes courants : - `pygame.BLEND_RGB_ADD` (par défaut) - `pygame.BLEND_RGB_MULT`, etc.

source: **factor_** (*int*, optional, default=2): Determines how much the texture is downscaled. Must be in the range [0, 4], corresponding to downscaling by: - 1 (no reduction) - 2 (half-size) - 4 (quarter-size) - 8 (eighth-size)
es: **factor_** (*int*, opcional, predeterminado=2): Determina cuánto se reduce la textura. Debe estar en el rango [0, 4], correspondiendo a una reducción de: - 1 (sin reducción) - 2 (mitad del tamaño) - 4 (un cuarto del tamaño) - 8 (un octavo del tamaño).
fr: **factor_** (*int*, optionnel, valeur par défaut = 2) : Détermine le niveau de réduction de la texture. Doit être compris dans l'intervalle [0, 4], correspondant à : - 1 (pas de réduction) - 2 (moitié de la taille) - 4 (quart de la taille) - 8 (huitième de la taille)

source: **pygame.Surface**: The input surface blended with the bloom effect.
es: **pygame.Surface**: La superficie de entrada mezclada con el efecto bloom.
fr: **pygame.Surface** : La surface d'entrée fusionnée avec l'effet bloom.

source: **ValueError**: If the input image is too small to be processed.
es: **ValueError**: Si la imagen de entrada es demasiado pequeña para ser procesada.
fr: **ValueError** : Si l'image d'entrée est trop petite pour être traitée.

source: The bloom effect is achieved through a series of downscaling, filtering, and blending operations.
es: El efecto bloom se logra a través de una serie de operaciones de reducción de resolución, filtrado y mezcla.
fr: L'effet bloom est obtenu grâce à une série d'opérations de réduction d'échelle, de filtrage et de fusion.

source: The `pygame.BLEND_RGB_ADD` flag is used to add the bloom effect to the original surface.
es: El modo `pygame.BLEND_RGB_ADD` se utiliza para agregar el efecto bloom a la superficie original.
fr: Le drapeau `pygame.BLEND_RGB_ADD` est utilisé pour ajouter l'effet bloom à la surface originale.

source: Apply a Bloom Effect to an Image Represented as a GPU Array.
es: Aplica un efecto Bloom a una imagen representada como un arreglo de GPU.
fr: Appliquer un effet Bloom à une image représentée sous forme de tableau GPU.

source: This function performs a bloom effect on a given `gpu_array_`, which represents an image on the GPU. The process involves: - Downscaling the image into progressively smaller versions (x2, x4, x8, x16). - Applying a bright-pass filter to isolate high-intensity pixels. - Blurring the bright regions to create a glow effect. - Upscaling and blending the processed images to achieve the final bloom effect.
es: Esta función aplica un efecto bloom a un `gpu_array_` dado, que representa una imagen en la GPU. El proceso incluye: - Reducir la resolución de la imagen en versiones progresivamente más pequeñas (x2, x4, x8, x16). - Aplicar un filtro de paso brillante para aislar los píxeles de alta intensidad. - Desenfocar las regiones brillantes para crear un efecto de resplandor. - Ampliar y mezclar las imágenes procesadas para lograr el efecto bloom final.
fr: Cette fonction applique un effet bloom sur un `gpu_array_`, qui représente une image sur le GPU. Le processus comprend : - Une réduction progressive de l'image en versions plus petites (x2, x4, x8, x16). - L'application d'un filtre de luminance pour isoler les pixels à forte intensité. - Un flou appliqué aux régions lumineuses pour créer un effet de halo. - Une mise à l'échelle et un mélange des images traitées pour obtenir l'effet bloom final.

source: **gpu_array_** (*cupy.ndarray*): A 3D array representing the image in GPU memory. Must have dtype `cupy.uint8`.
es: **gpu_array_** (*cupy.ndarray*): Un arreglo 3D que representa la imagen en la memoria de la GPU. Debe tener el tipo de datos `cupy.uint8`.
fr: **gpu_array_** (*cupy.ndarray*) : Un tableau 3D représentant l'image en mémoire GPU. Doit être de type `cupy.uint8`.

source: **threshold_** (*int*, optional, default=128): The brightness threshold for the bright-pass filter. Pixels above this value contribute to bloom. Must be within [0, 255].
es: **threshold_** (*int*, opcional, predeterminado=128): El umbral de brillo para el filtro de paso brillante. Los píxeles por encima de este valor contribuyen al bloom. Debe estar dentro del rango [0, 255].
fr: **threshold_** (*int*, optionnel, valeur par défaut = 128) : Le seuil de luminance pour le filtre de luminance. Les pixels ayant une intensité supérieure à cette valeur contribuent à l'effet bloom. Doit être compris dans l'intervalle [0, 255].

source: **fast_** (*bool*, optional, default=True): When `True`, only the lowest-resolution downsample (x16) is used, reducing processing time. When `False`, multiple levels (x2, x4, x8, x16) are blended for a richer bloom effect.
es: **fast_** (*bool*, opcional, predeterminado=True): Cuando es `True`, solo se utiliza la reducción de resolución de menor resolución (x16), reduciendo el tiempo de procesamiento. Cuando es `False`, se mezclan múltiples niveles (x2, x4, x8, x16) para un efecto bloom más rico.
fr: **fast_** (*bool*, optionnel, valeur par défaut = True) : Lorsque `True`, seule la réduction d'échelle la plus faible (x16) est utilisée, réduisant ainsi le temps de traitement. Lorsque `False`, plusieurs niveaux (x2, x4, x8, x16) sont mélangés pour un effet bloom plus riche.

source: **flag_** (*int*, optional, default=pygame.BLEND_RGB_ADD): The blending mode used when merging the bloom effect layers.
es: **flag_** (*int*, opcional, predeterminado=pygame.BLEND_RGB_ADD): El modo de mezcla utilizado al fusionar las capas del efecto bloom.
fr: **flag_** (*int*, optionnel, valeur par défaut = pygame.BLEND_RGB_ADD) : Le mode de fusion utilisé lors de la fusion des couches de l'effet bloom.

source: **mask_** (*optional*, default=None): Unused parameter, reserved for future implementations.
es: **mask_** (*opcional*, predeterminado=None): Parámetro no utilizado, reservado para implementaciones futuras.
fr: **mask_** (*optionnel*, valeur par défaut = None) : Paramètre inutilisé, réservé pour les futures implémentations.

source: **tuple of pygame.Surface**: The processed bloom effect surfaces at different downscaling levels (s2, s4, s8, s16). If `fast_` is enabled, only `s16` is used.
es: **tuple of pygame.Surface**: Las superficies del efecto bloom procesadas en diferentes niveles de reducción de resolución (s2, s4, s8, s16). Si `fast_` está habilitado, solo se utiliza `s16`.
fr: **tuple de pygame.Surface** : Les surfaces traitées de l'effet bloom à différents niveaux de réduction d'échelle (s2, s4, s8, s16). Si `fast_` est activé, seul `s16` est utilisé.

source: Apply a cartoon effect to a given surface using GPU acceleration.
es: Aplica un efecto de dibujo animado a una superficie dada utilizando aceleración por GPU.
fr: Appliquer un effet cartoon à une surface donnée en utilisant l'accélération GPU.

source: This function processes an image to generate a cartoon-like effect by applying edge detection, median filtering, and color quantization. The effect can also include contour outlining if enabled.
es: Esta función procesa una imagen para generar un efecto de dibujo animado aplicando detección de bordes, filtrado de mediana y cuantización de colores. El efecto también puede incluir contornos si está habilitado.
fr: Cette fonction traite une image pour générer un effet de type cartoon en appliquant une détection de contours, un filtrage médian et une quantification des couleurs. L'effet peut également inclure un contour des bords si activé.

source: **surface_** (*pygame.Surface*): The input image surface to be processed.
es: **surface_** (*pygame.Surface*): La superficie de la imagen de entrada que se procesará.
fr: **surface_** (*pygame.Surface*) : La surface d'image d'entrée à traiter.

source: **sobel_threshold_** (*int*, optional, default=128): The threshold value for the Sobel edge detection filter.
es: **sobel_threshold_** (*int*, opcional, predeterminado=128): El valor de umbral para el filtro de detección de bordes Sobel.
fr: **sobel_threshold_** (*int*, optionnel, valeur par défaut = 128) : La valeur de seuil pour le filtre de détection des contours Sobel.

source: **median_kernel_** (*int*, optional, default=2): Kernel size for median filtering (used to reduce noise while preserving edges).
es: **median_kernel_** (*int*, opcional, predeterminado=2): Tamaño del kernel para el filtrado de mediana (utilizado para reducir el ruido mientras se preservan los bordes).
fr: **median_kernel_** (*int*, optionnel, valeur par défaut = 2) : Taille du noyau pour le filtrage médian (utilisé pour réduire le bruit tout en préservant les contours).

source: **color_** (*int*, optional, default=8): Number of maximum colors to be used in the cartoon effect (color reduction).
es: **color_** (*int*, opcional, predeterminado=8): Número máximo de colores que se utilizarán en el efecto de dibujo animado (reducción de color).
fr: **color_** (*int*, optionnel, valeur par défaut = 8) : Nombre maximum de couleurs à utiliser dans l'effet cartoon (réduction des couleurs).

source: **contour_** (*bool*, optional, default=False): Whether to draw contours on the edges detected in the image.
es: **contour_** (*bool*, opcional, predeterminado=False): Si se deben dibujar contornos en los bordes detectados en la imagen.
fr: **contour_** (*bool*, optionnel, valeur par défaut = False) : Indique s'il faut dessiner des contours sur les bords détectés dans l'image.

source: **flag_** (*int*, optional, default=BLEND_RGB_ADD): Blending mode used to combine the effect with the original image.
es: **flag_** (*int*, opcional, predeterminado=BLEND_RGB_ADD): Modo de mezcla utilizado para combinar el efecto con la imagen original.
fr: **flag_** (*int*, optionnel, valeur par défaut = BLEND_RGB_ADD) : Mode de fusion utilisé pour combiner l'effet avec l'image originale.

source: **pygame.Surface**: The transformed surface with the cartoon effect applied.
es: **pygame.Surface**: La superficie transformada con el efecto de dibujo animado aplicado.
fr: **pygame.Surface** : La surface transformée avec l'effet cartoon appliqué.

source: The cartoon effect is achieved through a series of edge detection, filtering, and blending operations.
es: El efecto de dibujo animado se logra a través de una serie de operaciones de detección de bordes, filtrado y mezcla.
fr: L'effet cartoon est obtenu grâce à une série d'opérations de détection de contours, de filtrage et de fusion.

source: The `BLEND_RGB_ADD` flag is used to add the cartoon effect to the original surface.
es: El modo `BLEND_RGB_ADD` se utiliza para agregar el efecto de dibujo animado a la superficie original.
fr: Le drapeau `BLEND_RGB_ADD` est utilisé pour ajouter l'effet cartoon à la surface originale.

source: Blend a source texture toward a destination texture (transition effect).
es: Mezcla una textura fuente hacia una textura de destino (efecto de transición).
fr: Fusionner une texture source avec une texture de destination (effet de transition).

source: This function blends a source Pygame surface onto a destination surface, creating a transition effect based on the specified percentage. The blending is performed using the following calculations: - **Alpha**: `outA = SrcA + DstA * (1 - SrcA)` - **RGB**: `outRGB = SrcRGB + DstRGB * (1 - SrcA)`
es: Esta función mezcla una superficie de Pygame fuente en una superficie de destino, creando un efecto de transición basado en el porcentaje especificado. La mezcla se realiza utilizando los siguientes cálculos: - **Alpha**: `outA = SrcA + DstA * (1 - SrcA)` - **RGB**: `outRGB = SrcRGB + DstRGB * (1 - SrcA)`
fr: Cette fonction fusionne une surface source Pygame avec une surface de destination, créant un effet de transition basé sur le pourcentage spécifié. La fusion est réalisée en utilisant les calculs suivants : - **Alpha** : `outA = SrcA + DstA * (1 - SrcA)` - **RGB** : `outRGB = SrcRGB + DstRGB * (1 - SrcA)`

source: **source_** (*pygame.Surface*): The source surface to be blended.
es: **source_** (*pygame.Surface*): La superficie fuente que se mezclará.
fr: **source_** (*pygame.Surface*) : La surface source à fusionner.

source: **destination_** (*pygame.Surface*): The destination surface onto which the source will be blended.
es: **destination_** (*pygame.Surface*): La superficie de destino en la que se mezclará la fuente.
fr: **destination_** (*pygame.Surface*) : La surface de destination sur laquelle la source sera fusionnée.
