Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: `angles` (numpy.ndarray): A 1D C-buffer containing the angles. This buffer is obtained from the `tunnel_modeling24` function.
es: `angles` (numpy.ndarray): Un buffer C 1D que contiene los ángulos. Este buffer se obtiene de la función `tunnel_modeling24`.
fr: `angles` (numpy.ndarray) : Un tampon C 1D contenant les angles. Ce tampon est obtenu à partir de la fonction `tunnel_modeling24`.

source: `shades` (numpy.ndarray): A 1D C-buffer containing the shades. This buffer is obtained from the `tunnel_modeling24` function.
es: `shades` (numpy.ndarray): Un buffer C 1D que contiene las sombras. Este buffer se obtiene de la función `tunnel_modeling24`.
fr: `shades` (numpy.ndarray) : Un tampon C 1D contenant les ombres. Ce tampon est obtenu à partir de la fonction `tunnel_modeling24`.

source: `scr_data` (numpy.ndarray): A 1D C-buffer containing the background pixels. This buffer is obtained from the `tunnel_modeling24` function.
es: `scr_data` (numpy.ndarray): Un buffer C 1D que contiene los píxeles de fondo. Este buffer se obtiene de la función `tunnel_modeling24`.
fr: `scr_data` (numpy.ndarray) : Un tampon C 1D contenant les pixels de fond. Ce tampon est obtenu à partir de la fonction `tunnel_modeling24`.

source: `dest_array` (numpy.ndarray): A 1D C-buffer, typically empty. It should have the same size as the output image (width * height * 4 for RGBA). This buffer is used to build the final texture effect.
es: `dest_array` (numpy.ndarray): Un buffer C 1D, típicamente vacío. Debe tener el mismo tamaño que la imagen de salida (ancho * alto * 4 para RGBA). Este buffer se utiliza para construir el efecto de textura final.
fr: `dest_array` (numpy.ndarray) : Un tampon C 1D, généralement vide. Il doit avoir la même taille que l'image de sortie (largeur * hauteur * 4 pour RGBA). Ce tampon est utilisé pour construire l'effet de texture final.

source: `pygame.Surface`: A 24-bit surface with the rendered tunnel effect.
es: `pygame.Surface`: Una superficie de 24 bits con el efecto de túnel renderizado.
fr: `pygame.Surface` : Une surface 24 bits avec l'effet de tunnel rendu.

source: Generate 32-bit Tunnel Modeling Effect.
es: Generar un efecto de modelado de túnel de 32 bits.
fr: Générer un effet de modélisation de tunnel en 32 bits.

source: This function simulates a tunnel effect and generates 32-bit rendering data based on the provided surface texture. It uses a 256x256 texture, which is reshaped to a 512x512 resolution for better rendering quality. The algorithm computes various parameters such as distances, angles, shades, and rendering data, which can be used to visualize the tunnel effect.
es: Esta función simula un efecto de túnel y genera datos de renderizado de 32 bits basados en la textura de superficie proporcionada. Utiliza una textura de 256x256, que se redimensiona a una resolución de 512x512 para una mejor calidad de renderizado. El algoritmo calcula varios parámetros, como distancias, ángulos, sombras y datos de renderizado, que se pueden utilizar para visualizar el efecto de túnel.
fr: Cette fonction simule un effet de tunnel et génère des données de rendu en 32 bits basées sur la texture de surface fournie. Elle utilise une texture 256x256, qui est redimensionnée à une résolution 512x512 pour une meilleure qualité de rendu. L'algorithme calcule divers paramètres tels que les distances, les angles, les ombres et les données de rendu, qui peuvent être utilisés pour visualiser l'effet de tunnel.

source: `screen_width` (int): The width of the display or the tunnel effect.
es: `screen_width` (int): El ancho de la pantalla o del efecto de túnel.
fr: `screen_width` (int) : La largeur de l'affichage ou de l'effet de tunnel.

source: `screen_height` (int): The height of the display or the tunnel effect.
es: `screen_height` (int): La altura de la pantalla o del efecto de túnel.
fr: `screen_height` (int) : La hauteur de l'affichage ou de l'effet de tunnel.

source: `surface_` (pygame.Surface): The texture surface used for the tunnel effect. The surface should be compatible with either 24 or 32-bit formats.
es: `surface_` (pygame.Surface): La superficie de textura utilizada para el efecto de túnel. La superficie debe ser compatible con formatos de 24 o 32 bits.
fr: `surface_` (pygame.Surface) : La surface de texture utilisée pour l'effet de tunnel. La surface doit être compatible avec les formats 24 ou 32 bits.

source: `tuple`: A tuple containing four buffers: - `distances`: A buffer representing the calculated distances for the effect. - `angles`: A buffer representing the calculated angles for the effect. - `shades`: A buffer representing the calculated shades (brightness) for the effect. - `scr_data`: A buffer containing the texture data of the surface.
es: `tuple`: Una tupla que contiene cuatro buffers: - `distances`: Un buffer que representa las distancias calculadas para el efecto. - `angles`: Un buffer que representa los ángulos calculados para el efecto. - `shades`: Un buffer que representa las sombras (brillo) calculadas para el efecto. - `scr_data`: Un buffer que contiene los datos de textura de la superficie.
fr: `tuple` : Un tuple contenant quatre tampons : - `distances` : Un tampon représentant les distances calculées pour l'effet. - `angles` : Un tampon représentant les angles calculés pour l'effet. - `shades` : Un tampon représentant les ombres (luminosité) calculées pour l'effet. - `scr_data` : Un tampon contenant les données de texture de la surface.

source: Tunnel effect rendering.
es: Renderizado del efecto de túnel.
fr: Rendu de l'effet de tunnel.

source: This function renders the tunnel effect using 32-bit rendering data. It takes the parameters calculated by the `tunnel_modeling32` function and applies them to generate the final tunnel effect. The output is a 32-bit surface that can be used in Pygame rendering.
es: Esta función renderiza el efecto de túnel utilizando datos de renderizado de 32 bits. Toma los parámetros calculados por la función `tunnel_modeling32` y los aplica para generar el efecto de túnel final. La salida es una superficie de 32 bits que se puede utilizar en el renderizado de Pygame.
fr: Cette fonction rend l'effet de tunnel en utilisant les données de rendu 32 bits. Elle prend les paramètres calculés par la fonction `tunnel_modeling32` et les applique pour générer l'effet de tunnel final. Le résultat est une surface 32 bits qui peut être utilisée dans le rendu Pygame.

source: `t` (int): The timer or frame count. This controls the speed of the effect.
es: `t` (int): El temporizador o conteo de fotogramas. Esto controla la velocidad del efecto.
fr: `t` (int) : Le chronomètre ou le nombre d'images. Cela contrôle la vitesse de l'effet.

source: `screen_w2` (int): This is half the width of the screen (`screen_width // 2`).
es: `screen_w2` (int): Esto es la mitad del ancho de la pantalla (`screen_width // 2`).
fr: `screen_w2` (int) : C'est la moitié de la largeur de l'écran (`screen_width // 2`).

source: `screen_h2` (int): This is half the height of the screen (`screen_height // 2`).
es: `screen_h2` (int): Esto es la mitad de la altura de la pantalla (`screen_height // 2`).
fr: `screen_h2` (int) : C'est la moitié de la hauteur de l'écran (`screen_height // 2`).

source: `distances` (numpy.ndarray): A C-buffer of distances, which is generated from the `tunnel_modeling32` function.
es: `distances` (numpy.ndarray): Un buffer C de distancias, que se genera a partir de la función `tunnel_modeling32`.
fr: `distances` (numpy.ndarray) : Un tampon C des distances, généré à partir de la fonction `tunnel_modeling32`.

source: `angles` (numpy.ndarray): A C-buffer of angles, which is generated from the `tunnel_modeling32` function.
es: `angles` (numpy.ndarray): Un buffer C de ángulos, que se genera a partir de la función `tunnel_modeling32`.
fr: `angles` (numpy.ndarray) : Un tampon C des angles, généré à partir de la fonction `tunnel_modeling32`.

source: `shades` (numpy.ndarray): A C-buffer of shades (brightness), which is generated from the `tunnel_modeling32` function.
es: `shades` (numpy.ndarray): Un buffer C de sombras (brillo), que se genera a partir de la función `tunnel_modeling32`.
fr: `shades` (numpy.ndarray) : Un tampon C des ombres (luminosité), généré à partir de la fonction `tunnel_modeling32`.

source: `scr_data` (numpy.ndarray): A C-buffer of background pixel data, which is generated from the `tunnel_modeling32` function.
es: `scr_data` (numpy.ndarray): Un buffer C de datos de píxeles de fondo, que se genera a partir de la función `tunnel_modeling32`.
fr: `scr_data` (numpy.ndarray) : Un tampon C des données de pixels de fond, généré à partir de la fonction `tunnel_modeling32`.

source: `dest_array` (numpy.ndarray): An empty C-buffer, typically an empty buffer with a length of `width * height * 4` (RGBA). This buffer will be used to build the final tunnel effect image.
es: `dest_array` (numpy.ndarray): Un buffer C vacío, típicamente un buffer vacío con una longitud de `ancho * alto * 4` (RGBA). Este buffer se utilizará para construir la imagen final del efecto de túnel.
fr: `dest_array` (numpy.ndarray) : Un tampon C vide, typiquement un tampon vide de longueur `width * height * 4` (RGBA). Ce tampon sera utilisé pour construire l'image finale de l'effet de tunnel.

source: `pygame.Surface`: A surface containing the 32-bit image of the rendered tunnel effect.
es: `pygame.Surface`: Una superficie que contiene la imagen de 32 bits del efecto de túnel renderizado.
fr: `pygame.Surface` : Une surface contenant l'image 32 bits de l'effet de tunnel rendu.

source: Applies a fast bloom effect to an input surface.
es: Aplica un efecto de bloom rápido a una superficie de entrada.
fr: Applique un effet de bloom rapide à une surface d'entrée.

source: The bloom effect brightens pixels in the image above a specified threshold and then applies a blur to create a glowing effect. This function performs a series of downscaling operations and blurs, which are then combined to produce the final bloom effect. The algorithm can be optimized for speed, trading off some visual quality.
es: El efecto de bloom ilumina los píxeles de la imagen por encima de un umbral especificado y luego aplica un desenfoque para crear un efecto de resplandor. Esta función realiza una serie de operaciones de reducción de escala y desenfoques, que luego se combinan para producir el efecto de bloom final. El algoritmo puede optimizarse para la velocidad, sacrificando algo de calidad visual.
fr: L'effet de bloom éclaircit les pixels dans l'image au-dessus d'un seuil spécifié, puis applique un flou pour créer un effet lumineux. Cette fonction effectue une série d'opérations de réduction d'échelle et de flous, qui sont ensuite combinées pour produire l'effet de bloom final. L'algorithme peut être optimisé pour la vitesse, au prix d'une certaine qualité visuelle.

source: `surface_` (pygame.Surface): A Pygame surface containing RGB pixel data (32-bit or 24-bit color format).
es: `surface_` (pygame.Surface): Una superficie de Pygame que contiene datos de píxeles RGB (formato de color de 32 o 24 bits).
fr: `surface_` (pygame.Surface) : Une surface Pygame contenant des données de pixels RGB (format couleur 32 bits ou 24 bits).

source: `threshold` (int): The brightness threshold for the bloom effect. Pixels with values above this threshold will contribute to the bloom effect. A smaller value will cause a stronger bloom.
es: `threshold` (int): El umbral de brillo para el efecto de bloom. Los píxeles con valores por encima de este umbral contribuirán al efecto de bloom. Un valor más pequeño causará un bloom más fuerte.
fr: `threshold` (int) : Le seuil de luminosité pour l'effet de bloom. Les pixels ayant des valeurs supérieures à ce seuil contribueront à l'effet de bloom. Une valeur plus petite entraînera un bloom plus fort.

source: `fast` (bint, optional): If True, the algorithm will prioritize speed over visual quality by only applying the blur to the lowest downscaled surface (S16). Default is False.
es: `fast` (bint, opcional): Si es True, el algoritmo priorizará la velocidad sobre la calidad visual al aplicar el desenfoque solo a la superficie de menor escala (S16). El valor predeterminado es False.
fr: `fast` (bint, optionnel) : Si True, l'algorithme privilégiera la vitesse au détriment de la qualité visuelle en appliquant uniquement le flou à la surface la plus réduite (S16). La valeur par défaut est False.

source: `factor` (int, optional): A value between 0 and 4 that controls the level of downscaling for the textures used in the bloom. Higher values result in more aggressive downscaling. Default is 2, which corresponds to a division by 4.
es: `factor` (int, opcional): Un valor entre 0 y 4 que controla el nivel de reducción de escala para las texturas utilizadas en el bloom. Valores más altos resultan en una reducción de escala más agresiva. El valor predeterminado es 2, que corresponde a una división por 4.
fr: `factor` (int, optionnel) : Une valeur entre 0 et 4 qui contrôle le niveau de réduction d'échelle des textures utilisées dans le bloom. Des valeurs plus élevées entraînent une réduction d'échelle plus agressive. La valeur par défaut est 2, ce qui correspond à une division par 4.

source: `pygame.Surface`: A Pygame surface with the bloom effect applied, in 24-bit color format.
es: `pygame.Surface`: Una superficie de Pygame con el efecto de bloom aplicado, en formato de color de 24 bits.
fr: `pygame.Surface` : Une surface Pygame avec l'effet de bloom appliqué, en format couleur 24 bits.

source: **Raises**:
es: **Lanza**:
fr: **Lève** :

source: `ValueError`: If the surface is too small to process (e.g., after downscaling).
es: `ValueError`: Si la superficie es demasiado pequeña para procesar (por ejemplo, después de la reducción de escala).
fr: `ValueError` : Si la surface est trop petite pour être traitée (par exemple, après réduction d'échelle).

source: Bloom effect applied in-place (simplified version for better performance).
es: Efecto de bloom aplicado in situ (versión simplificada para un mejor rendimiento).
fr: Effet de bloom appliqué sur place (version simplifiée pour de meilleures performances).

source: The `shader_bloom_fast1` function applies a bloom effect that is optimized for moving objects in the display. Unlike other bloom methods, this version does not cause the light halo to be offset from moving objects, as it avoids the downsampling technique. This makes it better suited for dynamic scenes where objects are in motion.
es: La función `shader_bloom_fast1` aplica un efecto de bloom optimizado para objetos en movimiento en la pantalla. A diferencia de otros métodos de bloom, esta versión no hace que el halo de luz se desplace de los objetos en movimiento, ya que evita la técnica de reducción de escala. Esto la hace más adecuada para escenas dinámicas donde los objetos están en movimiento.
fr: La fonction `shader_bloom_fast1` applique un effet de bloom optimisé pour les objets en mouvement dans l'affichage. Contrairement à d'autres méthodes de bloom, cette version n'entraîne pas de décalage du halo lumineux par rapport aux objets en mouvement, car elle évite la technique de réduction d'échelle. Cela la rend mieux adaptée aux scènes dynamiques où les objets sont en mouvement.

source: `surface_` (pygame.Surface): A Pygame surface with compatible 32-bit or 24-bit color format (RGB).
es: `surface_` (pygame.Surface): Una superficie de Pygame con formato de color compatible de 32 o 24 bits (RGB).
fr: `surface_` (pygame.Surface) : Une surface Pygame avec un format de couleur compatible 32 bits ou 24 bits (RGB).

source: `smooth_` (int, optional): The smooth factor for spreading the halo of light. The default value is 3. Higher values spread the bloom over the entire scene but diminish the effect, while smaller values create a more pixelated halo but intensify the effect on objects. If smooth is below 3, the halo becomes pixelated.
es: `smooth_` (int, opcional): El factor de suavizado para extender el halo de luz. El valor predeterminado es 3. Valores más altos extienden el bloom sobre toda la escena pero disminuyen el efecto, mientras que valores más pequeños crean un halo más pixelado pero intensifican el efecto en los objetos. Si smooth es menor que 3, el halo se vuelve pixelado.
fr: `smooth_` (int, optionnel) : Le facteur de lissage pour étendre le halo de lumière. La valeur par défaut est 3. Des valeurs plus élevées étendent le bloom sur l'ensemble de la scène mais diminuent l'effet, tandis que des valeurs plus petites créent un halo plus pixelisé mais intensifient l'effet sur les objets. Si smooth est inférieur à 3, le halo devient pixelisé.

source: `threshold_` (int, optional): The threshold for the bloom intensity. A threshold of 0 corresponds to the maximum bloom. The default value is 0, meaning no threshold is applied.
es: `threshold_` (int, opcional): El umbral para la intensidad del bloom. Un umbral de 0 corresponde al bloom máximo. El valor predeterminado es 0, lo que significa que no se aplica ningún umbral.
fr: `threshold_` (int, optionnel) : Le seuil d'intensité du bloom. Un seuil de 0 correspond au bloom maximum. La valeur par défaut est 0, ce qui signifie qu'aucun seuil n'est appliqué.

source: `flag_` (int, optional): A Pygame blend flag for special blending effects with the light in the display. The default is `pygame.BLEND_RGB_ADD`. Other options include `BLEND_RGB_MAX`, `BLEND_RGB_SUB`, and other Pygame blend attributes.
es: `flag_` (int, opcional): Una bandera de mezcla de Pygame para efectos de mezcla especiales con la luz en la pantalla. El valor predeterminado es `pygame.BLEND_RGB_ADD`. Otras opciones incluyen `BLEND_RGB_MAX`, `BLEND_RGB_SUB` y otros atributos de mezcla de Pygame.
fr: `flag_` (int, optionnel) : Un indicateur de mélange Pygame pour des effets de mélange spéciaux avec la lumière dans l'affichage. La valeur par défaut est `pygame.BLEND_RGB_ADD`. D'autres options incluent `BLEND_RGB_MAX`, `BLEND_RGB_SUB`, et d'autres attributs de mélange Pygame.

source: `saturation_` (bool, optional): If True, the bloom effect will include a saturation effect to the halo. The default is False.
es: `saturation_` (bool, opcional): Si es True, el efecto de bloom incluirá un efecto de saturación en el halo. El valor predeterminado es False.
fr: `saturation_` (bool, optionnel) : Si True, l'effet de bloom inclura un effet de saturation au halo. La valeur par défaut est False.

source: `mask_` (numpy.ndarray or memoryviewslice, optional): A numpy array or memoryview representing the mask alpha. It should have the shape (w, h) and type `float32`, with values in the range (0..255). A mask filled with 255 will render and bloom the entire image, while a mask filled with 0 will disable the bloom effect. Values between 0 and 255 create a selective bloom effect. The mask is optional.
es: `mask_` (numpy.ndarray o memoryviewslice, opcional): Un array de numpy o memoryview que representa la máscara alfa. Debe tener la forma (w, h) y tipo `float32`, con valores en el rango (0..255). Una máscara llena de 255 renderizará y aplicará bloom a toda la imagen, mientras que una máscara llena de 0 desactivará el efecto de bloom. Los valores entre 0 y 255 crean un efecto de bloom selectivo. La máscara es opcional.
fr: `mask_` (numpy.ndarray ou memoryviewslice, optionnel) : Un tableau numpy ou une vue mémoire représentant l'alpha du masque. Il doit avoir la forme (w, h) et le type `float32`, avec des valeurs dans la plage (0..255). Un masque rempli de 255 rendra et fera fleurir l'ensemble de l'image, tandis qu'un masque rempli de 0 désactivera l'effet de bloom. Des valeurs comprises entre 0 et 255 créent un effet de bloom sélectif. Le masque est optionnel.

source: `void`: This effect is applied in-place, modifying the input surface directly.
es: `void`: Este efecto se aplica in situ, modificando directamente la superficie de entrada.
fr: `void` : Cet effet est appliqué directement, modifiant la surface d'entrée en place.

source: RGB split effect (returns a copy).
es: Efecto de división RGB (devuelve una copia).
fr: Effet de séparation RGB (retourne une copie).

source: This function applies an RGB split effect to an image by shifting the channels based on the provided offset. The result is an image with the red, green, and blue channels offset from their original positions. The offset value controls the direction and magnitude of the shift.
es: Esta función aplica un efecto de división RGB a una imagen desplazando los canales según el desplazamiento proporcionado. El resultado es una imagen con los canales rojo, verde y azul desplazados de sus posiciones originales. El valor de desplazamiento controla la dirección y magnitud del desplazamiento.
fr: Cette fonction applique un effet de séparation RGB à une image en décalant les canaux en fonction du décalage fourni. Le résultat est une image avec les canaux rouge, vert et bleu décalés par rapport à leurs positions d'origine. La valeur du décalage contrôle la direction et l'ampleur du décalage.

source: `surface_` (pygame.Surface): A Pygame surface compatible with 24-bit or 32-bit color format (RGB). The input image on which the RGB split effect will be applied.
es: `surface_` (pygame.Surface): Una superficie de Pygame compatible con formatos de color de 24 o 32 bits (RGB). La imagen de entrada a la que se aplicará el efecto de división RGB.
fr: `surface_` (pygame.Surface) : Une surface Pygame compatible avec un format de couleur 24 bits ou 32 bits (RGB). L'image d'entrée sur laquelle l'effet de séparation RGB sera appliqué.

source: `offset_` (char): An integer value that specifies the offset to apply between the RGB channels. The offset must be in the range [-128, 127]. If the offset is positive, the channels are displayed in the BGR order. If the offset is negative, the channels are displayed in the RGB order.
es: `offset_` (char): Un valor entero que especifica el desplazamiento a aplicar entre los canales RGB. El desplazamiento debe estar en el rango [-128, 127]. Si el desplazamiento es positivo, los canales se muestran en el orden BGR. Si el desplazamiento es negativo, los canales se muestran en el orden RGB.
fr: `offset_` (char) : Une valeur entière qui spécifie le décalage à appliquer entre les canaux RGB. Le décalage doit être compris entre [-128, 127]. Si le décalage est positif, les canaux sont affichés dans l'ordre BGR. Si le décalage est négatif, les canaux sont affichés dans l'ordre RGB.

source: `array_` (numpy.ndarray, optional): A numpy array with the shape (w, h, 3) and type `uint8`. If provided, this array will speed up the process by directly applying the transformation to it. This parameter is optional.
es: `array_` (numpy.ndarray, opcional): Un array de numpy con la forma (w, h, 3) y tipo `uint8`. Si se proporciona, este array acelerará el proceso al aplicar directamente la transformación a él. Este parámetro es opcional.
fr: `array_` (numpy.ndarray, optionnel) : Un tableau numpy ayant la forme (w, h, 3) et de type `uint8`. Si fourni, ce tableau accélérera le processus en appliquant directement la transformation dessus. Ce paramètre est optionnel.

source: `pygame.Surface`: A new surface (copy) with the RGB split effect applied, where the RGB channels are offset according to the specified value.
es: `pygame.Surface`: Una nueva superficie (copia) con el efecto de división RGB aplicado, donde los canales RGB están desplazados según el valor especificado.
fr: `pygame.Surface` : Une nouvelle surface (copie) avec l'effet de séparation RGB appliqué, où les canaux RGB sont décalés selon la valeur spécifiée.

source: RGB split effect (inplace).
es: Efecto de división RGB (in situ).
fr: Effet de séparation RGB (en place).
