Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: The surface must be compatible with 24-bit or 32-bit color formats, with or without an alpha channel. The hue shift is specified as a float value in the range [0.0, 1.0], where 0.0 corresponds to no hue change, and 1.0 represents a full 360-degree hue rotation.
es: La superficie debe ser compatible con formatos de color de 24 o 32 bits, con o sin canal alfa. El desplazamiento de tono se especifica como un valor flotante en el rango [0.0, 1.0], donde 0.0 corresponde a ningún cambio de tono y 1.0 representa una rotación completa de 360 grados del tono.
fr: La surface doit être compatible avec des formats de couleur 24 bits ou 32 bits, avec ou sans canal alpha. Le décalage de teinte est spécifié comme une valeur flottante dans la plage [0.0, 1.0], où 0.0 signifie aucune modification de la teinte, et 1.0 représente une rotation complète de 360 degrés.

source: **shift** (float) A float value in the range [0.0, 1.0], specifying the hue rotation. A value of 0.0 means no rotation, while 1.0 corresponds to a full 360-degree rotation.
es: **shift** (float) Un valor flotante en el rango [0.0, 1.0], que especifica la rotación de tono. Un valor de 0.0 significa ninguna rotación, mientras que 1.0 corresponde a una rotación completa de 360 grados.
fr: **shift** (float) Une valeur flottante dans la plage [0.0, 1.0], spécifiant la rotation de la teinte. Une valeur de 0.0 signifie aucune rotation, tandis que 1.0 correspond à une rotation complète de 360 degrés.

source: **None** The function modifies the input surface in place by applying the hue shift.
es: **Ninguno** La función modifica la superficie de entrada in situ aplicando el desplazamiento de tono.
fr: **Aucune** La fonction modifie directement la surface d'entrée en appliquant le changement de teinte.

source: Rotate hue 3d array
es: Rotar el tono de un arreglo 3D
fr: Faire une rotation de la teinte d'un tableau 3D

source: Rotate the hue (HSV conversion method), directly from a 3d array
es: Rotar el tono (método de conversión HSV), directamente desde un arreglo 3D
fr: Faire une rotation de la teinte (méthode de conversion HSV), directement à partir d'un tableau 3D

source: Compatible 24 - 32 bit with or without alpha layer
es: Compatible con 24 - 32 bits con o sin capa alfa
fr: Compatible 24 - 32 bits avec ou sans couche alpha

source: HSV (Hue, Saturation, Value) is a color model similar to HSL (Hue, Saturation, Lightness) but with some differences in how it represents and manipulates colors. It’s often used in graphics software and computer vision applications for its simplicity in specifying and adjusting color attributes.
es: HSV (Tono, Saturación, Valor) es un modelo de color similar a HSL (Tono, Saturación, Luminosidad) pero con algunas diferencias en cómo representa y manipula los colores. A menudo se utiliza en software de gráficos y aplicaciones de visión por computadora por su simplicidad para especificar y ajustar atributos de color.
fr: HSV (Teinte, Saturation, Valeur) est un modèle de couleur similaire à HSL (Teinte, Saturation, Luminosité) mais avec quelques différences dans la façon dont il représente et manipule les couleurs. Il est souvent utilisé dans les logiciels graphiques et les applications de vision par ordinateur en raison de sa simplicité pour spécifier et ajuster les attributs de couleur.

source: New Shift value. Must be between [0.0 ... 1.0] corresponding to 0.0 - 360.0 degrees (e.g 0.5 = 180 degrees)
es: Nuevo valor de desplazamiento. Debe estar entre [0.0 ... 1.0], correspondiendo a 0.0 - 360.0 grados (por ejemplo, 0.5 = 180 grados)
fr: Nouvelle valeur de décalage. Doit être entre [0.0 ... 1.0] correspondant à 0.0 - 360.0 degrés (par exemple 0.5 = 180 degrés)

source: **None** The function modifies the input `rgb_array` in place by applying the hue shift.
es: **Ninguno** La función modifica el arreglo de entrada `rgb_array` in situ aplicando el desplazamiento de tono.
fr: **Aucune** La fonction modifie directement le `rgb_array` en appliquant le changement de teinte.

source: Rotate hue 1d array
es: Rotar el tono de un arreglo 1D
fr: Faire une rotation de la teinte d'un tableau 1D

source: Rotate the hue directly from a C-buffer (1d array uint8 data types RGB(A) format) Changes apply inplace
es: Rotar el tono directamente desde un búfer C (arreglo 1D de tipo de datos uint8 en formato RGB(A)). Los cambios se aplican in situ
fr: Faire une rotation de la teinte directement à partir d'un C-buffer (tableau 1D de types de données uint8 au format RGB(A)) Les modifications sont appliquées directement.

source: This method works with other buffer formats such as BGR, BGRA.
es: Este método funciona con otros formatos de búfer como BGR, BGRA.
fr: Cette méthode fonctionne avec d'autres formats de tampon tels que BGR, BGRA.

source: **bgr_array** (numpy.ndarray) A 1D numpy array (C-buffer) of type uint8 containing pixel data in BGR(A) format. The array can also represent other formats such as BGR, BGRA.
es: **bgr_array** (numpy.ndarray) Un arreglo 1D de numpy (búfer C) de tipo uint8 que contiene datos de píxeles en formato BGR(A). El arreglo también puede representar otros formatos como BGR, BGRA.
fr: **bgr_array** (numpy.ndarray) Un tableau 1D numpy (C-buffer) de type uint8 contenant des données de pixels au format BGR(A). Le tableau peut également représenter d'autres formats tels que BGR, BGRA.

source: **format_32** (bool, optional, default=False) If `True`, the input array is assumed to be in 32-bit BGRA format. If `False`, the array is assumed to be in 24-bit BGR format.
es: **format_32** (bool, opcional, predeterminado=False) Si es `True`, se asume que el arreglo de entrada está en formato BGRA de 32 bits. Si es `False`, se asume que el arreglo está en formato BGR de 24 bits.
fr: **format_32** (bool, optionnel, par défaut=False) Si `True`, le tableau d'entrée est supposé être au format BGRA 32 bits. Si `False`, le tableau est supposé être au format BGR 24 bits.

source: **None** The function modifies the input `bgr_array` in place by applying the hue shift.
es: **Ninguno** La función modifica el arreglo de entrada `bgr_array` in situ aplicando el desplazamiento de tono.
fr: **Aucune** La fonction modifie directement le `bgr_array` en appliquant le changement de teinte.

source: Rotate the hue 1d array (return a copy)
es: Rotar el tono de un arreglo 1D (devolver una copia)
fr: Faire une rotation de la teinte du tableau 1D (retourner une copie)

source: HSV 1d array (C buffer) uint8 data types RGB(A) format
es: Arreglo 1D HSV (búfer C) de tipo de datos uint8 en formato RGB(A)
fr: HSV tableau 1D (C buffer) de types de données uint8 au format RGB(A)

source: **numpy.ndarray** A new 1D numpy array of type uint8 containing the pixels with the rotated hue.
es: **numpy.ndarray** Un nuevo arreglo 1D de numpy de tipo uint8 que contiene los píxeles con el tono rotado.
fr: **numpy.ndarray** Un nouveau tableau 1D numpy de type uint8 contenant les pixels avec la teinte tournée.

source: Apply Wave Effect to a Surface (Inplace)
es: Aplicar efecto de onda a una superficie (In situ)
fr: Appliquer un effet de vague à une surface (en place)

source: This function applies a wave effect to a Pygame surface, modifying it in place. The effect is applied to the surface based on an angle (in radians) and the number of sub-surfaces. It is compatible with 24-bit surfaces.
es: Esta función aplica un efecto de onda a una superficie de Pygame, modificándola in situ. El efecto se aplica a la superficie basándose en un ángulo (en radianes) y el número de sub-superficies. Es compatible con superficies de 24 bits.
fr: Cette fonction applique un effet de vague à une surface Pygame, la modifiant directement. L'effet est appliqué à la surface en fonction d'un angle (en radians) et du nombre de sous-surfaces. Il est compatible avec les surfaces 24 bits.

source: The wave effect creates a dynamic, wave-like distortion, often used for water or other fluid-like visual effects in games.
es: El efecto de onda crea una distorsión dinámica similar a una onda, a menudo utilizada para efectos visuales de agua u otros fluidos en juegos.
fr: L'effet de vague crée une distorsion dynamique, semblable à une vague, souvent utilisée pour des effets visuels d'eau ou d'autres effets fluides dans les jeux.

source: **surface_** (pygame.Surface) A Pygame surface, compatible with 24-bit color depth.
es: **surface_** (pygame.Surface) Una superficie de Pygame, compatible con profundidad de color de 24 bits.
fr: **surface_** (pygame.Surface) Une surface Pygame, compatible avec une profondeur de couleur de 24 bits.

source: **rad** (float) The angle in radians for the wave effect. This value controls the wave's motion over time.
es: **rad** (float) El ángulo en radianes para el efecto de onda. Este valor controla el movimiento de la onda a lo largo del tiempo.
fr: **rad** (float) L'angle en radians pour l'effet de vague. Cette valeur contrôle le mouvement de la vague au fil du temps.

source: **size** (int, optional, default=5) The number of sub-surfaces used to create the wave effect. A higher number results in a more complex wave.
es: **size** (int, opcional, predeterminado=5) El número de sub-superficies utilizadas para crear el efecto de onda. Un número más alto resulta en una onda más compleja.
fr: **size** (int, optionnel, par défaut=5) Le nombre de sous-surfaces utilisées pour créer l'effet de vague. Un nombre plus élevé donne une vague plus complexe.

source: **None** The function modifies the input surface in place, applying the wave effect.
es: **Ninguno** La función modifica la superficie de entrada in situ, aplicando el efecto de onda.
fr: **Aucune** La fonction modifie directement la surface d'entrée en appliquant l'effet de vague.

source: Apply Wave Effect to a 32-bit Surface (Inplace)
es: Aplicar efecto de onda a una superficie de 32 bits (In situ)
fr: Appliquer un effet de vague à une surface 32 bits (en place)

source: This function applies a wave effect to a 32-bit Pygame surface, modifying it in place. The effect is applied to both the RGB and alpha channels, meaning the wave will also displace the alpha layer (transparency) of the surface. It is fully compatible with 32-bit SDL surfaces, including those with an alpha channel.
es: Esta función aplica un efecto de onda a una superficie de Pygame de 32 bits, modificándola in situ. El efecto se aplica tanto a los canales RGB como al canal alfa, lo que significa que la onda también desplazará la capa alfa (transparencia) de la superficie. Es totalmente compatible con superficies SDL de 32 bits, incluidas aquellas con un canal alfa.
fr: Cette fonction applique un effet de vague à une surface Pygame 32 bits, la modifiant directement. L'effet est appliqué à la fois aux canaux RGB et alpha, ce qui signifie que la vague déplacera également la couche alpha (transparence) de la surface. Elle est entièrement compatible avec les surfaces SDL 32 bits, y compris celles avec un canal alpha.

source: The wave effect creates a dynamic distortion that simulates the motion of waves, often used for effects like water or fluid movement in games.
es: El efecto de onda crea una distorsión dinámica que simula el movimiento de las olas, a menudo utilizado para efectos como el agua o el movimiento de fluidos en juegos.
fr: L'effet de vague crée une distorsion dynamique qui simule le mouvement des vagues, souvent utilisé pour des effets tels que l'eau ou le mouvement des fluides dans les jeux.

source: **surface_** (pygame.Surface) A Pygame surface, compatible with 32-bit color depth and alpha channel (RGBA).
es: **surface_** (pygame.Surface) Una superficie de Pygame, compatible con profundidad de color de 32 bits y canal alfa (RGBA).
fr: **surface_** (pygame.Surface) Une surface Pygame, compatible avec une profondeur de couleur 32 bits et un canal alpha (RGBA).

source: **rad** (float) The angle in radians for the wave effect, controlling its rotation over time.
es: **rad** (float) El ángulo en radianes para el efecto de onda, controlando su rotación a lo largo del tiempo.
fr: **rad** (float) L'angle en radians pour l'effet de vague, contrôlant sa rotation au fil du temps.

source: **size** (int, optional, default=5) The number of sub-surfaces used to create the wave effect. A higher value results in a more detailed wave.
es: **size** (int, opcional, predeterminado=5) El número de sub-superficies utilizadas para crear el efecto de onda. Un valor más alto resulta en una onda más detallada.
fr: **size** (int, optionnel, par défaut=5) Le nombre de sous-surfaces utilisées pour créer l'effet de vague. Une valeur plus élevée donne une vague plus détaillée.

source: **None** The function modifies the input surface in place, applying the wave effect to both the color and alpha channels.
es: **Ninguno** La función modifica la superficie de entrada in situ, aplicando el efecto de onda tanto a los canales de color como al canal alfa.
fr: **Aucune** La fonction modifie directement la surface d'entrée en appliquant l'effet de vague aux canaux de couleur et alpha.

source: Wave effect for static background (inplace)
es: Efecto de onda para fondo estático (in situ)
fr: Effet de vague pour un fond statique (en place)

source: This function is different from the `wave` method as a copy of the static background or game display is passed to the function as an argument `array_` to improve overall performance.
es: Esta función es diferente del método `wave`, ya que se pasa una copia del fondo estático o la pantalla del juego a la función como argumento `array_` para mejorar el rendimiento general.
fr: Cette fonction diffère de la méthode `wave` car une copie de l'arrière-plan statique ou de l'affichage du jeu est passée à la fonction en tant qu'argument `array_` pour améliorer les performances globales.

source: Compatible with 24-bit surfaces.
es: Compatible con superficies de 24 bits.
fr: Compatible avec les surfaces 24 bits.

source: **array_** (numpy.ndarray) A 3D numpy array with shape (w, h, 3), type `uint8`, representing a copy of the game display or image to be modified.
es: **array_** (numpy.ndarray) Un arreglo 3D de numpy con forma (w, h, 3), tipo `uint8`, que representa una copia de la pantalla del juego o la imagen que se va a modificar.
fr: **array_** (numpy.ndarray) Un tableau numpy 3D avec la forme (w, h, 3), de type `uint8`, représentant une copie de l'affichage du jeu ou de l'image à modifier.

source: **None** The function modifies the input `array_` in place, applying the wave effect.
es: **Ninguno** La función modifica el arreglo de entrada `array_` in situ, aplicando el efecto de onda.
fr: **Aucune** La fonction modifie directement le `array_` d'entrée en appliquant l'effet de vague.

source: Swirl an image (inplace)
es: Remolinar una imagen (in situ)
fr: Tourner une image (en place)

source: The swirl effect is a visual distortion that creates a spiraling appearance in an image or graphic. This effect can draw attention to specific areas of a design and add a sense of movement or dynamism. It can be used creatively in various contexts, from social media graphics to advertising and digital art.
es: El efecto de remolino es una distorsión visual que crea una apariencia de espiral en una imagen o gráfico. Este efecto puede llamar la atención sobre áreas específicas de un diseño y agregar una sensación de movimiento o dinamismo. Se puede utilizar de manera creativa en varios contextos, desde gráficos para redes sociales hasta publicidad y arte digital.
fr: L'effet de tourbillon est une distorsion visuelle qui crée une apparence en spirale dans une image ou un graphique. Cet effet peut attirer l'attention sur des zones spécifiques d'un design et ajouter un sens de mouvement ou de dynamisme. Il peut être utilisé de manière créative dans divers contextes, des graphiques sur les réseaux sociaux à la publicité et à l'art numérique.

source: **Works with:** 24-bit and 32-bit image formats, but not compatible with 32-bit due to the alpha layer.
es: **Funciona con:** formatos de imagen de 24 y 32 bits, pero no es compatible con 32 bits debido a la capa alfa.
fr: **Fonctionne avec :** Formats d'image 24 bits et 32 bits, mais pas compatible avec le 32 bits en raison de la couche alpha.

source: If the image is in 32-bit with an alpha channel, the alpha layer will remain unchanged during the transformation, causing the alpha layer to bleed over the effect. To avoid this, convert the image to 24-bit. For 32-bit images with an alpha layer, use the `swirl32` method (designed for 32-bit).
es: Si la imagen está en 32 bits con un canal alfa, la capa alfa permanecerá inalterada durante la transformación, lo que hará que la capa alfa se mezcle con el efecto. Para evitar esto, convierta la imagen a 24 bits. Para imágenes de 32 bits con una capa alfa, utilice el método `swirl32` (diseñado para 32 bits).
fr: Si l'image est en 32 bits avec un canal alpha, la couche alpha restera inchangée pendant la transformation, ce qui provoque une interférence de la couche alpha sur l'effet. Pour éviter cela, convertissez l'image en 24 bits. Pour les images 32 bits avec une couche alpha, utilisez la méthode `swirl32` (conçue pour le 32 bits).

source: This algorithm uses a table of cosines and sines to achieve the effect.
es: Este algoritmo utiliza una tabla de cosenos y senos para lograr el efecto.
fr: Cet algorithme utilise un tableau de cosinus et sinus pour obtenir l'effet.

source: **surface_** (pygame.Surface) A Pygame surface, compatible with 24-bit and 32-bit formats. However, not compatible with 32-bit due to the alpha channel.
es: **surface_** (pygame.Surface) Una superficie de Pygame, compatible con formatos de 24 y 32 bits. Sin embargo, no es compatible con 32 bits debido al canal alfa.
fr: **surface_** (pygame.Surface) Une surface Pygame, compatible avec les formats 24 bits et 32 bits. Cependant, non compatible avec le 32 bits en raison du canal alpha.

source: **rgb_array_cp** (numpy.ndarray) A 3D numpy array with shape (w, h, 3), containing RGB pixel data. A copy of the image to swirl. Both `surface_` and `rgb_array_cp` must have the same shape and type.
es: **rgb_array_cp** (numpy.ndarray) Un arreglo 3D de numpy con forma (w, h, 3), que contiene datos de píxeles RGB. Una copia de la imagen a remolinar. Tanto `surface_` como `rgb_array_cp` deben tener la misma forma y tipo.
fr: **rgb_array_cp** (numpy.ndarray) Un tableau numpy 3D avec la forme (w, h, 3), contenant des données de pixels RGB. Une copie de l'image à faire tourner. Les deux `surface_` et `rgb_array_cp` doivent avoir la même forme et le même type.

source: **degrees** (float) The angle in degrees for the swirl effect.
es: **degrees** (float) El ángulo en grados para el efecto de remolino.
fr: **degrés** (float) L'angle en degrés pour l'effet de tourbillon.

source: **None** The function modifies the input `surface_` in place by applying the swirl effect.
es: **Ninguno** La función modifica la superficie de entrada `surface_` in situ aplicando el efecto de remolino.
fr: **Aucune** La fonction modifie directement la surface d'entrée en appliquant l'effet de tourbillon.

source: **Compatible with:** 24-bit and 32-bit formats (with or without alpha layer).
es: **Compatible con:** formatos de 24 y 32 bits (con o sin capa alfa).
fr: **Compatible avec :** Formats 24 bits et 32 bits (avec ou sans couche alpha).

source: This algorithm uses a table of cosines and sines for angle approximation.
es: Este algoritmo utiliza una tabla de cosenos y senos para la aproximación de ángulos.
fr: Cet algorithme utilise un tableau de cosinus et sinus pour l'approximation des angles.

source: Unlike the `swirl` method, `swirl32` takes into account the alpha layer during the transformation, meaning it works with 32-bit images that have per-pixel transparency, preserving the alpha channel.
es: A diferencia del método `swirl`, `swirl32` tiene en cuenta la capa alfa durante la transformación, lo que significa que funciona con imágenes de 32 bits que tienen transparencia por píxel, preservando el canal alfa.
fr: Contrairement à la méthode `swirl`, `swirl32` prend en compte la couche alpha pendant la transformation, ce qui signifie qu'elle fonctionne avec des images 32 bits ayant une transparence par pixel, préservant ainsi le canal alpha.

source: **surface_** (pygame.Surface) A Pygame surface, compatible with 24-bit and 32-bit formats, including alpha channels.
es: **surface_** (pygame.Surface) Una superficie de Pygame, compatible con formatos de 24 y 32 bits, incluyendo canales alfa.
fr: **surface_** (pygame.Surface) Une surface Pygame, compatible avec les formats 24 bits et 32 bits, y compris les canaux alpha.

source: Swirl an image (inplace) with floating point accuracy
es: Remolinar una imagen (in situ) con precisión de punto flotante
fr: Tourner une image (en place) avec une précision en virgule flottante

source: **Compatible with:** 24-bit format only.
es: **Compatible con:** solo formato de 24 bits.
fr: **Compatible avec :** Format 24 bits uniquement.

source: This algorithm does not use cosine and sine tables; instead, it calculates the angles with floating-point accuracy.
es: Este algoritmo no utiliza tablas de cosenos y senos; en su lugar, calcula los ángulos con precisión de punto flotante.
fr: Cet algorithme n'utilise pas de tables de cosinus et sinus ; il calcule les angles avec une précision en virgule flottante.

source: **surface_** (pygame.Surface) A Pygame surface, compatible with 24-bit formats.
es: **surface_** (pygame.Surface) Una superficie de Pygame, compatible con formatos de 24 bits.
fr: **surface_** (pygame.Surface) Une surface Pygame, compatible avec les formats 24 bits.

source: Create a basic plasma effect on the top of a Pygame surface (inplace)
es: Crear un efecto de plasma básico en la parte superior de una superficie de Pygame (in situ)
fr: Créer un effet de plasma de base sur une surface Pygame (en place)

source: **Compatible with:** 24 - 32-bit surfaces, with or without an alpha layer.
es: **Compatible con:** superficies de 24 - 32 bits, con o sin capa alfa.
fr: **Compatible avec :** Surfaces 24 - 32 bits, avec ou sans couche alpha.

source: This function creates a plasma effect that can be applied to a Pygame surface. It modifies the surface in place. The effect simulates plasma-like visual distortions using mathematical factors such as hue, saturation, and value.
es: Esta función crea un efecto de plasma que se puede aplicar a una superficie de Pygame. Modifica la superficie in situ. El efecto simula distorsiones visuales similares al plasma utilizando factores matemáticos como tono, saturación y valor.
fr: Cette fonction crée un effet de plasma qui peut être appliqué à une surface Pygame. Elle modifie directement la surface. L'effet simule des distorsions visuelles semblables au plasma en utilisant des facteurs mathématiques tels que la teinte, la saturation et la valeur.

source: **surface_** (pygame.Surface) A Pygame surface, compatible with 24-bit or 32-bit formats.
es: **surface_** (pygame.Surface) Una superficie de Pygame, compatible con formatos de 24 o 32 bits.
fr: **surface_** (pygame.Surface) Une surface Pygame, compatible avec les formats 24 bits ou 32 bits.

source: **frame** (int) A variable that changes over time, controlling the plasma effect's progression.
es: **frame** (int) Una variable que cambia con el tiempo, controlando la progresión del efecto de plasma.
fr: **frame** (int) Une variable qui change au fil du temps, contrôlant la progression de l'effet de plasma.

source: **hue_** (float, optional) A factor controlling the hue, default value is 1.0/6.0.
es: **hue_** (float, opcional) Un factor que controla el tono, el valor predeterminado es 1.0/6.0.
fr: **hue_** (float, optionnel) Un facteur contrôlant la teinte, la valeur par défaut est 1.0/6.0.
