Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: This function modifies the given image surface to apply a heatmap effect. The transformation is applied directly to the surface, so no new object is returned. It also allows the user to choose whether the heatmap should be in RGB or BGR color model.
es: Esta función modifica la superficie de la imagen dada para aplicar un efecto de mapa de calor. La transformación se aplica directamente a la superficie, por lo que no se devuelve un nuevo objeto. También permite al usuario elegir si el mapa de calor debe estar en el modelo de color RGB o BGR.
fr: Cette fonction modifie la surface de l'image donnée pour appliquer un effet de carte thermique.L'application de la transformation se fait directement sur la surface, donc aucun nouvel objet n'est retourné. Elle permet également à l'utilisateur de choisir si la carte thermique doit être dans le modèle de couleur RGB ou BGR.

source: **Parameters**: - `surface_` (pygame.Surface): A pygame.Surface object, typically in 24-bit or 32-bit image format (compatible with pygame). The image to which the heatmap effect will be applied. - `rgb_` (bool, optional): If True, the image will be transformed into an RGB-based heatmap. If False, the transformation will use the BGR-based heatmap model. Default is True (RGB).
es: **Parámetros**: - `surface_` (pygame.Surface): Un objeto pygame.Surface, típicamente en formato de imagen de 24 o 32 bits (compatible con pygame). La imagen a la que se aplicará el efecto de mapa de calor. - `rgb_` (bool, opcional): Si es True, la imagen se transformará en un mapa de calor basado en RGB. Si es False, la transformación utilizará el modelo de mapa de calor basado en BGR. El valor predeterminado es True (RGB).
fr: **Paramètres** : - `surface_` (pygame.Surface) : Un objet pygame.Surface, généralement au format d'image 24 bits ou 32 bits (compatible avec pygame). L'image sur laquelle l'effet de carte thermique sera appliqué. - `rgb_` (bool, facultatif) : Si True, l'image sera transformée en carte thermique basée sur RGB. Si False, la transformation utilisera le modèle de carte thermique basé sur BGR. La valeur par défaut est True (RGB).

source: **Returns**: - `None`: This function operates in-place, meaning the input surface is modified directly without returning a new object.
es: **Retorna**: - `None`: Esta función opera in situ, lo que significa que la superficie de entrada se modifica directamente sin devolver un nuevo objeto.
fr: **Retour** : - `None` : Cette fonction fonctionne sur place, ce qui signifie que la surface d'entrée est modifiée directement sans retourner un nouvel objet.

source: **Raises**: - `TypeError`: If `surface_` is not a valid pygame.Surface object.
es: **Lanza**: - `TypeError`: Si `surface_` no es un objeto pygame.Surface válido.
fr: **Lance** : - `TypeError` : Si `surface_` n'est pas un objet pygame.Surface valide.

source: Simulate Predator Vision Mode.
es: Simular el modo de visión de depredador.
fr: Simuler le mode Vision Prédateur.

source: This function simulates the predator's vision using a series of image processing filters. It applies Sobel edge detection, bright pass filter (BPF), bloom effects, and a colormap inversion to the given surface. Optionally, it allows for faster processing and blending effects.
es: Esta función simula la visión de un depredador utilizando una serie de filtros de procesamiento de imágenes. Aplica detección de bordes Sobel, filtro de paso alto (BPF), efectos de bloom y una inversión de mapa de colores a la superficie dada. Opcionalmente, permite un procesamiento más rápido y efectos de mezcla.
fr: Cette fonction simule la vision du prédateur en utilisant une série de filtres de traitement d'image. Elle applique la détection des bords de Sobel, un filtre de passage des hautes lumières (BPF), des effets de bloom et une inversion du colormap à la surface donnée. Optionnellement, elle permet d'accélérer le traitement et d'appliquer des effets de fusion.

source: **Parameters**: - `surface_` (pygame.Surface): A pygame.Surface object, compatible with 24-bit or 32-bit formats. This is the image to which the predator vision effect will be applied. - `sobel_threshold` (int, optional): The threshold for Sobel edge detection, used to detect edges in the image. The default value is 12. - `bpf_threshold` (int, optional): The threshold for the Bright Pass Filter (BPF), used to detect and highlight bright pixels. The default value is 50. - `bloom_threshold` (int, optional): The intensity of the bloom effect, which adds a glow around bright pixels. The default value is 50. - `inv_colormap` (bool, optional): If True, the colormap will be inverted, changing the color scheme to resemble a predator's vision more closely. The default value is False. - `fast` (bool, optional): If True, a faster processing mode is used. This will reduce the quality in exchange for faster processing time. The default value is False. - `blend` (int, optional): The blending mode to apply after all effects have been processed. This can be a value from `pygame.BLEND_*` modes. The default is `pygame.BLEND_RGB_ADD`.
es: **Parámetros**: - `surface_` (pygame.Surface): Un objeto pygame.Surface, compatible con formatos de 24 o 32 bits. Esta es la imagen a la que se aplicará el efecto de visión de depredador. - `sobel_threshold` (int, opcional): El umbral para la detección de bordes Sobel, utilizado para detectar bordes en la imagen. El valor predeterminado es 12. - `bpf_threshold` (int, opcional): El umbral para el Filtro de Paso Alto (BPF), utilizado para detectar y resaltar píxeles brillantes. El valor predeterminado es 50. - `bloom_threshold` (int, opcional): La intensidad del efecto de bloom, que añade un resplandor alrededor de los píxeles brillantes. El valor predeterminado es 50. - `inv_colormap` (bool, opcional): Si es True, el mapa de colores se invertirá, cambiando el esquema de color para parecerse más a la visión de un depredador. El valor predeterminado es False. - `fast` (bool, opcional): Si es True, se utiliza un modo de procesamiento más rápido. Esto reducirá la calidad a cambio de un tiempo de procesamiento más rápido. El valor predeterminado es False. - `blend` (int, opcional): El modo de mezcla que se aplicará después de procesar todos los efectos. Puede ser un valor de los modos `pygame.BLEND_*`. El valor predeterminado es `pygame.BLEND_RGB_ADD`.

source: **Returns**: - `pygame.Surface`: A new pygame.Surface object with the predator vision effect applied. The surface is in 24-bit format.
es: **Retorna**: - `pygame.Surface`: Un nuevo objeto pygame.Surface con el efecto de visión de depredador aplicado. La superficie está en formato de 24 bits.
fr: **Retour** : - `pygame.Surface` : Un nouvel objet pygame.Surface avec l'effet de vision du prédateur appliqué. La surface est au format 24 bits.

source: Apply a blood effect (in-place).
es: Aplicar un efecto de sangre (in situ).
fr: Appliquer un effet de sang (sur place).

source: This function applies a blood effect to a given surface using a mask array that defines the contour of the blood effect. The surface and mask must have the same dimensions. The `percentage` parameter determines the intensity of the blood effect, with 1.0 representing full intensity.
es: Esta función aplica un efecto de sangre a una superficie dada utilizando un array de máscara que define el contorno del efecto de sangre. La superficie y la máscara deben tener las mismas dimensiones. El parámetro `percentage` determina la intensidad del efecto de sangre, donde 1.0 representa la intensidad completa.
fr: Cette fonction applique un effet de sang à une surface donnée en utilisant un tableau de masque qui définit le contour de l'effet de sang. La surface et le masque doivent avoir les mêmes dimensions. Le paramètre `percentage` détermine l'intensité de l'effet de sang, avec 1.0 représentant l'intensité maximale.

source: **Parameters**: - `surface_` (pygame.Surface): The surface (e.g., game display) to which the blood effect will be applied. It must be in a compatible 24-bit or 32-bit format. - `mask_` (numpy.ndarray or cython.view.memoryview): A normalized array or memoryview (shape: (w, h), type: float) representing the blood mask. The values must be in the range [0.0, 1.0], where 1.0 represents full intensity of the effect. - `percentage_` (float): A value in the range [0.0, 1.0] that determines the intensity of the blood effect. A value of 1.0 applies the full effect, while 0.0 applies no effect.
es: **Parámetros**: - `surface_` (pygame.Surface): La superficie (por ejemplo, la pantalla del juego) a la que se aplicará el efecto de sangre. Debe estar en un formato compatible de 24 o 32 bits. - `mask_` (numpy.ndarray o cython.view.memoryview): Un array normalizado o memoryview (forma: (w, h), tipo: float) que representa la máscara de sangre. Los valores deben estar en el rango [0.0, 1.0], donde 1.0 representa la intensidad completa del efecto. - `percentage_` (float): Un valor en el rango [0.0, 1.0] que determina la intensidad del efecto de sangre. Un valor de 1.0 aplica el efecto completo, mientras que 0.0 no aplica ningún efecto.
fr: **Paramètres** : - `surface_` (pygame.Surface) : La surface (par exemple, l'affichage du jeu) sur laquelle l'effet de sang sera appliqué. Elle doit être dans un format compatible 24 bits ou 32 bits. - `mask_` (numpy.ndarray ou cython.view.memoryview) : Un tableau normalisé ou une vue mémoire (forme : (w, h), type : float) représentant le masque de sang. Les valeurs doivent être dans la plage [0.0, 1.0], où 1.0 représente l'intensité maximale de l'effet. - `percentage_` (float) : Une valeur dans la plage [0.0, 1.0] qui détermine l'intensité de l'effet de sang. Une valeur de 1.0 applique l'effet complet, tandis que 0.0 n'applique aucun effet.

source: **Returns**: - `None`: The function modifies the given surface in place (i.e., it has no return value).
es: **Retorna**: - `None`: La función modifica la superficie dada in situ (es decir, no tiene valor de retorno).
fr: **Retour** : - `None` : La fonction modifie la surface donnée sur place (c'est-à-dire qu'elle n'a pas de valeur de retour).

source: Return a mirrored numpy array.
es: Devolver un array numpy reflejado.
fr: Retourner un tableau numpy miroir.

source: This method returns a numpy.ndarray with mirrored pixels, flipping the image along the horizontal axis. The output array has the same shape and type as the input, with the pixel values mirrored.
es: Este método devuelve un numpy.ndarray con píxeles reflejados, volteando la imagen a lo largo del eje horizontal. El array de salida tiene la misma forma y tipo que el de entrada, con los valores de píxel reflejados.
fr: Cette méthode retourne un numpy.ndarray avec des pixels inversés, retournant l'image le long de l'axe horizontal. Le tableau de sortie a la même forme et le même type que l'entrée, avec les valeurs des pixels inversées.

source: **Parameters**: - `rgb_array` (numpy.ndarray): An array with shape (w, h, 3) of type uint8, containing RGB or any other pixel format (such as BGR).
es: **Parámetros**: - `rgb_array` (numpy.ndarray): Un array con forma (w, h, 3) de tipo uint8, que contiene RGB o cualquier otro formato de píxel (como BGR).
fr: **Paramètres** : - `rgb_array` (numpy.ndarray) : Un tableau avec la forme (w, h, 3) de type uint8, contenant RGB ou tout autre format de pixel (comme BGR).

source: **Returns**: - `numpy.ndarray`: A numpy ndarray with shape (w, h, 3) of type uint8, identical to the input array but with mirrored pixels.
es: **Retorna**: - `numpy.ndarray`: Un ndarray de numpy con forma (w, h, 3) de tipo uint8, idéntico al array de entrada pero con píxeles reflejados.
fr: **Retour** : - `numpy.ndarray` : Un tableau numpy ndarray avec la forme (w, h, 3) de type uint8, identique au tableau d'entrée mais avec les pixels inversés.

source: Apply a mirroring effect (in-place).
es: Aplicar un efecto de espejo (in situ).
fr: Appliquer un effet de miroir (sur place).

source: This method creates a mirrored image of the given surface by reflecting it horizontally. The effect is applied directly to the surface (in-place).
es: Este método crea una imagen reflejada de la superficie dada al reflejarla horizontalmente. El efecto se aplica directamente a la superficie (in situ).
fr: Cette méthode crée une image miroir de la surface donnée en la réfléchissant horizontalement. L'effet est appliqué directement sur la surface (sur place).

source: **Parameters**: - `surface_` (pygame.Surface): A pygame surface compatible with 24-bit or 32-bit formats that will undergo the mirroring effect.
es: **Parámetros**: - `surface_` (pygame.Surface): Una superficie de pygame compatible con formatos de 24 o 32 bits que se someterá al efecto de espejo.
fr: **Paramètres** : - `surface_` (pygame.Surface) : Une surface pygame compatible avec les formats 24 bits ou 32 bits qui subira l'effet de miroir.

source: **Returns**: - `None`: The function modifies the given surface in place, meaning it does not return a new surface but rather alters the input surface.
es: **Retorna**: - `None`: La función modifica la superficie dada in situ, lo que significa que no devuelve una nueva superficie, sino que altera la superficie de entrada.
fr: **Retour** : - `None` : La fonction modifie la surface donnée sur place, ce qui signifie qu'elle ne retourne pas une nouvelle surface, mais modifie la surface d'entrée.

source: Sharpen an image (in-place) using a 3x3 kernel.
es: Enfocar una imagen (in situ) utilizando un kernel de 3x3.
fr: Aiguiser une image (sur place) en utilisant un noyau 3x3.

source: This function applies a sharpening filter to the image on the given surface. The filter uses a 3x3 kernel to enhance the edges and details by increasing contrast around edges, making the image appear sharper.
es: Esta función aplica un filtro de enfoque a la imagen en la superficie dada. El filtro utiliza un kernel de 3x3 para mejorar los bordes y detalles al aumentar el contraste alrededor de los bordes, haciendo que la imagen parezca más nítida.
fr: Cette fonction applique un filtre de netteté à l'image sur la surface donnée. Le filtre utilise un noyau 3x3 pour renforcer les bords et les détails en augmentant le contraste autour des bords, rendant l'image plus nette.

source: **Parameters**:
es: **Parámetros**:
fr: **Paramètres** :

source: `surface_` (pygame.Surface): A Pygame surface compatible with 24-bit or 32-bit image formats that will be modified in-place to apply the sharpen effect.
es: `surface_` (pygame.Surface): Una superficie de Pygame compatible con formatos de imagen de 24 o 32 bits que se modificará in situ para aplicar el efecto de enfoque.
fr: `surface_` (pygame.Surface) : Une surface Pygame compatible avec les formats 24 bits ou 32 bits qui sera modifiée sur place pour appliquer l'effet de netteté.

source: **Returns**:
es: **Retorna**:
fr: **Retour** :

source: `None`: The function modifies the given surface in place, meaning no new surface is returned. The original surface will be sharpened.
es: `None`: La función modifica la superficie dada in situ, lo que significa que no se devuelve una nueva superficie. La superficie original se enfocará.
fr: `None` : La fonction modifie la surface donnée sur place, ce qui signifie qu'aucune nouvelle surface n'est retournée. La surface originale sera aiguisée.

source: Sharpen array (in-place) using a 3x3 kernel.
es: Enfocar un array (in situ) utilizando un kernel de 3x3.
fr: Aiguiser un tableau (sur place) en utilisant un noyau 3x3.

source: This function applies a sharpening filter directly to a 1D array using a 3x3 kernel. It is compatible with BGR or BGR(A) array types, and can also work with other pixel formats such as RGB or RGB(A). The sharpening filter enhances the edges by increasing contrast around them, making the image appear sharper. If the array contains alpha transparency, set `format_32=True`.
es: Esta función aplica un filtro de enfoque directamente a un array 1D utilizando un kernel de 3x3. Es compatible con tipos de array BGR o BGR(A), y también puede funcionar con otros formatos de píxel como RGB o RGB(A). El filtro de enfoque mejora los bordes al aumentar el contraste a su alrededor, haciendo que la imagen parezca más nítida. Si el array contiene transparencia alfa, establece `format_32=True`.
fr: Cette fonction applique un filtre de netteté directement à un tableau 1D en utilisant un noyau 3x3. Il est compatible avec les types de tableaux BGR ou BGR(A), et peut également fonctionner avec d'autres formats de pixels tels que RGB ou RGB(A). Le filtre de netteté renforce les bords en augmentant le contraste autour d'eux, rendant l'image plus nette. Si le tableau contient une transparence alpha, définissez `format_32=True`.

source: **Parameters**: - `w` (int): The width of the array. - `h` (int): The height of the array. - `bgr_array` (numpy.ndarray): A 1D array (shape: (w, )) of type uint8, containing the BGR or RGB pixel values. - `format_32` (bool, optional): If `True`, the array contains alpha transparency (BGRA format). If `False`, the array is BGR format (default is `False`).
es: **Parámetros**: - `w` (int): El ancho del array. - `h` (int): La altura del array. - `bgr_array` (numpy.ndarray): Un array 1D (forma: (w, )) de tipo uint8, que contiene los valores de píxel BGR o RGB. - `format_32` (bool, opcional): Si es `True`, el array contiene transparencia alfa (formato BGRA). Si es `False`, el array está en formato BGR (el valor predeterminado es `False`).
fr: **Paramètres** : - `w` (int) : La largeur du tableau. - `h` (int) : La hauteur du tableau. - `bgr_array` (numpy.ndarray) : Un tableau 1D (forme : (w, )) de type uint8, contenant les valeurs de pixels BGR ou RGB. - `format_32` (bool, optionnel) : Si `True`, le tableau contient une transparence alpha (format BGRA). Si `False`, le tableau est au format BGR (par défaut c'est `False`).

source: **Returns**: - `None`: The function modifies the given array in place (i.e., no new array is returned).
es: **Retorna**: - `None`: La función modifica el array dado in situ (es decir, no se devuelve un nuevo array).
fr: **Retour** : - `None` : La fonction modifie le tableau donné sur place (c'est-à-dire qu'aucun nouveau tableau n'est retourné).

source: Sharpen array (return a new array).
es: Enfocar un array (devolver un nuevo array).
fr: Aiguiser un tableau (retourner un nouveau tableau).

source: This function returns a new array with a sharpening filter applied, using a 3x3 kernel. It is compatible with BGR or BGR(A) array types, and can also work with other pixel formats such as RGB or RGB(A). The sharpening filter enhances edges by increasing contrast around them, making the image appear sharper. If the array contains alpha transparency, set `format_32=True`.
es: Esta función devuelve un nuevo array con un filtro de enfoque aplicado, utilizando un kernel de 3x3. Es compatible con tipos de array BGR o BGR(A), y también puede funcionar con otros formatos de píxel como RGB o RGB(A). El filtro de enfoque mejora los bordes al aumentar el contraste a su alrededor, haciendo que la imagen parezca más nítida. Si el array contiene transparencia alfa, establece `format_32=True`.
fr: Cette fonction retourne un nouveau tableau avec un filtre de netteté appliqué, en utilisant un noyau 3x3. Il est compatible avec les types de tableaux BGR ou BGR(A), et peut également fonctionner avec d'autres formats de pixels tels que RGB ou RGB(A). Le filtre de netteté renforce les bords en augmentant le contraste autour d'eux, rendant l'image plus nette. Si le tableau contient une transparence alpha, définissez `format_32=True`.

source: **Returns**: - `numpy.ndarray`: A 1D numpy array (shape: (w, )) of type uint8, with sharpened pixels similar to the input array.
es: **Retorna**: - `numpy.ndarray`: Un array numpy 1D (forma: (w, )) de tipo uint8, con píxeles enfocados similares al array de entrada.
fr: **Retour** : - `numpy.ndarray` : Un tableau numpy 1D (forme : (w, )) de type uint8, avec des pixels aiguisés similaires à ceux du tableau d'entrée.

source: Sharpen image using a 3x3 kernel (in-place).
es: Enfocar una imagen utilizando un kernel de 3x3 (in situ).
fr: Aiguiser l'image en utilisant un noyau 3x3 (sur place).

source: This function applies a sharpening filter directly to the image on the given surface. The filter uses a 3x3 kernel to enhance edges and details by increasing contrast around edges, making the image appear sharper. It is compatible with both 24-bit and 32-bit images.
es: Esta función aplica un filtro de enfoque directamente a la imagen en la superficie dada. El filtro utiliza un kernel de 3x3 para mejorar los bordes y detalles al aumentar el contraste alrededor de los bordes, haciendo que la imagen parezca más nítida. Es compatible con imágenes de 24 y 32 bits.
fr: Cette fonction applique un filtre de netteté directement à l'image sur la surface donnée. Le filtre utilise un noyau 3x3 pour renforcer les bords et les détails en augmentant le contraste autour des bords, rendant l'image plus nette. Il est compatible avec les images 24 bits et 32 bits.

source: **Parameters**: - `surface_` (pygame.Surface): A Pygame surface compatible with 24-bit or 32-bit formats to be sharpened.
es: **Parámetros**: - `surface_` (pygame.Surface): Una superficie de Pygame compatible con formatos de 24 o 32 bits que se enfocará.
fr: **Paramètres** : - `surface_` (pygame.Surface) : Une surface Pygame compatible avec des formats 24 bits ou 32 bits à aiguiser.

source: **Returns**: - `None`: The function modifies the given surface in place (i.e., no new surface is returned).
es: **Retorna**: - `None`: La función modifica la superficie dada in situ (es decir, no se devuelve una nueva superficie).
fr: **Retour** : - `None` : La fonction modifie la surface donnée sur place (c'est-à-dire qu'aucune nouvelle surface n'est retournée).

source: Dirt lens effect (in-place).
es: Efecto de lente sucia (in situ).
fr: Effet de lentille sale (sur place).

source: This function applies a dirt lens texture on top of the game display to simulate a camera artifact or realistic camera effect, particularly when light from the scene is oriented directly toward the camera. The function blends the lens texture with the display, creating a dirt effect on the lens.
es: Esta función aplica una textura de lente sucia sobre la pantalla del juego para simular un artefacto de cámara o un efecto de cámara realista, particularmente cuando la luz de la escena está orientada directamente hacia la cámara. La función mezcla la textura de la lente con la pantalla, creando un efecto de suciedad en la lente.
fr: Cette fonction applique une texture de lentille sale sur l'affichage du jeu pour simuler un artefact de caméra ou un effet réaliste de caméra, particulièrement lorsque la lumière de la scène est orientée directement vers la caméra. La fonction mélange la texture de la lentille avec l'affichage, créant un effet de saleté sur la lentille.
