Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: **fast_** (bool) A boolean value that, when set to `True`, approximates the bloom effect for performance improvement (10x - 80x), but reduces the visual intensity of the effect. Default is `False`.
es: **rápido_** (bool) Un valor booleano que, cuando se establece en `True`, aproxima el efecto de resplandor para mejorar el rendimiento (10x - 80x), pero reduce la intensidad visual del efecto. El valor predeterminado es `False`.
fr: **fast_** (bool) Une valeur booléenne qui, lorsqu'elle est définie sur `True`, approxime l'effet bloom pour améliorer les performances (10x - 80x), mais réduit l'intensité visuelle de l'effet. La valeur par défaut est `False`.

source: **mask_** (numpy.ndarray or memoryviewslice) A 2D array of type uint8 representing the mask alpha, with shape `(w, h)`. Values in the range [0..255] control the transparency, and thus, the selective application of the bloom effect. An array filled with 255 renders the full bloom effect, while an array filled with 0 disables the effect. Intermediate values create partial bloom effects.
es: **mask_** (numpy.ndarray o memoryviewslice) Un array 2D de tipo uint8 que representa la máscara alfa, con forma `(w, h)`. Los valores en el rango [0..255] controlan la transparencia y, por lo tanto, la aplicación selectiva del efecto bloom. Un array lleno de 255 renderiza el efecto bloom completo, mientras que un array lleno de 0 desactiva el efecto. Los valores intermedios crean efectos bloom parciales.
fr: **mask_** (numpy.ndarray ou memoryviewslice) Un tableau 2D de type uint8 représentant l'alpha du masque, avec une forme `(w, h)`. Les valeurs dans la plage [0..255] contrôlent la transparence et, par conséquent, l'application sélective de l'effet bloom. Un tableau rempli de 255 rend l'effet bloom complet, tandis qu'un tableau rempli de 0 désactive l'effet. Les valeurs intermédiaires créent des effets bloom partiels.

source: **None** This function modifies the `surface_` in place by applying the bloom effect.
es: **None** Esta función modifica el `surface_` in situ aplicando el efecto bloom.
fr: **None** Cette fonction modifie le `surface_` en place en appliquant l'effet bloom.

source: Create a fisheye lens model holding pixel coordinates of a surface
es: Crear un modelo de lente ojo de pez que contiene las coordenadas de píxel de una superficie
fr: Créer un modèle d'objectif fisheye contenant les coordonnées des pixels d'une surface

source: This function generates a fisheye lens model that holds the pixel coordinates for each pixel on a given surface. The model can be used to apply a fisheye effect to a surface by mapping its coordinates into a fisheye lens projection.
es: Esta función genera un modelo de lente ojo de pez que contiene las coordenadas de píxel para cada píxel en una superficie dada. El modelo puede usarse para aplicar un efecto ojo de pez a una superficie mapeando sus coordenadas en una proyección de lente ojo de pez.
fr: Cette fonction génère un modèle d'objectif fisheye qui contient les coordonnées des pixels de chaque pixel d'une surface donnée. Le modèle peut être utilisé pour appliquer un effet fisheye à une surface en mappant ses coordonnées dans une projection d'objectif fisheye.

source: **w** (int) The width of the surface to project into the fisheye model. The value must match the surface's width.
es: **w** (int) El ancho de la superficie para proyectar en el modelo ojo de pez. El valor debe coincidir con el ancho de la superficie.
fr: **w** (int) La largeur de la surface à projeter dans le modèle fisheye. La valeur doit correspondre à la largeur de la surface.

source: **h** (int) The height of the surface to project into the fisheye model. The value must match the surface's height.
es: **h** (int) La altura de la superficie para proyectar en el modelo ojo de pez. El valor debe coincidir con la altura de la superficie.
fr: **h** (int) La hauteur de la surface à projeter dans le modèle fisheye. La valeur doit correspondre à la hauteur de la surface.

source: **centre_x** (int) The x-coordinate of the centre of the fisheye effect.
es: **centre_x** (int) La coordenada x del centro del efecto ojo de pez.
fr: **centre_x** (int) La coordonnée x du centre de l'effet fisheye.

source: **centre_y** (int) The y-coordinate of the centre of the fisheye effect.
es: **centre_y** (int) La coordenada y del centro del efecto ojo de pez.
fr: **centre_y** (int) La coordonnée y du centre de l'effet fisheye.

source: **numpy.ndarray** A 2D array of type `np.uint32_t` with shape `(w, h, 2)`, representing the fisheye model and holding the coordinates of all pixels projected through the fisheye lens model.
es: **numpy.ndarray** Un array 2D de tipo `np.uint32_t` con forma `(w, h, 2)`, que representa el modelo ojo de pez y contiene las coordenadas de todos los píxeles proyectados a través del modelo de lente ojo de pez.
fr: **numpy.ndarray** Un tableau 2D de type `np.uint32_t` avec une forme `(w, h, 2)`, représentant le modèle fisheye et contenant les coordonnées de tous les pixels projetés à travers le modèle d'objectif fisheye.

source: Create a fisheye model to hold the pixel coordinates with additional parameters
es: Crear un modelo ojo de pez para contener las coordenadas de píxel con parámetros adicionales
fr: Créer un modèle fisheye pour contenir les coordonnées des pixels avec des paramètres supplémentaires

source: This function generates a fisheye model that holds the pixel coordinates of a surface, with the added ability to control the fisheye model's aspect and focal length.
es: Esta función genera un modelo ojo de pez que contiene las coordenadas de píxel de una superficie, con la capacidad adicional de controlar el aspecto y la distancia focal del modelo ojo de pez.
fr: Cette fonction génère un modèle fisheye qui contient les coordonnées des pixels d'une surface, avec la possibilité supplémentaire de contrôler l'aspect du modèle fisheye et la longueur focale.

source: **tmp_array_** (numpy.ndarray) A 3D array with shape `(w, h, 2)` of unsigned integers. The shape of this array will determine the fisheye model.
es: **tmp_array_** (numpy.ndarray) Un array 3D con forma `(w, h, 2)` de enteros sin signo. La forma de este array determinará el modelo ojo de pez.
fr: **tmp_array_** (numpy.ndarray) Un tableau 3D avec une forme `(w, h, 2)` de nombres entiers non signés. La forme de ce tableau déterminera le modèle fisheye.

source: **centre_x** (float) The x-coordinate of the fisheye effect’s center. Corresponds to half the length of the fisheye model.
es: **centre_x** (float) La coordenada x del centro del efecto ojo de pez. Corresponde a la mitad de la longitud del modelo ojo de pez.
fr: **centre_x** (float) La coordonnée x du centre de l'effet fisheye. Correspond à la moitié de la longueur du modèle fisheye.

source: **centre_y** (float) The y-coordinate of the fisheye effect’s center. Corresponds to half the width of the fisheye model.
es: **centre_y** (float) La coordenada y del centro del efecto ojo de pez. Corresponde a la mitad del ancho del modelo ojo de pez.
fr: **centre_y** (float) La coordonnée y du centre de l'effet fisheye. Correspond à la moitié de la largeur du modèle fisheye.

source: **param1_** (float) A parameter that controls the fisheye model’s aspect. Values greater than 1.0 cause the effect to converge to the center, while values less than 1.0 cause the effect to diverge from the center.
es: **param1_** (float) Un parámetro que controla el aspecto del modelo ojo de pez. Valores mayores que 1.0 hacen que el efecto converja hacia el centro, mientras que valores menores que 1.0 hacen que el efecto diverja desde el centro.
fr: **param1_** (float) Un paramètre qui contrôle l'aspect du modèle fisheye. Les valeurs supérieures à 1.0 font converger l'effet vers le centre, tandis que les valeurs inférieures à 1.0 font diverger l'effet du centre.

source: **focal_length** (float) Controls the type of fisheye lens. Values greater than 1.0 create a diverging lens effect, while values less than 0 create a converging lens effect.
es: **focal_length** (float) Controla el tipo de lente ojo de pez. Valores mayores que 1.0 crean un efecto de lente divergente, mientras que valores menores que 0 crean un efecto de lente convergente.
fr: **focal_length** (float) Contrôle le type d'objectif fisheye. Les valeurs supérieures à 1.0 créent un effet de lentille divergente, tandis que les valeurs inférieures à 0 créent un effet de lentille convergente.

source: **void** This function performs an inplace transformation on the provided `tmp_array_`, updating it with the fisheye model's coordinates.
es: **void** Esta función realiza una transformación in situ en el `tmp_array_` proporcionado, actualizándolo con las coordenadas del modelo ojo de pez.
fr: **void** Cette fonction effectue une transformation sur place sur le tableau `tmp_array_`, le mettant à jour avec les coordonnées du modèle fisheye.

source: Display surface or gameplay through a lens effect (inplace).
es: Mostrar la superficie o el juego a través de un efecto de lente (in situ).
fr: Afficher la surface ou le gameplay à travers un effet de lentille (sur place).

source: Compatible with 24-bit surfaces only.
es: Compatible solo con superficies de 24 bits.
fr: Compatible uniquement avec les surfaces 24 bits.

source: A fisheye lens is an ultra wide-angle lens that produces strong visual distortion intended to create a wide panoramic or hemispherical image.
es: Una lente ojo de pez es una lente ultra gran angular que produce una fuerte distorsión visual destinada a crear una imagen panorámica o hemisférica amplia.
fr: Un objectif fisheye est un objectif ultra grand-angle qui produit une forte distorsion visuelle destinée à créer une image panoramique ou hémisphérique large.

source: This function applies a fisheye lens effect in real-time. To achieve this, the algorithm utilizes a pre-calculated lens model transformation that is stored in a numpy ndarray, passed as the `fisheye_model` argument. The `fisheye_model` array has a shape of (w, h, 2) and contains pixel coordinates of the surface after lens transformation. All calculations are performed upstream.
es: Esta función aplica un efecto de lente ojo de pez en tiempo real. Para lograr esto, el algoritmo utiliza una transformación de modelo de lente precalculada que se almacena en un ndarray de numpy, pasado como el argumento `fisheye_model`. El array `fisheye_model` tiene una forma de (w, h, 2) y contiene las coordenadas de píxel de la superficie después de la transformación de la lente. Todos los cálculos se realizan aguas arriba.
fr: Cette fonction applique un effet de lentille fisheye en temps réel. Pour ce faire, l'algorithme utilise une transformation du modèle de lentille pré-calculée qui est stockée dans un ndarray numpy, passé en tant qu'argument `fisheye_model`. Le tableau `fisheye_model` a une forme de (w, h, 2) et contient les coordonnées des pixels de la surface après la transformation de la lentille. Toutes les calculs sont effectués en amont.

source: Use the function :func:`fisheye_footprint_c` to create the pre-calculated array. This method needs to be called only once.
es: Usa la función :func:`fisheye_footprint_c` para crear el array precalculado. Este método solo necesita ser llamado una vez.
fr: Utilisez la fonction :func:`fisheye_footprint_c` pour créer le tableau pré-calculé. Cette méthode doit être appelée une seule fois.

source: The fisheye lens transformation is applied inplace.
es: La transformación de la lente ojo de pez se aplica in situ.
fr: La transformation de lentille fisheye est appliquée sur place.

source: **Example usage**:
es: **Ejemplo de uso**:
fr: **Exemple d'utilisation** :

source: **Parameters**: - `surface_` (pygame.Surface): A surface object that is compatible with 24-bit color depth. - `fisheye_model` (numpy.ndarray): A numpy array with shape (w, h, 2) containing uint32 values that represent the transformed pixel coordinates (`x'`, `y'`). These values are pre-calculated using the :func:`fisheye_footprint_c` function.
es: **Parámetros**: - `surface_` (pygame.Surface): Un objeto de superficie compatible con una profundidad de color de 24 bits. - `fisheye_model` (numpy.ndarray): Un array de numpy con forma (w, h, 2) que contiene valores uint32 que representan las coordenadas de píxel transformadas (`x'`, `y'`). Estos valores se calculan previamente utilizando la función :func:`fisheye_footprint_c`.
fr: **Paramètres** : - `surface_` (pygame.Surface) : Un objet surface compatible avec une profondeur de couleur 24 bits. - `fisheye_model` (numpy.ndarray) : Un tableau numpy avec la forme (w, h, 2) contenant des valeurs uint32 représentant les coordonnées des pixels transformés (`x'`, `y'`). Ces valeurs sont pré-calculées en utilisant la fonction :func:`fisheye_footprint_c`.

source: **Returns**: - `None`: The transformation is applied inplace, and no value is returned.
es: **Retorna**: - `None`: La transformación se aplica in situ y no se devuelve ningún valor.
fr: **Retour** : - `None` : La transformation est appliquée sur place, et aucune valeur n'est retournée.

source: Apply a TV scanline effect on a pygame surface (inplace).
es: Aplicar un efecto de líneas de escaneo de TV en una superficie de pygame (in situ).
fr: Appliquer un effet de ligne de balayage TV sur une surface pygame (sur place).

source: The space between each scanline can be adjusted with the `space` value.
es: El espacio entre cada línea de escaneo se puede ajustar con el valor `space`.
fr: L'espace entre chaque ligne de balayage peut être ajusté avec la valeur `space`.

source: **Parameters**: - `surface_` (pygame.Surface): A surface object compatible with 24-bit or 32-bit color formats. - `space` (int, optional): The space between each scanline. You can set a constant value or use a variable for a dynamic effect. Default is 5.
es: **Parámetros**: - `surface_` (pygame.Surface): Un objeto de superficie compatible con formatos de color de 24 o 32 bits. - `space` (int, opcional): El espacio entre cada línea de escaneo. Puedes establecer un valor constante o usar una variable para un efecto dinámico. El valor predeterminado es 5.
fr: **Paramètres** : - `surface_` (pygame.Surface) : Un objet surface compatible avec des formats de couleur 24 bits ou 32 bits. - `space` (int, facultatif) : L'espace entre chaque ligne de balayage. Vous pouvez définir une valeur constante ou utiliser une variable pour un effet dynamique. La valeur par défaut est 5.

source: **Returns**: - `None`: The effect is applied inplace, and no value is returned.
es: **Retorna**: - `None`: El efecto se aplica in situ y no se devuelve ningún valor.
fr: **Retour** : - `None` : L'effet est appliqué sur place, et aucune valeur n'est retournée.

source: Apply a ripple effect without background deformation.
es: Aplicar un efecto de ondulación sin deformación del fondo.
fr: Appliquer un effet de vague sans déformation de l'arrière-plan.

source: This function simulates a ripple effect over a surface, using previous and current states of the ripple, along with a background image. The effect is applied without distorting the background image, which remains static.
es: Esta función simula un efecto de ondulación sobre una superficie, utilizando los estados previos y actuales de la ondulación, junto con una imagen de fondo. El efecto se aplica sin distorsionar la imagen de fondo, que permanece estática.
fr: Cette fonction simule un effet de vague sur une surface, en utilisant les états précédent et actuel de la vague, ainsi qu'une image d'arrière-plan. L'effet est appliqué sans déformer l'image d'arrière-plan, qui reste statique.

source: **Parameters**: - `rows_` (int): The screen width or surface width. - `cols_` (int): The screen height or surface height. - `previous_` (numpy.ndarray): A float array with shape (w, h) used for the transformation. It holds the previous state of the ripple effect. - `current_` (numpy.ndarray): A float array with shape (w, h) used for the transformation. It holds the current state of the ripple effect. - `array_` (numpy.ndarray): A uint8 array with shape (w, h, 3) containing the static background image in RGB format. This array remains unchanged. - `dispersion_` (float, optional): The ripple dampening factor, which controls the ripple effect's intensity. Higher values reduce the ripple effect radius. The default value is 0.008.
es: **Parámetros**: - `rows_` (int): El ancho de la pantalla o la superficie. - `cols_` (int): La altura de la pantalla o la superficie. - `previous_` (numpy.ndarray): Un array de tipo float con forma (w, h) utilizado para la transformación. Contiene el estado previo del efecto de ondulación. - `current_` (numpy.ndarray): Un array de tipo float con forma (w, h) utilizado para la transformación. Contiene el estado actual del efecto de ondulación. - `array_` (numpy.ndarray): Un array de tipo uint8 con forma (w, h, 3) que contiene la imagen de fondo estática en formato RGB. Este array permanece sin cambios. - `dispersion_` (float, opcional): El factor de amortiguación de la ondulación, que controla la intensidad del efecto de ondulación. Valores más altos reducen el radio del efecto de ondulación. El valor predeterminado es 0.008.
fr: **Paramètres** : - `rows_` (int) : La largeur de l'écran ou de la surface. - `cols_` (int) : La hauteur de l'écran ou de la surface. - `previous_` (numpy.ndarray) : Un tableau de flottants avec la forme (w, h) utilisé pour la transformation. Il contient l'état précédent de l'effet de vague. - `current_` (numpy.ndarray) : Un tableau de flottants avec la forme (w, h) utilisé pour la transformation. Il contient l'état actuel de l'effet de vague. - `array_` (numpy.ndarray) : Un tableau uint8 avec la forme (w, h, 3) contenant l'image d'arrière-plan statique au format RGB. Ce tableau reste inchangé. - `dispersion_` (float, facultatif) : Le facteur d'atténuation des vagues, qui contrôle l'intensité de l'effet de vague. Des valeurs plus élevées réduisent le rayon de l'effet de vague. La valeur par défaut est 0.008.

source: **Returns**: - `tuple`: Una tupla que contiene dos arrays `(current_, previous_)`, que representan los estados actualizados de la ondulación. Consulta la sección de Parámetros para ver los tamaños de cada array.
es: **Retorna**: - `tuple`: Una tupla que contiene dos arrays `(current_, previous_)`, que representan los estados actualizados de la ondulación. Consulta la sección de Parámetros para ver los tamaños de cada array.

source: Apply a ripple effect with background deformation.
es: Aplicar un efecto de ondulación con deformación del fondo.
fr: Appliquer un effet de vague avec déformation de l'arrière-plan.

source: This function simulates a ripple effect over a surface, where the background image is deformed as part of the effect. The function uses the previous and current states of the ripple along with a texture and background image.
es: Esta función simula un efecto de ondulación sobre una superficie, donde la imagen de fondo se deforma como parte del efecto. La función utiliza los estados previos y actuales de la ondulación junto con una textura y una imagen de fondo.
fr: Cette fonction simule un effet de vague sur une surface, où l'image d'arrière-plan est déformée dans le cadre de l'effet. La fonction utilise les états précédent et actuel de la vague, ainsi qu'une texture et une image d'arrière-plan.

source: **Parameters**: - `cols_` (int): The screen width or surface width. - `rows_` (int): The screen height or surface height. - `previous_` (numpy.ndarray): A float array with shape (w, h) used for the transformation. It holds the previous state of the ripple effect. - `current_` (numpy.ndarray): A float array with shape (w, h) used for the transformation. It holds the current state of the ripple effect. - `texture_array_` (numpy.ndarray): A uint8 array with shape (w, h, 3) containing the static background image in RGB format. This array is unchanged during the ripple transformation. - `background_array_` (numpy.ndarray): A uint8 array with shape (w, h, 3) containing the background image in RGB format. This array is transformed by the ripple effect. - `dispersion_` (float, optional): The ripple dampening factor, which controls the ripple effect's intensity. Higher values reduce the ripple effect radius. The default value is 0.008.
es: **Parámetros**: - `cols_` (int): El ancho de la pantalla o la superficie. - `rows_` (int): La altura de la pantalla o la superficie. - `previous_` (numpy.ndarray): Un array de tipo float con forma (w, h) utilizado para la transformación. Contiene el estado previo del efecto de ondulación. - `current_` (numpy.ndarray): Un array de tipo float con forma (w, h) utilizado para la transformación. Contiene el estado actual del efecto de ondulación. - `texture_array_` (numpy.ndarray): Un array de tipo uint8 con forma (w, h, 3) que contiene la imagen de fondo estática en formato RGB. Este array permanece sin cambios durante la transformación de la ondulación. - `background_array_` (numpy.ndarray): Un array de tipo uint8 con forma (w, h, 3) que contiene la imagen de fondo en formato RGB. Este array se transforma por el efecto de ondulación. - `dispersion_` (float, opcional): El factor de amortiguación de la ondulación, que controla la intensidad del efecto de ondulación. Valores más altos reducen el radio del efecto de ondulación. El valor predeterminado es 0.008.
fr: **Paramètres** : - `cols_` (int) : La largeur de l'écran ou de la surface. - `rows_` (int) : La hauteur de l'écran ou de la surface. - `previous_` (numpy.ndarray) : Un tableau de flottants avec la forme (w, h) utilisé pour la transformation. Il contient l'état précédent de l'effet de vague. - `current_` (numpy.ndarray) : Un tableau de flottants avec la forme (w, h) utilisé pour la transformation. Il contient l'état actuel de l'effet de vague. - `texture_array_` (numpy.ndarray) : Un tableau uint8 avec la forme (w, h, 3) contenant l'image d'arrière-plan statique au format RGB. Ce tableau reste inchangé pendant la transformation des vagues. - `background_array_` (numpy.ndarray) : Un tableau uint8 avec la forme (w, h, 3) contenant l'image d'arrière-plan au format RGB. Ce tableau est transformé par l'effet de vague. - `dispersion_` (float, facultatif) : Le facteur d'atténuation des vagues, qui contrôle l'intensité de l'effet de vague. Des valeurs plus élevées réduisent le rayon de l'effet de vague. La valeur par défaut est 0.008.

source: **Returns**: - `tuple`: A tuple containing three arrays `(current_, previous_, bck_array)`. The arrays represent the updated states of the ripple effect and background deformation. See the Parameters section for the sizes of each array.
es: **Retorna**: - `tuple`: Una tupla que contiene tres arrays `(current_, previous_, bck_array)`. Los arrays representan los estados actualizados del efecto de ondulación y la deformación del fondo. Consulta la sección de Parámetros para ver los tamaños de cada array.
fr: **Retour** : - `tuple` : Un tuple contenant trois tableaux `(current_, previous_, bck_array)`. Les tableaux représentent les états mis à jour de l'effet de vague et de la déformation de l'arrière-plan. Voir la section Paramètres pour les tailles de chaque tableau.

source: Transform an image into a heatmap equivalent (in-place).
es: Transformar una imagen en un equivalente de mapa de calor (in situ).
fr: Transformer une image en équivalent carte thermique (sur place).
