Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: 1. High-Performance Image Processing Library
es: 1. Biblioteca de Procesamiento de Imágenes de Alto Rendimiento
fr: 1. Bibliothèque de traitement d'image haute performance

source: This library is a Cython-based module designed for high-performance image processing and manipulation. By leveraging Cython’s ability to combine Python’s ease of use with C-like performance, it is optimized for computationally intensive tasks such as real-time image processing, game development, computer vision, and artistic effects.
es: Esta biblioteca es un módulo basado en Cython diseñado para el procesamiento y manipulación de imágenes de alto rendimiento. Aprovechando la capacidad de Cython para combinar la facilidad de uso de Python con un rendimiento similar al de C, está optimizada para tareas computacionalmente intensivas como el procesamiento de imágenes en tiempo real, el desarrollo de juegos, la visión por computadora y los efectos artísticos.
fr: Cette bibliothèque est un module basé sur Cython conçu pour le traitement et la manipulation d'images haute performance. En exploitant la capacité de Cython à combiner la simplicité de Python avec les performances du C, elle est optimisée pour des tâches intensives en calcul, telles que le traitement d'image en temps réel, le développement de jeux, la vision par ordinateur et les effets artistiques.

source: 2. Key Features
es: 2. Características Clave
fr: 2. Fonctionnalités principales

source: **Color space conversions** (RGB, grayscale, HSL, HSV)
es: **Conversiones de espacio de color** (RGB, escala de grises, HSL, HSV)
fr: **Conversions d'espaces colorimétriques** (RGB, niveaux de gris, HSL, HSV)

source: **Image transformations** (mirroring, pixelation, resizing)
es: **Transformaciones de imagen** (espeje, pixelado, cambio de tamaño)
fr: **Transformations d'image** (miroir, pixellisation, redimensionnement)

source: **Visual effects** (distortions, filters, artistic effects)
es: **Efectos visuales** (distorsiones, filtros, efectos artísticos)
fr: **Effets visuels** (distorsions, filtres, effets artistiques)

source: **Advanced image processing** (edge detection, sharpening, blending)
es: **Procesamiento avanzado de imágenes** (detección de bordes, enfoque, mezcla)
fr: **Traitement d'image avancé** (détection des contours, accentuation, fusion)

source: **Physical simulations** (ripple effects, heat convection)
es: **Simulaciones físicas** (efectos de ondas, convección de calor)
fr: **Simulations physiques** (effets d'ondulation, convection thermique)

source: **Performance optimizations** (multi-threading, memory-efficient operations)
es: **Optimizaciones de rendimiento** (multi-hilos, operaciones eficientes en memoria)
fr: **Optimisations des performances** (multi-threading, opérations optimisées en mémoire)

source: 3. Library Functional Overview
es: 3. Resumen Funcional de la Biblioteca
fr: 3. Aperçu fonctionnel de la bibliothèque

source: **Color Manipulation**
es: **Manipulación de Color**
fr: **Manipulation des couleurs**

source: **Color Conversions**: `bgr`, `brg`, `grey`, `sepia`, `hsl_effect`, `hsv_effect`
es: **Conversiones de Color**: `bgr`, `brg`, `gris`, `sepia`, `efecto_hsl`, `efecto_hsv`
fr: **Conversions de couleurs** : `bgr`, `brg`, `grey`, `sepia`, `hsl_effect`, `hsv_effect`

source: **Brightness & Saturation**: `brightness`, `saturation`, `brightness_exclude`, `brightness_bpf`
es: **Brillo & Saturación**: `brillo`, `saturación`, `excluir_brillo`, `brillo_bpf`
fr: **Luminosité & Saturation** : `brightness`, `saturation`, `brightness_exclude`, `brightness_bpf`

source: **Color Inversion**: `invert`
es: **Inversión de Color**: `invertir`
fr: **Inversion des couleurs** : `invert`

source: **Visual Effects**
es: **Efectos Visuales**
fr: **Effets visuels**

source: **Filters**: `median`, `sobel`, `bloom`, `posterize_surface`
es: **Filtros**: `mediana`, `sobel`, `bloom`, `posterizar_superficie`
fr: **Filtres** : `median`, `sobel`, `bloom`, `posterize_surface`

source: **Distortions**: `wave`, `swirl`, `fisheye`, `horizontal_glitch`, `horizontal_sglitch`
es: **Distorsiones**: `ola`, `remolino`, `ojo_de_pez`, `glitch_horizontal`, `glitch_shorizontal`
fr: **Distorsions** : `wave`, `swirl`, `fisheye`, `horizontal_glitch`, `horizontal_sglitch`

source: **Artistic Effects**: `painting`, `cartoon`, `dithering`, `dithering_atkinson`
es: **Efectos Artísticos**: `pintura`, `caricatura`, `dither`, `dither_atkinson`
fr: **Effets artistiques** : `painting`, `cartoon`, `dithering`, `dithering_atkinson`

source: **Advanced Image Processing**
es: **Procesamiento Avanzado de Imágenes**
fr: **Traitement d'image avancé**

source: **Edge Detection & Sharpening**: `sobel`, `sobel_fast`, `sharpen`, `sharpen32`
es: **Detección de Bordes y Enfoque**: `sobel`, `sobel_rápido`, `enfoque`, `enfoque32`
fr: **Détection des contours & Netteté** : `sobel`, `sobel_fast`, `sharpen`, `sharpen32`

source: **Blending & Compositing**: `blend`, `alpha_blending`, `alpha_blending_inplace`
es: **Mezcla & Composición**: `mezclar`, `mecla_alpha`, `mecla_alpha_inplace`
fr: **Fusion & Composition** : `blend`, `alpha_blending`, `alpha_blending_inplace`

source: **Heatmap Effects**: `heatmap`, `predator_vision`
es: **Efectos de Mapa de Calor**: `mapacalor`, `visión_predador`
fr: **Effets thermiques** : `heatmap`, `predator_vision`

source: **Physical Simulations**
es: **Simulaciones Físicas**
fr: **Simulations physiques**

source: **Ripple Effects**: `ripple`, `ripple_seabed`
es: **Efectos de Onda**: `onda`, `onda_fondomarino`
fr: **Effets d'ondulation** : `ripple`, `ripple_seabed`

source: **Heat Convection**: `heatconvection`
es: **Convección de Calor**: `conveccióncalor`
fr: **Convection thermique** : `heatconvection`

source: **Plasma Effects**: `plasma`, `plasma_config`
es: **Efectos de Plasma**: `plasma`, `config_plasma`
fr: **Effets plasma** : `plasma`, `plasma_config`

source: **Utility Functions**
es: **Funciones Utilitarias**
fr: **Fonctions utilitaires**

source: **Image Transformations**: `mirroring`, `pixelation`, `bilinear`
es: **Transformaciones de Imagen**: `espeje`, `pixelado`, `bilineal`
fr: **Transformations d'image** : `mirroring`, `pixelation`, `bilinear`

source: **Color Mapping**: `wavelength2rgb`, `custom_map`
es: **Mapeo de Colores**: `longituddeonda2rgb`, `mapa_personalizado`
fr: **Mappage des couleurs** : `wavelength2rgb`, `custom_map`

source: **Optimized Functions**: `bgr_1d`, `grey_1d`, `invert1d`
es: **Funciones Optimizadas**: `bgr_1d`, `gris_1d`, `invertir1d`
fr: **Fonctions optimisées** : `bgr_1d`, `grey_1d`, `invert1d`

source: **Special Effects**
es: **Efectos Especiales**
fr: **Effets spéciaux**

source: **Retro TV Scanlines**: `tv_scan`
es: **Líneas de Escaneo Retro de TV**: `escaneo_tv`
fr: **Lignes de balayage TV rétro** : `tv_scan`

source: **Blood Effects**: `blood`
es: **Efectos de Sangre**: `sangre`
fr: **Effets de sang** : `blood`

source: **Dirt & Lens Distortion**: `dirt_lens`
es: **Distorsión de Suciedad y Lentes**: `suciedad_lente`
fr: **Saleté & distorsion de lentille** : `dirt_lens`

source: **Performance & Optimization**
es: **Rendimiento y Optimización**
fr: **Performances & optimisation**

source: **Memory Efficiency**: Optimized for `1D` and `3D` pixel arrays
es: **Eficiencia de Memoria**: Optimizado para arreglos de píxeles `1D` y `3D`
fr: **Efficacité mémoire** : Optimisé pour les tableaux de pixels `1D` et `3D`

source: **Parallel Processing**: Uses `nogil` for multi-threaded execution
es: **Procesamiento Paralelo**: Utiliza `nogil` para ejecución multi-hilo
fr: **Traitement parallèle** : Utilise `nogil` pour une exécution multi-threadée**

source: 4. Target Applications
es: 4. Aplicaciones Objetivo
fr: 4. Applications ciblées

source: This library is ideal for: - **Game Development**: Real-time visual effects, distortions, blending - **Computer Vision**: Preprocessing images for machine learning & analysis - **Artistic Applications**: Creative effects for images and videos - **Scientific Visualization**: Simulating physical phenomena (heat, ripples)
es: Esta biblioteca es ideal para: - **Desarrollo de Juegos**: Efectos visuales en tiempo real, distorsiones, mezcla - **Visión por Computadora**: Preprocesamiento de imágenes para aprendizaje automático y análisis - **Aplicaciones Artísticas**: Efectos creativos para imágenes y videos - **Visualización Científica**: Simulación de fenómenos físicos (calor, ondas)
fr: Cette bibliothèque est idéale pour : - **Développement de jeux** : Effets visuels en temps réel, distorsions, fusion - **Vision par ordinateur** : Prétraitement des images pour l'apprentissage automatique et l'analyse - **Applications artistiques** : Effets créatifs pour les images et les vidéos - **Visualisation scientifique** : Simulation de phénomènes physiques (chaleur, ondulations)

source: 5. Summary
es: 5. Resumen
fr: 5. Résumé

source: This Cython-based library is a powerful toolkit for image processing, combining high-performance optimizations with a vast range of visual effects and transformations. It is particularly suited for real-time and high-performance applications, making it an essential tool for game developers, computer vision engineers, and creative professionals.
es: Esta biblioteca basada en Cython es un potente conjunto de herramientas para el procesamiento de imágenes, combinando optimizaciones de alto rendimiento con una amplia gama de efectos visuales y transformaciones. Es especialmente adecuada para aplicaciones en tiempo real y de alto rendimiento, lo que la convierte en una herramienta esencial para desarrolladores de juegos, ingenieros de visión por computadora y profesionales creativos.
fr: Cette bibliothèque basée sur Cython est un outil puissant pour le traitement d'images, combinant des optimisations haute performance avec une large gamme d'effets visuels et de transformations. Elle est particulièrement adaptée aux applications en temps réel et haute performance, en faisant un outil essentiel pour les développeurs de jeux, les ingénieurs en vision par ordinateur et les professionnels de la création.

source: 6. Cython list methods
es: 6. Métodos de listas en Cython
fr: 6. Méthodes de liste en Cython

source: Convert an image from RGB(A) to BGR(A) format (in-place). Converts the game display, image, or surface from RGB(A) to BGR(A) format. The alpha channel will be ignored in the process, but it is retained in case of a 32-bit surface.
es: Convierte una imagen de formato RGB(A) a BGR(A) (en el lugar). Convierte la pantalla del juego, imagen o superficie de RGB(A) a BGR(A). El canal alfa será ignorado en el proceso, pero se mantiene en caso de una superficie de 32 bits.
fr: Convertit une image du format RGB(A) au format BGR(A) (en place). Convertit l'affichage du jeu, l'image ou la surface du format RGB(A) au format BGR(A). Le canal alpha sera ignoré dans le processus, mais il est conservé dans le cas d'une surface 32 bits.

source: RGB is commonly used in image editing and display applications, where the order is red, green, and blue. On the other hand, BGR is often used in image processing applications, where the order is blue, green, and red.
es: RGB se usa comúnmente en aplicaciones de edición y visualización de imágenes, donde el orden es rojo, verde y azul. Por otro lado, BGR se usa a menudo en aplicaciones de procesamiento de imágenes, donde el orden es azul, verde y rojo.
fr: Le format RGB est couramment utilisé dans les applications d'édition et d'affichage d'images, où l'ordre est rouge, vert et bleu. En revanche, le format BGR est souvent utilisé dans les applications de traitement d'images, où l'ordre est bleu, vert et rouge.

source: **Note**: This function operates in-place, meaning it modifies the original surface.
es: **Nota**: Esta función opera en el lugar, lo que significa que modifica la superficie original.
fr: **Remarque** : Cette fonction fonctionne en place, ce qui signifie qu'elle modifie la surface d'origine.

source: **Parameters:**
es: **Parámetros:**
fr: **Paramètres :**

source: **surface_** (Pygame surface) Pygame surface (either display or image) with a compatible format (24-bit or 32-bit, with or without transparency/alpha channel).
es: **superficie_** (superficie de Pygame) Superficie de Pygame (ya sea de pantalla o imagen) con un formato compatible (24 bits o 32 bits, con o sin canal de transparencia/alfa).
fr: **surface_** (Surface Pygame) Surface Pygame (affichage ou image) avec un format compatible (24 bits ou 32 bits, avec ou sans transparence/canal alpha).

source: **Returns:**
es: **Devuelve:**
fr: **Retour :**

source: void; modifies the surface in-place.
es: vacío; modifica la superficie en su lugar.
fr: void ; modifie la surface en place.

source: Convert an image format from RGB(A) to BGR(A) and return a new surface (copy). This function converts the pixel data of an input image from RGB(A) to BGR(A) format. The Alpha channel (if present) will be retained, but the order of the color channels is switched from RGB to BGR. This is useful when working with image processing libraries that expect the BGR format (such as OpenCV), while the RGB format is commonly used in display and image editing applications.
es: Convierte un formato de imagen de RGB(A) a BGR(A) y devuelve una nueva superficie (copia). Esta función convierte los datos de píxeles de una imagen de entrada de RGB(A) a formato BGR(A). El canal Alfa (si está presente) se conservará, pero el orden de los canales de color se cambia de RGB a BGR. Esto es útil cuando se trabaja con bibliotecas de procesamiento de imágenes que esperan el formato BGR (como OpenCV), mientras que el formato RGB es comúnmente usado en aplicaciones de visualización y edición de imágenes.
fr: Convertit une image du format RGB(A) au format BGR(A) et retourne une nouvelle surface (copie). Cette fonction convertit les données de pixels d'une image d'entrée du format RGB(A) au format BGR(A). Le canal alpha (s'il est présent) sera conservé, mais l'ordre des canaux de couleur est inversé de RGB à BGR. Cela est utile lors de l'utilisation de bibliothèques de traitement d'image qui attendent le format BGR (comme OpenCV), alors que le format RGB est couramment utilisé dans les applications d'affichage et d'édition d'images.

source: **surface_** (Pygame Surface) A Pygame Surface object representing the image. The surface can be in 24-bit or 32-bit format (with or without an alpha channel). The function assumes the image is in RGB(A) format and will convert it to BGR(A).
es: **superficie_** (Pygame Surface) Un objeto Surface de Pygame que representa la imagen. La superficie puede estar en formato de 24 bits o 32 bits (con o sin canal alfa). La función asume que la imagen está en formato RGB(A) y la convertirá a BGR(A).
fr: **surface_** (Surface Pygame) Un objet Surface Pygame représentant l'image. La surface peut être au format 24 bits ou 32 bits (avec ou sans canal alpha). La fonction suppose que l'image est au format RGB(A) et la convertira en BGR(A).

source: A new Pygame Surface object with the converted BGR(A) pixel format.
es: Un nuevo objeto Surface de Pygame con el formato de píxel BGR(A) convertido.
fr: Un nouvel objet Surface Pygame avec le format de pixels converti en BGR(A).

source: Convert an RGB(A) array (shape: w, h, n) with uint8 data type to BGR(A) format (inplace). This function directly processes a 3D array (such as an image or surface) from RGB(A) format to BGR(A) format. It assumes that the input array is in RGB or RGBA format, and it switches the red and blue channels to convert it to BGR or BGRA format respectively. The operation is done in place, modifying the original array.
es: Convierte un arreglo RGB(A) (forma: w, h, n) con tipo de dato uint8 a formato BGR(A) (en su lugar). Esta función procesa directamente un arreglo 3D (como una imagen o superficie) de formato RGB(A) a formato BGR(A). Asume que el arreglo de entrada está en formato RGB o RGBA, y cambia los canales rojo y azul para convertirlo a formato BGR o BGRA, respectivamente. La operación se hace en su lugar, modificando el arreglo original.
fr: Convertit un tableau RGB(A) (forme : w, h, n) avec un type de données uint8 en format BGR(A) (en place). Cette fonction traite directement un tableau 3D (comme une image ou une surface) du format RGB(A) au format BGR(A). Elle suppose que le tableau d'entrée est au format RGB ou RGBA, et elle inverse les canaux rouge et bleu pour le convertir respectivement en BGR ou BGRA. L'opération est effectuée en place, modifiant ainsi le tableau d'origine.

source: RGB is the common color order used in display and image editing applications, where the color channels are arranged as red, green, blue. On the other hand, BGR is often used in image processing applications, where the color channels are arranged as blue, green, red.
es: RGB es el orden de colores comúnmente utilizado en aplicaciones de visualización y edición de imágenes, donde los canales de color están organizados como rojo, verde, azul. Por otro lado, BGR es comúnmente usado en aplicaciones de procesamiento de imágenes, donde los canales de color están organizados como azul, verde, rojo.
fr: RGB est l'ordre de couleurs couramment utilisé dans les applications d'affichage et d'édition d'images, où les canaux de couleur sont disposés en rouge, vert, bleu. En revanche, le format BGR est souvent utilisé dans les applications de traitement d'images, où les canaux de couleur sont disposés en bleu, vert, rouge.

source: **rgb_array** (numpy.ndarray) A 3D numpy array of shape (w, h, n), where `w` is the width, `h` is the height, and `n` is the number of channels (3 for RGB, 4 for RGBA). The array should have uint8 data type (values between 0 and 255), and contain pixel data in RGB(A) format.
es: **rgb_array** (numpy.ndarray) Un arreglo 3D de numpy con forma (w, h, n), donde `w` es el ancho, `h` es la altura, y `n` es el número de canales (3 para RGB, 4 para RGBA). El arreglo debe tener tipo de dato uint8 (valores entre 0 y 255), y contener datos de píxeles en formato RGB(A).
fr: **rgb_array** (numpy.ndarray) Un tableau numpy 3D de forme (w, h, n), où `w` est la largeur, `h` est la hauteur et `n` est le nombre de canaux (3 pour RGB, 4 pour RGBA). Le tableau doit être de type uint8 (valeurs comprises entre 0 et 255) et contenir des données de pixels au format RGB(A).

source: void This function modifies the input array in place and does not return any value.
es: vacío Esta función modifica el arreglo de entrada en su lugar y no devuelve ningún valor.
fr: void Cette fonction modifie le tableau d'entrée en place et ne retourne aucune valeur.

source: **Raises:**
es: **Lanza:**
fr: **Exceptions :**

source: **ValueError** If the input array shape is not compatible with RGB(A) (i.e., it does not have the shape (w, h, 3) or (w, h, 4)).
es: **ValueError** Si la forma del arreglo de entrada no es compatible con RGB(A) (es decir, no tiene la forma (w, h, 3) o (w, h, 4)).
fr: **ValueError** Si la forme du tableau d'entrée n'est pas compatible avec RGB(A) (c'est-à-dire s'il n'a pas la forme (w, h, 3) ou (w, h, 4)).

source: **TypeError** If the input array does not have the uint8 (unsigned byte) data type.
es: **TypeError** Si el arreglo de entrada no tiene el tipo de dato uint8 (byte sin signo).
fr: **TypeError** Si le tableau d'entrée n'a pas le type de données uint8 (octet non signé).

source: Convert a 1D array of uint8 data type from RGB(A) to BGR(A) format (inplace). This function processes a 1D array directly, converting the color channels from the RGB(A) format to the BGR(A) format. The conversion is done in place, modifying the original array. The `format_32` flag determines whether the input is in RGB (24-bit) or RGBA (32-bit) format.
es: Convierte un arreglo 1D de tipo de dato uint8 de RGB(A) a formato BGR(A) (en su lugar). Esta función procesa directamente un arreglo 1D, convirtiendo los canales de color del formato RGB(A) al formato BGR(A). La conversión se hace en su lugar, modificando el arreglo original. La bandera `format_32` determina si la entrada está en formato RGB (24 bits) o RGBA (32 bits).
fr: Convertit un tableau 1D de type uint8 du format RGB(A) au format BGR(A) (en place). Cette fonction traite directement un tableau 1D, en convertissant les canaux de couleur du format RGB(A) au format BGR(A). La conversion est effectuée en place, modifiant ainsi le tableau original. Le drapeau `format_32` détermine si l'entrée est en format RGB (24 bits) ou en format RGBA (32 bits).

source: RGB is the standard color order used in many image editing and display applications, where the order of the color channels is red, green, and blue. In contrast, BGR is often used in image processing, where the color channels are arranged as blue, green, and red.
es: RGB es el orden de color estándar utilizado en muchas aplicaciones de edición de imágenes y visualización, donde el orden de los canales de color es rojo, verde y azul. En contraste, BGR es utilizado en procesamiento de imágenes, donde los canales de color están organizados como azul, verde y rojo.
fr: RGB est l'ordre de couleurs standard utilisé dans de nombreuses applications d'édition et d'affichage d'images, où les canaux de couleur sont disposés en rouge, vert et bleu. En revanche, le format BGR est souvent utilisé dans le traitement d'images, où les canaux de couleur sont disposés en bleu, vert et rouge.

source: **rgb_array** (numpy.ndarray or bytearray) A 1D array (or buffer) of pixel data in RGB(A) format, with uint8 data type (values between 0 and 255). The array length should be a multiple of 3 (for RGB) or 4 (for RGBA). The array contains the pixel color values that will be converted from RGB(A) to BGR(A) format.
es: **rgb_array** (numpy.ndarray o bytearray) Un arreglo 1D (o búfer) de datos de píxeles en formato RGB(A), con tipo de dato uint8 (valores entre 0 y 255). La longitud del arreglo debe ser un múltiplo de 3 (para RGB) o 4 (para RGBA). El arreglo contiene los valores de color de píxeles que se convertirán de RGB(A) a formato BGR(A).
fr: **rgb_array** (numpy.ndarray ou bytearray) Un tableau 1D (ou un tampon) de données de pixels au format RGB(A), avec un type de données uint8 (valeurs comprises entre 0 et 255). La longueur du tableau doit être un multiple de 3 (pour RGB) ou de 4 (pour RGBA). Le tableau contient les valeurs de couleur des pixels qui seront converties du format RGB(A) au format BGR(A).

source: **format_32** (bool, optional) A boolean flag indicating the format of the input array. - `True` indicates the array is in 'RGB' (24-bit, 3 channels). - `False` (default) indicates the array is in 'RGBA' (32-bit, 4 channels).
es: **format_32** (bool, opcional) Un indicador booleano que señala el formato del arreglo de entrada. - `True` indica que el arreglo está en 'RGB' (24-bit, 3 canales). - `False` (predeterminado) indica que el arreglo está en 'RGBA' (32-bit, 4 canales).
fr: **format_32** (bool, optionnel) Un drapeau booléen indiquant le format du tableau d'entrée. - `True` indique que le tableau est en 'RGB' (24 bits, 3 canaux). - `False` (par défaut) indique que le tableau est en 'RGBA' (32 bits, 4 canaux).

source: void The function modifies the input array in place and does not return any value.
es: void La función modifica el arreglo de entrada en su lugar y no retorna ningún valor.
fr: void La fonction modifie le tableau d'entrée en place et ne retourne aucune valeur.

source: **TypeError** If the input array does not have a `uint8` data type.
es: **TypeError** Si el arreglo de entrada no tiene un tipo de dato `uint8`.
fr: **TypeError** Si le tableau d'entrée n'a pas le type de données `uint8`.
