Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader_gpu.po
Languages: es, fr

source: **rad** (*float*): Rotation angle in radians, controlling the intensity of the swirl.
es: **rad** (*float*): Ángulo de rotación en radianes, controlando la intensidad del remolino.
fr: **rad** (*float*) : Angle de rotation en radians, contrôlant l'intensité de l'effet de spirale.

source: **grid_** (*tuple*): CUDA grid size, typically `(grid_y, grid_x)`. Defines how computation is distributed across the GPU.
es: **grid_** (*tuple*): Tamaño de la cuadrícula CUDA, típicamente `(grid_y, grid_x)`. Define cómo se distribuye el cálculo en la GPU.
fr: **grid_** (*tuple*) : Taille de la grille CUDA, typiquement `(grid_y, grid_x)`. Définit comment le calcul est distribué sur le GPU.

source: **block_** (*tuple*): CUDA block size, typically `(block_y, block_x)`. The number of threads per block should not exceed 1024.
es: **block_** (*tuple*): Tamaño del bloque CUDA, típicamente `(block_y, block_x)`. El número de hilos por bloque no debe exceder 1024.
fr: **block_** (*tuple*) : Taille du bloc CUDA, typiquement `(block_y, block_x)`. Le nombre de threads par bloc ne doit pas dépasser 1024.

source: **centre_x** (*int*): X-coordinate of the swirl center (must be greater than 0).
es: **centre_x** (*int*): Coordenada X del centro del remolino (debe ser mayor que 0).
fr: **centre_x** (*int*) : Coordonnée X du centre de la spirale (doit être supérieure à 0).

source: **centre_y** (*int*): Y-coordinate of the swirl center (must be greater than 0).
es: **centre_y** (*int*): Coordenada Y del centro del remolino (debe ser mayor que 0).
fr: **centre_y** (*int*) : Coordonnée Y du centre de la spirale (doit être supérieure à 0).

source: (*pygame.Surface*): A new `pygame.Surface` with the applied swirl effect.
es: (*pygame.Surface*): Un nuevo `pygame.Surface` con el efecto de remolino aplicado.
fr: (*pygame.Surface*) : Un nouveau `pygame.Surface` avec l'effet de spirale appliqué.

source: **ValueError**: If the input surface cannot be referenced as a 3D array.
es: **ValueError**: Si la superficie de entrada no puede ser referenciada como un array 3D.
fr: **ValueError** : Si la surface d'entrée ne peut pas être référencée comme un tableau 3D.

source: The function operates directly on the GPU using CuPy for high performance.
es: La función opera directamente en la GPU utilizando CuPy para un alto rendimiento.
fr: La fonction s'exécute directement sur le GPU en utilisant CuPy pour des performances élevées.

source: Ensure `grid_` and `block_` are correctly configured for optimal execution.
es: Asegúrese de que `grid_` y `block_` estén configurados correctamente para una ejecución óptima.
fr: Assurez-vous que `grid_` et `block_` sont correctement configurés pour une exécution optimale.

source: The function calls `swirl_cupy`, which handles the actual GPU-based processing.
es: La función llama a `swirl_cupy`, que maneja el procesamiento real basado en GPU.
fr: La fonction appelle `swirl_cupy`, qui prend en charge le traitement réel basé sur le GPU.

source: Creates a wave effect on an image using GPU acceleration.
es: Crea un efecto de onda en una imagen utilizando aceleración por GPU.
fr: Crée un effet de vague sur une image en utilisant l'accélération GPU.

source: This function applies a wave distortion effect to a given `pygame.Surface` by applying a CUDA-based transformation. The effect creates a realistic wave motion across the image based on the specified angle and block size.
es: Esta función aplica un efecto de distorsión de onda a un `pygame.Surface` dado mediante una transformación basada en CUDA. El efecto crea un movimiento de onda realista en la imagen basado en el ángulo y el tamaño de bloque especificados.
fr: Cette fonction applique un effet de distorsion en vague à un `pygame.Surface` en utilisant une transformation basée sur CUDA. L'effet crée un mouvement de vague réaliste sur l'image en fonction de l'angle et de la taille du bloc spécifiés.

source: **surface_** (*pygame.Surface*): The input image surface, which must be in 24-bit or 32-bit format.
es: **surface_** (*pygame.Surface*): La superficie de la imagen de entrada, que debe estar en formato de 24 o 32 bits.
fr: **surface_** (*pygame.Surface*) : La surface d'image en entrée, qui doit être au format 24 bits ou 32 bits.

source: **rad_** (*float*): A variable angle in radians that controls the wave effect.
es: **rad_** (*float*): Un ángulo variable en radianes que controla el efecto de onda.
fr: **rad_** (*float*): Un angle variable en radians qui contrôle l'effet de vague.

source: **size_** (*int*): The block size for the wave effect. For a realistic wave, it's recommended to keep the size below 15.
es: **size_** (*int*): El tamaño del bloque para el efecto de onda. Para una onda realista, se recomienda mantener el tamaño por debajo de 15.
fr: **size_** (*int*): La taille du bloc pour l'effet de vague. Pour un effet réaliste, il est recommandé de garder la taille inférieure à 15.

source: **grid_** (*tuple*): CUDA grid size, typically `(grid_y, grid_x)`, defines how computation is distributed across the GPU.
es: **grid_** (*tuple*): Tamaño de la cuadrícula CUDA, típicamente `(grid_y, grid_x)`, define cómo se distribuye el cálculo en la GPU.
fr: **grid_** (*tuple*): Taille de la grille CUDA, typiquement `(grid_y, grid_x)`, définissant comment le calcul est réparti sur le GPU.

source: **block_** (*tuple*): CUDA block size, typically `(block_y, block_x)`, the number of threads per block should not exceed 1024.
es: **block_** (*tuple*): Tamaño del bloque CUDA, típicamente `(block_y, block_x)`, el número de hilos por bloque no debe exceder 1024.
fr: **block_** (*tuple*): Taille du bloc CUDA, typiquement `(block_y, block_x)`. Le nombre de threads par bloc ne doit pas dépasser 1024.

source: (*pygame.Surface*): A new `pygame.Surface` with the wave effect applied. It is recommended to rescale the image to hide any visible distortions around the left and bottom borders, especially if a texture wraparound effect is noticeable.
es: (*pygame.Surface*): Un nuevo `pygame.Surface` con el efecto de onda aplicado. Se recomienda reescalar la imagen para ocultar cualquier distorsión visible alrededor de los bordes izquierdo e inferior, especialmente si se nota un efecto de envoltura de textura.
fr: (*pygame.Surface*): Un nouveau `pygame.Surface` avec l'effet de vague appliqué. Il est recommandé de redimensionner l'image pour masquer toute distorsion visible sur les bords gauche et inférieur, en particulier si un effet de bouclage de texture est perceptible.

source: Example usage: `IMAGE = wave_gpu(IMAGE, 8 * math.pi/180.0 + FRAME/10, 8, grid, block)` `IMAGE = scale(IMAGE, (WIDTH + 16, HEIGHT + 16))` to hide the wraparound effect.
es: Ejemplo de uso: `IMAGE = wave_gpu(IMAGE, 8 * math.pi/180.0 + FRAME/10, 8, grid, block)` `IMAGE = scale(IMAGE, (WIDTH + 16, HEIGHT + 16))` para ocultar el efecto de envoltura.
fr: Exemple d'utilisation : `IMAGE = wave_gpu(IMAGE, 8 * math.pi/180.0 + FRAME/10, 8, grid, block)` `IMAGE = scale(IMAGE, (WIDTH + 16, HEIGHT + 16))` pour masquer l'effet de bouclage.

source: Ensure that the grid and block configurations are correctly selected for optimal performance.
es: Asegúrese de que las configuraciones de la cuadrícula y el bloque estén seleccionadas correctamente para un rendimiento óptimo.
fr: Assurez-vous que les configurations de grille et de bloc sont correctement sélectionnées pour des performances optimales.

source: Applies a chromatic displacement effect to a given surface using GPU acceleration.
es: Aplica un efecto de desplazamiento cromático a una superficie dada utilizando aceleración por GPU.
fr: Applique un effet de déplacement chromatique à une surface donnée en utilisant l'accélération GPU.

source: This effect creates a color separation by shifting the RGB channels based on the specified horizontal and vertical displacement values. The function is optimized for 24-bit and 32-bit image formats.
es: Este efecto crea una separación de colores desplazando los canales RGB según los valores de desplazamiento horizontal y vertical especificados. La función está optimizada para formatos de imagen de 24 y 32 bits.
fr: Cet effet crée une séparation des couleurs en décalant les canaux RGB en fonction des valeurs de déplacement horizontal et vertical spécifiées. La fonction est optimisée pour les formats d'image 24 bits et 32 bits.

source: **surface_** (*pygame.Surface*): The input surface to be processed. Must be in 24-bit or 32-bit format.
es: **surface_** (*pygame.Surface*): La superficie de entrada a procesar. Debe estar en formato de 24 o 32 bits.
fr: **surface_** (*pygame.Surface*): La surface d'entrée à traiter. Doit être au format 24 bits ou 32 bits.

source: **delta_x** (*int*): Horizontal displacement for the chromatic shift. Affects the red and blue channels, creating a color separation effect. A value of zero results in no horizontal displacement (if `fx` is low).
es: **delta_x** (*int*): Desplazamiento horizontal para el cambio cromático. Afecta los canales rojo y azul, creando un efecto de separación de colores. Un valor de cero resulta en ningún desplazamiento horizontal (si `fx` es bajo).
fr: **delta_x** (*int*): Déplacement horizontal pour le décalage chromatique. Affecte les canaux rouge et bleu, créant un effet de séparation des couleurs. Une valeur de zéro entraîne l'absence de déplacement horizontal (si `fx` est faible).

source: **delta_y** (*int*): Vertical displacement for the chromatic shift. Functions similarly to `delta_x`, but applies to vertical movement. A value of zero results in no vertical displacement (if `fx` is low).
es: **delta_y** (*int*): Desplazamiento vertical para el cambio cromático. Funciona de manera similar a `delta_x`, pero se aplica al movimiento vertical. Un valor de cero resulta en ningún desplazamiento vertical (si `fx` es bajo).
fr: **delta_y** (*int*): Déplacement vertical pour le décalage chromatique. Fonctionne de manière similaire à `delta_x`, mais s'applique au mouvement vertical. Une valeur de zéro entraîne l'absence de déplacement vertical (si `fx` est faible).

source: **grid_** (*tuple*): A tuple `(grid_y, grid_x)` representing grid dimensions, e.g., `(25, 25)`. Defines the division of the image for GPU processing, and must match the texture and array sizes.
es: **grid_** (*tuple*): Una tupla `(grid_y, grid_x)` que representa las dimensiones de la cuadrícula, por ejemplo, `(25, 25)`. Define la división de la imagen para el procesamiento en GPU y debe coincidir con los tamaños de la textura y el array.
fr: **grid_** (*tuple*): Un tuple `(grid_y, grid_x)` représentant les dimensions de la grille, par exemple `(25, 25)`. Définit la division de l'image pour le traitement GPU et doit correspondre aux tailles de la texture et du tableau.

source: **block_** (*tuple*): A tuple `(block_y, block_x)` representing block dimensions, e.g., `(32, 32)`. Determines the number of threads per block in GPU processing. The product `block_x * block_y` must not exceed 1024 (the CUDA limit for threads per block).
es: **block_** (*tuple*): Una tupla `(block_y, block_x)` que representa las dimensiones del bloque, por ejemplo, `(32, 32)`. Determina el número de hilos por bloque en el procesamiento en GPU. El producto `block_x * block_y` no debe exceder 1024 (el límite de CUDA para hilos por bloque).
fr: **block_** (*tuple*): Un tuple `(block_y, block_x)` représentant les dimensions du bloc, par exemple `(32, 32)`. Détermine le nombre de threads par bloc dans le traitement GPU. Le produit `block_x * block_y` ne doit pas dépasser 1024 (la limite CUDA pour les threads par bloc).

source: **zoom** (*float*, optional, default=`0.999`): A zoom factor controlling the image scale after processing. Must be in the range `(0.0, 1.0)`. Default is `1.0` (no zoom).
es: **zoom** (*float*, opcional, predeterminado=`0.999`): Un factor de zoom que controla la escala de la imagen después del procesamiento. Debe estar en el rango `(0.0, 1.0)`. El valor predeterminado es `1.0` (sin zoom).
fr: **zoom** (*float*, optionnel, défaut=`0.999`): Un facteur de zoom contrôlant l'échelle de l'image après traitement. Doit être dans la plage `(0.0, 1.0)`. La valeur par défaut est `1.0` (aucun zoom).

source: **fx** (*float*, optional, default=`0.05`): Intensity of the chromatic effect, controlling the color separation strength. Must be within the range `[0.0, 0.2]`. Default is `0.05`.
es: **fx** (*float*, opcional, predeterminado=`0.05`): Intensidad del efecto cromático, controlando la fuerza de la separación de colores. Debe estar dentro del rango `[0.0, 0.2]`. El valor predeterminado es `0.05`.
fr: **fx** (*float*, optionnel, défaut=`0.05`): Intensité de l'effet chromatique, contrôlant la force de séparation des couleurs. Doit être dans la plage `[0.0, 0.2]`. La valeur par défaut est `0.05`.

source: (*cupy.ndarray*): A CuPy array representing the processed image with the chromatic displacement effect applied. The output format is a 24-bit image.
es: (*cupy.ndarray*): Un array de CuPy que representa la imagen procesada con el efecto de desplazamiento cromático aplicado. El formato de salida es una imagen de 24 bits.
fr: (*cupy.ndarray*): Un tableau CuPy représentant l'image traitée avec l'effet de déplacement chromatique appliqué. Le format de sortie est une image 24 bits.

source: **ValueError**: If `surface_` has zero width or height.
es: **ValueError**: Si `surface_` tiene ancho o altura cero.
fr: **ValueError** : Si `surface_` a une largeur ou une hauteur de zéro.

source: **ValueError**: If `delta_x` or `delta_y` is negative.
es: **ValueError**: Si `delta_x` o `delta_y` son negativos.
fr: **ValueError** : Si `delta_x` ou `delta_y` est négatif.

source: The function leverages GPU acceleration for efficient chromatic displacement.
es: La función aprovecha la aceleración por GPU para un desplazamiento cromático eficiente.
fr: La fonction exploite l'accélération GPU pour un déplacement chromatique efficace.

source: Ensure that the grid and block sizes are chosen appropriately for the image size and GPU capabilities.
es: Asegúrese de que los tamaños de la cuadrícula y el bloque se elijan adecuadamente según el tamaño de la imagen y las capacidades de la GPU.
fr: Assurez-vous que les tailles de grille et de bloc sont choisies de manière appropriée en fonction de la taille de l'image et des capacités du GPU.

source: The `fx` parameter controls the strength of the chromatic separation effect, and `zoom` allows for resizing after the transformation.
es: El parámetro `fx` controla la fuerza del efecto de separación cromática, y `zoom` permite redimensionar después de la transformación.
fr: Le paramètre `fx` contrôle l'intensité de l'effet de séparation chromatique, et `zoom` permet de redimensionner l'image après la transformation.

source: Apply an RGB split effect to an image using GPU acceleration.
es: Aplica un efecto de división RGB a una imagen utilizando aceleración por GPU.
fr: Applique un effet de séparation des canaux RGB à une image en utilisant l'accélération GPU.

source: This function shifts the red, green, and blue channels of an image by `delta_x` and `delta_y` to create a chromatic aberration (glitch) effect. The transformation is performed entirely on the GPU using CuPy.
es: Esta función desplaza los canales rojo, verde y azul de una imagen en `delta_x` y `delta_y` para crear un efecto de aberración cromática (glitch). La transformación se realiza completamente en la GPU utilizando CuPy.
fr: Cette fonction décale les canaux rouge, vert et bleu d'une image selon `delta_x` et `delta_y` pour créer un effet d'aberration chromatique (glitch). La transformation est entièrement réalisée sur le GPU à l'aide de CuPy.

source: **surface_** (*pygame.Surface*): The input image in a 24-bit or 32-bit format.
es: **surface_** (*pygame.Surface*): La imagen de entrada en formato de 24 o 32 bits.
fr: **surface_** (*pygame.Surface*): L'image d'entrée au format 24 bits ou 32 bits.

source: **delta_x** (*float*): The horizontal shift applied to the RGB channels. A positive value shifts the channels to the right, and a negative value shifts them to the left.
es: **delta_x** (*float*): El desplazamiento horizontal aplicado a los canales RGB. Un valor positivo desplaza los canales a la derecha, y un valor negativo los desplaza a la izquierda.
fr: **delta_x** (*float*): Le décalage horizontal appliqué aux canaux RGB. Une valeur positive déplace les canaux vers la droite, et une valeur négative les déplace vers la gauche.

source: **delta_y** (*float*): The vertical shift applied to the RGB channels. A positive value shifts the channels down, and a negative value shifts them up.
es: **delta_y** (*float*): El desplazamiento vertical aplicado a los canales RGB. Un valor positivo desplaza los canales hacia abajo, y un valor negativo los desplaza hacia arriba.
fr: **delta_y** (*float*): Le décalage vertical appliqué aux canaux RGB. Une valeur positive déplace les canaux vers le bas, et une valeur négative les déplace vers le haut.

source: **grid_** (*tuple*): A tuple `(grid_y, grid_x)` representing the grid size for CUDA execution, defining the distribution of computation across the GPU.
es: **grid_** (*tuple*): Una tupla `(grid_y, grid_x)` que representa el tamaño de la cuadrícula para la ejecución en CUDA, definiendo la distribución del cálculo en la GPU.
fr: **grid_** (*tuple*): Un tuple `(grid_y, grid_x)` représentant la taille de la grille pour l'exécution CUDA, définissant la distribution des calculs sur le GPU.

source: **block_** (*tuple*): A tuple `(block_y, block_x)` representing the block size, which determines the number of threads per block in GPU execution.
es: **block_** (*tuple*): Una tupla `(block_y, block_x)` que representa el tamaño del bloque, que determina el número de hilos por bloque en la ejecución en GPU.
fr: **block_** (*tuple*): Un tuple `(block_y, block_x)` représentant la taille du bloc, qui détermine le nombre de threads par bloc dans l'exécution sur GPU.

source: (*pygame.Surface*): A new surface with the RGB split effect applied.
es: (*pygame.Surface*): Una nueva superficie con el efecto de división RGB aplicado.
fr: (*pygame.Surface*): Une nouvelle surface avec l'effet de séparation RGB appliqué.

source: **ValueError**: If `delta_x` or `delta_y` are non-positive values or if the function cannot access the pixel data from `surface_`.
es: **ValueError**: Si `delta_x` o `delta_y` son valores no positivos o si la función no puede acceder a los datos de píxeles de `surface_`.
fr: **ValueError** : Si `delta_x` ou `delta_y` sont des valeurs non positives ou si la fonction ne peut pas accéder aux données des pixels de `surface_`.

source: The RGB split effect creates a chromatic distortion, commonly used in glitch effects.
es: El efecto de división RGB crea una distorsión cromática, comúnmente utilizada en efectos de glitch.
fr: L'effet de séparation RGB crée une distorsion chromatique, couramment utilisé pour les effets de glitch.

source: `delta_x` and `delta_y` define how far the color channels are shifted.
es: `delta_x` y `delta_y` definen cuánto se desplazan los canales de color.
fr: `delta_x` et `delta_y` définissent de combien les canaux de couleur sont décalés.

source: Ensure `grid_` and `block_` values are optimized for GPU execution.
es: Asegúrese de que los valores de `grid_` y `block_` estén optimizados para la ejecución en GPU.
fr: Assurez-vous que les valeurs `grid_` et `block_` sont optimisées pour l'exécution sur GPU.

source: Applies a zoom effect using GPU acceleration.
es: Aplica un efecto de zoom utilizando aceleración por GPU.
fr: Applique un effet de zoom en utilisant l'accélération GPU.

source: This function processes a `pygame.Surface` by mapping its pixel data to GPU memory and applying a zoom transformation. It utilizes CUDA acceleration for high-performance image processing.
es: Esta función procesa un `pygame.Surface` mapeando sus datos de píxeles a la memoria de la GPU y aplicando una transformación de zoom. Utiliza aceleración CUDA para un procesamiento de imágenes de alto rendimiento.
fr: Cette fonction traite une `pygame.Surface` en mappant ses données de pixels vers la mémoire GPU et en appliquant une transformation de zoom. Elle utilise l'accélération CUDA pour un traitement d'image haute performance.

source: **surface_** (*pygame.Surface*): The input surface to be processed. Must be a 24-bit or 32-bit format image.
es: **surface_** (*pygame.Surface*): La superficie de entrada a procesar. Debe ser una imagen en formato de 24 o 32 bits.
fr: **surface_** (*pygame.Surface*): La surface d'entrée à traiter. Elle doit être une image au format 24 bits ou 32 bits.

source: **centre_x** (*unsigned int*): The x-coordinate of the zoom center. Must be greater than or equal to 0.
es: **centre_x** (*unsigned int*): La coordenada X del centro del zoom. Debe ser mayor o igual a 0.
fr: **centre_x** (*unsigned int*): La coordonnée x du centre du zoom. Doit être supérieure ou égale à 0.

source: **centre_y** (*unsigned int*): The y-coordinate of the zoom center. Must be greater than or equal to 0.
es: **centre_y** (*unsigned int*): La coordenada Y del centro del zoom. Debe ser mayor o igual a 0.
fr: **centre_y** (*unsigned int*): La coordonnée y du centre du zoom. Doit être supérieure ou égale à 0.

source: **grid_** (*tuple*): A tuple `(grid_y, grid_x)` representing the grid dimensions. Defines the division of the image for parallel GPU processing. The values must match the texture and array sizes.
es: **grid_** (*tuple*): Una tupla `(grid_y, grid_x)` que representa las dimensiones de la cuadrícula. Define la división de la imagen para el procesamiento paralelo en GPU. Los valores deben coincidir con los tamaños de la textura y el array.
fr: **grid_** (*tuple*): Un tuple `(grid_y, grid_x)` représentant les dimensions de la grille. Définit la division de l'image pour le traitement parallèle sur GPU. Les valeurs doivent correspondre aux tailles de texture et de tableau.

source: **block_** (*tuple*): A tuple `(block_y, block_x)` representing the block dimensions. Determines the number of threads per block in GPU execution. The product `block_x * block_y` must not exceed `1024` (CUDA limit).
es: **block_** (*tuple*): Una tupla `(block_y, block_x)` que representa las dimensiones del bloque. Determina el número de hilos por bloque en la ejecución en GPU. El producto `block_x * block_y` no debe exceder `1024` (límite de CUDA).
fr: **block_** (*tuple*): Un tuple `(block_y, block_x)` représentant les dimensions du bloc. Détermine le nombre de threads par bloc dans l'exécution sur GPU. Le produit `block_x * block_y` ne doit pas dépasser `1024` (limite CUDA).

source: **zoom** (*float*, optional): A zoom factor controlling the scaling of the image. Must be within the range `(0.0, 1.0]`. Default is `1.0` (no scaling).
es: **zoom** (*float*, opcional): Un factor de zoom que controla la escala de la imagen. Debe estar dentro del rango `(0.0, 1.0]`. El valor predeterminado es `1.0` (sin escalado).
fr: **zoom** (*float*, optionnel) : Un facteur de zoom contrôlant l'échelle de l'image. Doit être dans la plage `(0.0, 1.0]`. Par défaut, `1.0` (pas de mise à l'échelle).

source: (*CuPy ndarray*): A CuPy array containing the transformed image with zoom applied, in 24-bit format.
es: (*CuPy ndarray*): Un array de CuPy que contiene la imagen transformada con el zoom aplicado, en formato de 24 bits.
fr: (*CuPy ndarray*): Un tableau CuPy contenant l'image transformée avec le zoom appliqué, en format 24 bits.
