Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: **sigma_s**: Spatial extent of the kernel. It defines the size of the neighborhood around each pixel that influences the filter's operation.
es: **sigma_s**: Extensión espacial del kernel. Define el tamaño del vecindario alrededor de cada píxel que influye en la operación del filtro.
fr: **sigma_s** : Étendue spatiale du noyau. Il définit la taille du voisinage autour de chaque pixel qui influence l'opération du filtre.

source: **sigma_i**: Intensity range kernel. This controls how sensitive the filter is to intensity differences. A smaller value of `sigma_i` preserves edges more effectively, while a larger value allows for more uniform blurring.
es: **sigma_i**: Rango de intensidad del kernel. Controla cuán sensible es el filtro a las diferencias de intensidad. Un valor más pequeño de `sigma_i` preserva los bordes de manera más efectiva, mientras que un valor más grande permite un desenfoque más uniforme.
fr: **sigma_i** : Noyau de gamme d'intensité. Il contrôle la sensibilité du filtre aux différences d'intensité. Une valeur plus petite de `sigma_i` préserve mieux les contours, tandis qu'une valeur plus grande permet un flou plus uniforme.

source: As `sigma_i` increases, the filter approaches a Gaussian blur (which is applied uniformly across the image). A smaller value of `sigma_i` retains more local detail by reducing the contribution of pixels with different intensities.
es: A medida que `sigma_i` aumenta, el filtro se aproxima a un desenfoque gaussiano (que se aplica uniformemente en toda la imagen). Un valor más pequeño de `sigma_i` retiene más detalles locales al reducir la contribución de píxeles con intensidades diferentes.
fr: À mesure que `sigma_i` augmente, le filtre se rapproche d'un flou gaussien (qui est appliqué uniformément sur l'image). Une valeur plus petite de `sigma_i` conserve plus de détails locaux en réduisant la contribution des pixels avec des intensités différentes.

source: `image` (pygame.Surface): The surface (image) to which the bilateral filter will be applied. The image must be in 24-32 bit RGB format, and the alpha channel will be ignored. The image is converted into a 3D array for processing.
es: `image` (pygame.Surface): La superficie (imagen) a la que se aplicará el filtro bilateral. La imagen debe estar en formato RGB de 24-32 bits, y el canal alfa se ignorará. La imagen se convierte en un array 3D para su procesamiento.
fr: `image` (pygame.Surface) : La surface (image) à laquelle le filtrage bilatéral sera appliqué. L'image doit être au format RGB 24-32 bits, et le canal alpha sera ignoré. L'image est convertie en un tableau 3D pour le traitement.

source: `sigma_s` (float): The spatial extent of the kernel. This parameter controls the size of the neighborhood used to compute the weighted average.
es: `sigma_s` (float): La extensión espacial del kernel. Este parámetro controla el tamaño del vecindario utilizado para calcular el promedio ponderado.
fr: `sigma_s` (float) : L'étendue spatiale du noyau. Ce paramètre contrôle la taille du voisinage utilisé pour calculer la moyenne pondérée.

source: `sigma_i` (float): Intensity sensitivity. Defines the maximum intensity difference that contributes to the blur. Smaller values will preserve edges.
es: `sigma_i` (float): Sensibilidad de intensidad. Define la diferencia máxima de intensidad que contribuye al desenfoque. Valores más pequeños preservarán los bordes.
fr: `sigma_i` (float) : Sensibilité à l'intensité. Définit la différence d'intensité maximale qui contribue au flou. Des valeurs plus petites préserveront les bords.

source: `kernel_size` (int, optional): The size of the kernel (default is 3). This controls how far the filter reaches from each pixel.
es: `kernel_size` (int, opcional): El tamaño del kernel (el valor predeterminado es 3). Esto controla qué tan lejos llega el filtro desde cada píxel.
fr: `kernel_size` (int, optionnel) : La taille du noyau (la valeur par défaut est 3). Ce paramètre contrôle jusqu'où le filtre s'étend à partir de chaque pixel.

source: `pygame.Surface`: A new Pygame surface with the bilateral filter applied.
es: `pygame.Surface`: Una nueva superficie de Pygame con el filtro bilateral aplicado.
fr: `pygame.Surface` : Une nouvelle surface Pygame avec le filtre bilatéral appliqué.

source: Apply an emboss filter to an image or surface, producing an embossed effect.
es: Aplicar un filtro de relieve a una imagen o superficie, produciendo un efecto de relieve.
fr: Appliquer un filtre d'estampillage à une image ou une surface, produisant un effet d'estampillage.

source: The embossing filter creates a visual effect that makes the image appear raised, similar to a paper or metal embossing of the original image, which can be used to highlight edges or create artistic effects.
es: El filtro de relieve crea un efecto visual que hace que la imagen parezca elevada, similar a un relieve en papel o metal de la imagen original, lo que puede usarse para resaltar bordes o crear efectos artísticos.
fr: Le filtre d'estampillage crée un effet visuel qui fait apparaître l'image comme étant en relief, similaire à un estampillage sur papier ou métal de l'image originale, ce qui peut être utilisé pour mettre en valeur les bords ou créer des effets artistiques.

source: `surface_` (pygame.Surface): A Pygame surface compatible with 24-bit or 32-bit image formats.
es: `surface_` (pygame.Surface): Una superficie de Pygame compatible con formatos de imagen de 24 o 32 bits.
fr: `surface_` (pygame.Surface) : Une surface Pygame compatible avec les formats d'image 24 bits ou 32 bits.

source: `flag_` (int, optional): A special Pygame blend flag (default is 0). This flag can be one of the blend modes such as `BLEND_RGB_ADD`, `BLEND_RGB_MULT`, etc. It modifies the image blending behavior and will affect the final output.
es: `flag_` (int, opcional): Una bandera especial de mezcla de Pygame (el valor predeterminado es 0). Esta bandera puede ser uno de los modos de mezcla como `BLEND_RGB_ADD`, `BLEND_RGB_MULT`, etc. Modifica el comportamiento de mezcla de la imagen y afectará el resultado final.
fr: `flag_` (int, optionnel) : Un drapeau de fusion spécial Pygame (la valeur par défaut est 0). Ce drapeau peut être l'un des modes de fusion tels que `BLEND_RGB_ADD`, `BLEND_RGB_MULT`, etc. Il modifie le comportement de fusion de l'image et affectera le résultat final.

source: `pygame.Surface`: A surface containing the embossed image. If `flag_` is set to 0, the output is a 24-bit format; otherwise, a 32-bit format is returned.
es: `pygame.Surface`: Una superficie que contiene la imagen en relieve. Si `flag_` se establece en 0, la salida es un formato de 24 bits; de lo contrario, se devuelve un formato de 32 bits.
fr: `pygame.Surface` : Une surface contenant l'image estampillée. Si `flag_` est réglé sur 0, le résultat est au format 24 bits ; sinon, un format 32 bits est retourné.

source: Emboss a surface (inplace)
es: Relieve de una superficie (in situ)
fr: Estampiller une surface (en place)

source: This function applies an embossing filter to an image in-place, meaning the image itself is modified rather than creating a new image. The embossing effect produces a raised, textured effect, similar to paper or metal embossing. It can highlight edges and create artistic effects in the image.
es: Esta función aplica un filtro de relieve a una imagen in situ, lo que significa que la imagen en sí se modifica en lugar de crear una nueva imagen. El efecto de relieve produce un efecto elevado y texturizado, similar a un relieve en papel o metal. Puede resaltar bordes y crear efectos artísticos en la imagen.
fr: Cette fonction applique un filtre d'estampillage à une image en place, ce qui signifie que l'image elle-même est modifiée plutôt que de créer une nouvelle image. L'effet d'estampillage produit un effet de relief, semblable à un estampillage sur papier ou métal. Il peut mettre en valeur les bords et créer des effets artistiques dans l'image.

source: `surface_` (pygame.Surface): A Pygame surface that will be embossed. The surface will be modified in place once the process is complete.
es: `surface_` (pygame.Surface): Una superficie de Pygame que se someterá al efecto de relieve. La superficie se modificará in situ una vez que se complete el proceso.
fr: `surface_` (pygame.Surface) : Une surface Pygame qui sera estampillée. La surface sera modifiée en place une fois le processus terminé.

source: `copy` (numpy.ndarray, optional): A numpy array with shape `(w, h, 3)` of type `uint8` containing the RGB pixels. It must be the same size as the input surface. This array is used as a copy of the source array to slightly improve performance.
es: `copy` (numpy.ndarray, opcional): Un array de numpy con forma `(w, h, 3)` de tipo `uint8` que contiene los píxeles RGB. Debe tener el mismo tamaño que la superficie de entrada. Este array se utiliza como una copia del array de origen para mejorar ligeramente el rendimiento.
fr: `copy` (numpy.ndarray, optionnel) : Un tableau numpy de forme `(w, h, 3)` de type `uint8` contenant les pixels RGB. Il doit avoir la même taille que la surface d'entrée. Ce tableau est utilisé comme une copie du tableau source pour améliorer légèrement les performances.

source: `void`: The surface is modified in place and no new surface is returned.
es: `void`: La superficie se modifica in situ y no se devuelve una nueva superficie.
fr: `void` : La surface est modifiée en place et aucune nouvelle surface n'est retournée.

source: Emboss directly a C-buffer type (inplace)
es: Relieve directo de un tipo C-buffer (in situ)
fr: Estampiller directement un type C-buffer (en place)

source: This function applies an embossing filter to an image in-place, directly modifying the provided C-buffer array (`bgr_array`). The embossing effect produces a raised texture, similar to paper or metal embossing, making edges more prominent and creating artistic effects.
es: Esta función aplica un filtro de relieve a una imagen in situ, modificando directamente el array C-buffer proporcionado (`bgr_array`). El efecto de relieve produce una textura elevada, similar a un relieve en papel o metal, haciendo que los bordes sean más prominentes y creando efectos artísticos.
fr: Cette fonction applique un filtre d'estampillage à une image en place, en modifiant directement le tableau C-buffer fourni (`bgr_array`). L'effet d'estampillage produit une texture en relief, semblable à un estampillage sur papier ou métal, rendant les bords plus prononcés et créant des effets artistiques.

source: If the `tmp_array` is provided, it is used to improve performance, but it must have the same shape and size as the source array (`bgr_array`).
es: Si se proporciona `tmp_array`, se utiliza para mejorar el rendimiento, pero debe tener la misma forma y tamaño que el array de origen (`bgr_array`).
fr: Si le `tmp_array` est fourni, il est utilisé pour améliorer les performances, mais il doit avoir la même forme et la même taille que le tableau source (`bgr_array`).

source: `w` (int): The width of the surface (image).
es: `w` (int): El ancho de la superficie (imagen).
fr: `w` (int) : La largeur de la surface (image).

source: `h` (int): The height of the surface (image).
es: `h` (int): La altura de la superficie (imagen).
fr: `h` (int) : La hauteur de la surface (image).

source: `bgr_array` (numpy.ndarray or memoryviewslice): A 1D array of type `uint8` containing BGR pixel data or any other pixel format. This array represents the source data that will be modified in place.
es: `bgr_array` (numpy.ndarray o memoryviewslice): Un array 1D de tipo `uint8` que contiene datos de píxeles BGR o cualquier otro formato de píxel. Este array representa los datos de origen que se modificarán in situ.
fr: `bgr_array` (numpy.ndarray ou memoryviewslice) : Un tableau 1D de type `uint8` contenant des données de pixels BGR ou tout autre format de pixels. Ce tableau représente les données source qui seront modifiées en place.

source: `tmp_array` (numpy.ndarray or memoryviewslice, optional): A 1D array of type `uint8` containing BGR pixel data or any other pixel format. This array should be a copy of the source array to improve performance.
es: `tmp_array` (numpy.ndarray o memoryviewslice, opcional): Un array 1D de tipo `uint8` que contiene datos de píxeles BGR o cualquier otro formato de píxel. Este array debe ser una copia del array de origen para mejorar el rendimiento.
fr: `tmp_array` (numpy.ndarray ou memoryviewslice, optionnel) : Un tableau 1D de type `uint8` contenant des données de pixels BGR ou tout autre format de pixels. Ce tableau doit être une copie du tableau source pour améliorer les performances.

source: `format_32` (bool, default is False): Set to `True` if the source array contains alpha transparency (32-bit format).
es: `format_32` (bool, predeterminado es False): Establece `True` si el array de origen contiene transparencia alfa (formato de 32 bits).
fr: `format_32` (bool, par défaut False) : Défini sur `True` si le tableau source contient une transparence alpha (format 32 bits).

source: `void`: The function modifies the `bgr_array` in place and does not return a new array.
es: `void`: La función modifica `bgr_array` in situ y no devuelve un nuevo array.
fr: `void` : La fonction modifie le `bgr_array` en place et ne retourne pas un nouveau tableau.

source: Apply a gray-scale embossing filter to an image or surface and return a modified copy.
es: Aplicar un filtro de relieve en escala de grises a una imagen o superficie y devolver una copia modificada.
fr: Appliquer un filtre d'estampillage en niveaux de gris à une image ou surface et retourner une copie modifiée.

source: This function applies an embossing effect to the given image or surface in grayscale. The embossing effect creates a raised texture that mimics paper or metal embossing. The result is a stylized effect where edges and contours are emphasized, but in a monochromatic grayscale palette.
es: Esta función aplica un efecto de relieve a la imagen o superficie dada en escala de grises. El efecto de relieve crea una textura elevada que imita un relieve en papel o metal. El resultado es un efecto estilizado donde los bordes y contornos se enfatizan, pero en una paleta monocromática de escala de grises.
fr: Cette fonction applique un effet d'estampillage à l'image ou la surface donnée en niveaux de gris. L'effet d'estampillage crée une texture en relief qui imite un estampillage sur papier ou métal. Le résultat est un effet stylisé où les bords et les contours sont accentués, mais dans une palette monochromatique en niveaux de gris.

source: `surface_` (pygame.Surface): The input surface (image) to which the gray-scale emboss effect will be applied. This surface must be compatible with 24-bit or 32-bit formats.
es: `surface_` (pygame.Surface): La superficie de entrada (imagen) a la que se aplicará el efecto de relieve en escala de grises. Esta superficie debe ser compatible con formatos de 24 o 32 bits.
fr: `surface_` (pygame.Surface) : La surface d'entrée (image) sur laquelle l'effet d'estampillage en niveaux de gris sera appliqué. Cette surface doit être compatible avec les formats 24 bits ou 32 bits.

source: `pygame.Surface`: A new Pygame surface with the gray-scale embossed image. The resulting image is always in 24-bit format.
es: `pygame.Surface`: Una nueva superficie de Pygame con la imagen en relieve en escala de grises. La imagen resultante siempre está en formato de 24 bits.
fr: `pygame.Surface` : Une nouvelle surface Pygame avec l'image estampillée en niveaux de gris. L'image résultante est toujours en format 24 bits.

source: Resize an image using the bilinear filter algorithm (returns a copy).
es: Redimensionar una imagen utilizando el algoritmo de filtro bilineal (devuelve una copia).
fr: Redimensionner une image en utilisant l'algorithme de filtre bilinéaire (retourne une copie).

source: This function applies the bilinear filter to resize an image. Bilinear filtering smooths the image and is commonly used in image resizing tasks. The function supports 32-bit input images, but the result is always returned in 24-bit format (without the alpha channel).
es: Esta función aplica el filtro bilineal para redimensionar una imagen. El filtrado bilineal suaviza la imagen y se usa comúnmente en tareas de redimensionamiento de imágenes. La función admite imágenes de entrada de 32 bits, pero el resultado siempre se devuelve en formato de 24 bits (sin el canal alfa).
fr: Cette fonction applique le filtre bilinéaire pour redimensionner une image. Le filtrage bilinéaire lisse l'image et est couramment utilisé dans les tâches de redimensionnement d'images. La fonction prend en charge les images d'entrée en 32 bits, mais le résultat est toujours retourné en format 24 bits (sans le canal alpha).

source: `surface_` (pygame.Surface): The input surface (image) to be resized. It must be compatible with 24-bit or 32-bit formats.
es: `surface_` (pygame.Surface): La superficie de entrada (imagen) que se redimensionará. Debe ser compatible con formatos de 24 o 32 bits.
fr: `surface_` (pygame.Surface) : La surface d'entrée (image) à redimensionner. Elle doit être compatible avec les formats 24 bits ou 32 bits.

source: `size_` (tuple): A tuple `(width, height)` specifying the new dimensions for the resized surface.
es: `size_` (tuple): Una tupla `(ancho, alto)` que especifica las nuevas dimensiones para la superficie redimensionada.
fr: `size_` (tuple) : Un tuple `(largeur, hauteur)` spécifiant les nouvelles dimensions de la surface redimensionnée.

source: `fx` (float, optional): A scaling factor for the x-axis (width). If provided, it will override the width specified in `size_`. Default is None.
es: `fx` (float, opcional): Un factor de escala para el eje x (ancho). Si se proporciona, anulará el ancho especificado en `size_`. El valor predeterminado es None.
fr: `fx` (float, optionnel) : Un facteur d'échelle pour l'axe x (largeur). Si fourni, il remplacera la largeur spécifiée dans `size_`. La valeur par défaut est None.

source: `fy` (float, optional): A scaling factor for the y-axis (height). If provided, it will override the height specified in `size_`. Default is None.
es: `fy` (float, opcional): Un factor de escala para el eje y (altura). Si se proporciona, anulará la altura especificada en `size_`. El valor predeterminado es None.
fr: `fy` (float, optionnel) : Un facteur d'échelle pour l'axe y (hauteur). Si fourni, il remplacera la hauteur spécifiée dans `size_`. La valeur par défaut est None.

source: `pygame.Surface`: A new Pygame surface of type 24-bit (without the alpha channel), resized based on the input parameters.
es: `pygame.Surface`: Una nueva superficie de Pygame de tipo 24 bits (sin el canal alfa), redimensionada según los parámetros de entrada.
fr: `pygame.Surface` : Une nouvelle surface Pygame de type 24 bits (sans le canal alpha), redimensionnée en fonction des paramètres d'entrée.

source: 24-bit Tunnel modeling This method will produce 24-bit rendering data to simulate a tunnel effect.
es: Modelado de túnel de 24 bits Este método producirá datos de renderizado de 24 bits para simular un efecto de túnel.
fr: Modélisation de tunnel en 24 bits : Cette méthode produira des données de rendu 24 bits pour simuler un effet de tunnel.

source: The algorithm uses a 256x256 texture but reshapes it to 512x512 pixels for better rendering. It generates a tunnel effect by manipulating distances, angles, shades, and rendering data.
es: El algoritmo utiliza una textura de 256x256 pero la redimensiona a 512x512 píxeles para una mejor renderización. Genera un efecto de túnel manipulando distancias, ángulos, sombras y datos de renderizado.
fr: L'algorithme utilise une texture 256x256, mais la redimensionne à 512x512 pixels pour un meilleur rendu. Il génère un effet de tunnel en manipulant les distances, les angles, les ombres et les données de rendu.

source: `screen_width` (int): The width of the display or the width of the tunnel effect.
es: `screen_width` (int): El ancho de la pantalla o el ancho del efecto de túnel.
fr: `screen_width` (int) : La largeur de l'affichage ou la largeur de l'effet de tunnel.

source: `screen_height` (int): The height of the display or the height of the tunnel effect.
es: `screen_height` (int): La altura de la pantalla o la altura del efecto de túnel.
fr: `screen_height` (int) : La hauteur de l'affichage ou la hauteur de l'effet de tunnel.

source: `surface_` (pygame.Surface): The tunnel texture effect, compatible with 24-bit or 32-bit formats.
es: `surface_` (pygame.Surface): El efecto de textura del túnel, compatible con formatos de 24 o 32 bits.
fr: `surface_` (pygame.Surface) : L'effet de texture du tunnel, compatible avec les formats 24 bits ou 32 bits.

source: `tuple`: A tuple containing four buffers: - `distances`: Buffer containing distance data. - `angles`: Buffer containing angle data. - `shades`: Buffer containing shading data. - `scr_data`: Buffer containing the screen rendering data.
es: `tuple`: Una tupla que contiene cuatro buffers: - `distances`: Buffer que contiene datos de distancia. - `angles`: Buffer que contiene datos de ángulo. - `shades`: Buffer que contiene datos de sombreado. - `scr_data`: Buffer que contiene los datos de renderizado de la pantalla.
fr: `tuple` : Un tuple contenant quatre tampons : - `distances` : Tampon contenant les données de distance. - `angles` : Tampon contenant les données d'angle. - `shades` : Tampon contenant les données d'ombrage. - `scr_data` : Tampon contenant les données de rendu de l'écran.

source: Tunnel effect rendering
es: Renderizado del efecto de túnel
fr: Rendu de l'effet de tunnel

source: This function renders the tunnel effect based on pre-calculated data, creating a 24-bit output surface.
es: Esta función renderiza el efecto de túnel basado en datos precalculados, creando una superficie de salida de 24 bits.
fr: Cette fonction rend l'effet de tunnel basé sur des données pré-calculées, créant une surface de sortie en 24 bits.

source: `t` (int): Timer or frame count. Controls the speed of the tunnel effect.
es: `t` (int): Temporizador o conteo de fotogramas. Controla la velocidad del efecto de túnel.
fr: `t` (int) : Chronomètre ou nombre d'images. Contrôle la vitesse de l'effet de tunnel.

source: `screen_width` (int): The width of the display or tunnel effect.
es: `screen_width` (int): El ancho de la pantalla o del efecto de túnel.
fr: `screen_width` (int) : La largeur de l'affichage ou de l'effet de tunnel.

source: `screen_height` (int): The height of the display or tunnel effect.
es: `screen_height` (int): La altura de la pantalla o del efecto de túnel.
fr: `screen_height` (int) : La hauteur de l'affichage ou de l'effet de tunnel.

source: `screen_w2` (int): The screen width divided by 2.
es: `screen_w2` (int): El ancho de la pantalla dividido por 2.
fr: `screen_w2` (int) : La largeur de l'écran divisée par 2.

source: `screen_h2` (int): The screen height divided by 2.
es: `screen_h2` (int): La altura de la pantalla dividido por 2.
fr: `screen_h2` (int) : La hauteur de l'écran divisée par 2.

source: `distances` (numpy.ndarray): A 1D C-buffer containing the distances. This buffer is obtained from the `tunnel_modeling24` function.
es: `distances` (numpy.ndarray): Un buffer C 1D que contiene las distancias. Este buffer se obtiene de la función `tunnel_modeling24`.
fr: `distances` (numpy.ndarray) : Un tampon C 1D contenant les distances. Ce tampon est obtenu à partir de la fonction `tunnel_modeling24`.
