Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader_gpu.po
Languages: es, fr

source: **ValueError**: - If the width or height of `surface_` is 0. - If `zoom` is not within the range `(0.0, 1.0]`. - If `centre_x` or `centre_y` is negative. - If `surface_` cannot be mapped to a 3D array.
es: **ValueError**: - Si el ancho o la altura de `surface_` es 0. - Si `zoom` no está dentro del rango `(0.0, 1.0]`. - Si `centre_x` o `centre_y` es negativo. - Si `surface_` no puede mapearse a un array 3D.
fr: **ValueError** : - Si la largeur ou la hauteur de `surface_` est 0. - Si `zoom` n'est pas dans la plage `(0.0, 1.0]`. - Si `centre_x` ou `centre_y` est négatif. - Si `surface_` ne peut pas être mappée vers un tableau 3D.

source: This function performs the zoom effect by mapping pixel data to GPU memory and using CUDA for high-performance processing.
es: Esta función realiza el efecto de zoom mapeando los datos de píxeles a la memoria de la GPU y utilizando CUDA para un procesamiento de alto rendimiento.
fr: Cette fonction effectue l'effet de zoom en mappant les données de pixels vers la mémoire GPU et en utilisant CUDA pour un traitement haute performance.

source: Ensure `grid_` and `block_` are optimized for your GPU's capabilities and the image size.
es: Asegúrese de que `grid_` y `block_` estén optimizados para las capacidades de su GPU y el tamaño de la imagen.
fr: Assurez-vous que `grid_` et `block_` sont optimisés pour les capacités de votre GPU et la taille de l'image.

source: Apply a channel-specific color effect (redscale, greenscale, or bluescale) to an image.
es: Aplica un efecto de color específico del canal (escala de rojo, escala de verde o escala de azul) a una imagen.
fr: Applique un effet de couleur spécifique au canal (redscale, greenscale ou bluescale) à une image.

source: This function applies a redscale, greenscale, or bluescale effect to a given `pygame.Surface` image. It isolates and emphasizes one of the color channels (Red, Green, or Blue) depending on the provided `layer_` parameter. The operation is performed using GPU acceleration for better performance.
es: Esta función aplica un efecto de escala de rojo, escala de verde o escala de azul a una imagen `pygame.Surface` dada. Aísla y enfatiza uno de los canales de color (Rojo, Verde o Azul) según el parámetro `layer_` proporcionado. La operación se realiza utilizando aceleración por GPU para un mejor rendimiento.
fr: Cette fonction applique un effet redscale, greenscale ou bluescale à une image `pygame.Surface` donnée. Elle isole et met en valeur l'un des canaux de couleur (Rouge, Vert ou Bleu) en fonction du paramètre `layer_` fourni. L'opération est effectuée à l'aide de l'accélération GPU pour de meilleures performances.

source: **surface_** (*pygame.Surface*): The input image to which the effect will be applied.
es: **surface_** (*pygame.Surface*): La imagen de entrada a la que se aplicará el efecto.
fr: **surface_** (*pygame.Surface*): L'image d'entrée à laquelle l'effet sera appliqué.

source: **grid_** (*tuple*): A tuple `(grid_y, grid_x)` representing the grid configuration. The grid values should match the image and array sizes.
es: **grid_** (*tuple*): Una tupla `(grid_y, grid_x)` que representa la configuración de la cuadrícula. Los valores de la cuadrícula deben coincidir con los tamaños de la imagen y el array.
fr: **grid_** (*tuple*): Un tuple `(grid_y, grid_x)` représentant la configuration de la grille. Les valeurs de la grille doivent correspondre aux tailles de l'image et du tableau.

source: **block_** (*tuple*): A tuple `(block_y, block_x)` representing the block configuration. The block values determine how many threads are launched per block.
es: **block_** (*tuple*): Una tupla `(block_y, block_x)` que representa la configuración del bloque. Los valores del bloque determinan cuántos hilos se lanzan por bloque.
fr: **block_** (*tuple*): Un tuple `(block_y, block_x)` représentant la configuration du bloc. Les valeurs du bloc déterminent combien de threads sont lancés par bloc.

source: **layer_** (*unsigned short int*, optional): Specifies which color channel to isolate. The default is `0` (Red channel). The values are: - `0` for Red channel - `1` for Green channel - `2` for Blue channel
es: **layer_** (*unsigned short int*, opcional): Especifica qué canal de color aislar. El valor predeterminado es `0` (canal Rojo). Los valores son: - `0` para el canal Rojo - `1` para el canal Verde - `2` para el canal Azul
fr: **layer_** (*unsigned short int*, optionnel) : Spécifie quel canal de couleur isoler. La valeur par défaut est `0` (canal rouge). Les valeurs sont : - `0` pour le canal rouge - `1` pour le canal vert - `2` pour le canal bleu

source: (*pygame.Surface*): The image with the selected channel effect (redscale, greenscale, or bluescale) applied.
es: (*pygame.Surface*): La imagen con el efecto de canal seleccionado (escala de rojo, escala de verde o escala de azul) aplicado.
fr: (*pygame.Surface*): L'image avec l'effet de canal sélectionné (redscale, greenscale ou bluescale) appliqué.

source: **ValueError**: If the `layer_` value is not within the range of 0 to 2.
es: **ValueError**: Si el valor de `layer_` no está dentro del rango de 0 a 2.
fr: **ValueError** : Si la valeur `layer_` n'est pas dans la plage de 0 à 2.

source: This function uses GPU acceleration for high-performance image processing.
es: Esta función utiliza aceleración por GPU para un procesamiento de imágenes de alto rendimiento.
fr: Cette fonction utilise l'accélération GPU pour un traitement d'image haute performance.

source: The `layer_` parameter determines which color channel is emphasized.
es: El parámetro `layer_` determina qué canal de color se enfatiza.
fr: Le paramètre `layer_` détermine quel canal de couleur est mis en valeur.

source: The result is a new `pygame.Surface` with the selected color channel effect applied.
es: El resultado es un nuevo `pygame.Surface` con el efecto de canal de color seleccionado aplicado.
fr: Le résultat est une nouvelle `pygame.Surface` avec l'effet du canal de couleur sélectionné appliqué.

source: Apply a heatmap effect to an image with optional inversion.
es: Aplica un efecto de mapa de calor a una imagen con inversión opcional.
fr: Applique un effet de carte thermique à une image avec inversion optionnelle.

source: This function applies a heatmap effect to an image using GPU acceleration. The heatmap effect is typically used to visualize intensity or magnitude across a 2D surface. The effect can be inverted based on the `invert_` parameter, changing the color representation.
es: Esta función aplica un efecto de mapa de calor a una imagen utilizando aceleración por GPU. El efecto de mapa de calor se utiliza típicamente para visualizar la intensidad o magnitud en una superficie 2D. El efecto puede invertirse según el parámetro `invert_`, cambiando la representación del color.
fr: Cette fonction applique un effet de carte thermique à une image en utilisant l'accélération GPU. L'effet de carte thermique est généralement utilisé pour visualiser l'intensité ou la magnitude sur une surface 2D. L'effet peut être inversé en fonction du paramètre `invert_`, modifiant ainsi la représentation des couleurs.

source: **surface_** (*pygame.Surface*): The input image to which the heatmap effect will be applied.
es: **surface_** (*pygame.Surface*): La imagen de entrada a la que se aplicará el efecto de mapa de calor.
fr: **surface_** (*pygame.Surface*): L'image d'entrée sur laquelle l'effet de carte thermique sera appliqué.

source: **grid_** (*tuple*): A tuple `(grid_y, grid_x)` representing the grid configuration. The grid values should match the texture and array sizes for parallel execution on the GPU.
es: **grid_** (*tuple*): Una tupla `(grid_y, grid_x)` que representa la configuración de la cuadrícula. Los valores de la cuadrícula deben coincidir con los tamaños de la textura y el array para la ejecución paralela en la GPU.
fr: **grid_** (*tuple*): Un tuple `(grid_y, grid_x)` représentant la configuration de la grille. Les valeurs de la grille doivent correspondre aux tailles de texture et de tableau pour l'exécution parallèle sur le GPU.

source: **block_** (*tuple*): A tuple `(block_y, block_x)` representing the block configuration. It defines the number of threads per block for GPU execution. The product `block_x * block_y` must not exceed `1024` (CUDA's maximum threads per block).
es: **block_** (*tuple*): Una tupla `(block_y, block_x)` que representa la configuración del bloque. Define el número de hilos por bloque para la ejecución en GPU. El producto `block_x * block_y` no debe exceder `1024` (el máximo de hilos por bloque en CUDA).
fr: **block_** (*tuple*): Un tuple `(block_y, block_x)` représentant la configuration du bloc. Il définit le nombre de threads par bloc pour l'exécution sur le GPU. Le produit `block_x * block_y` ne doit pas dépasser `1024` (limite des threads par bloc de CUDA).

source: **invert_** (*boolean*, optional): If `True`, the color range of the heatmap is reversed (inverted). The default is `False`, meaning no inversion.
es: **invert_** (*boolean*, opcional): Si es `True`, el rango de colores del mapa de calor se invierte. El valor predeterminado es `False`, lo que significa que no hay inversión.
fr: **invert_** (*booléen*, optionnel) : Si `True`, la gamme de couleurs de la carte thermique est inversée (inversée). La valeur par défaut est `False`, ce qui signifie qu'il n'y a pas d'inversion.

source: (*pygame.Surface*): The image with the heatmap effect applied.
es: (*pygame.Surface*): La imagen con el efecto de mapa de calor aplicado.
fr: (*pygame.Surface*): L'image avec l'effet de carte thermique appliqué.

source: **ValueError**: If `invert_` is not a boolean.
es: **ValueError**: Si `invert_` no es un booleano.
fr: **ValueError** : Si `invert_` n'est pas un booléen.

source: The function uses GPU acceleration for high-performance image processing.
es: La función utiliza aceleración por GPU para un procesamiento de imágenes de alto rendimiento.
fr: La fonction utilise l'accélération GPU pour un traitement d'image haute performance.

source: The inversion of the heatmap allows for a different color representation.
es: La inversión del mapa de calor permite una representación de color diferente.
fr: L'inversion de la carte thermique permet une représentation des couleurs différente.

source: Apply heatmap effect in place to a pygame.Surface.
es: Aplica el efecto de mapa de calor en el lugar a un `pygame.Surface`.
fr: Applique l'effet de carte thermique directement à une pygame.Surface.

source: This function applies a heatmap effect to the input surface in place, modifying the pixel data directly without returning a new surface. The heatmap visualization enhances the intensity of the image based on a color mapping, with the option to invert the color effect.
es: Esta función aplica un efecto de mapa de calor a la superficie de entrada en el lugar, modificando los datos de píxeles directamente sin devolver una nueva superficie. La visualización del mapa de calor mejora la intensidad de la imagen basándose en un mapeo de colores, con la opción de invertir el efecto de color.
fr: Cette fonction applique un effet de carte thermique à la surface d'entrée, modifiant directement les données des pixels sans retourner une nouvelle surface. La visualisation de la carte thermique améliore l'intensité de l'image en fonction d'un mappage des couleurs, avec l'option d'inverser l'effet de couleur.

source: **surface_** (*pygame.Surface*): The surface on which the heatmap effect will be applied. The surface must be a valid `pygame.Surface` containing pixel data in a 3D array (RGB channels).
es: **surface_** (*pygame.Surface*): La superficie sobre la que se aplicará el efecto de mapa de calor. La superficie debe ser un `pygame.Surface` válido que contenga datos de píxeles en un array 3D (canales RGB).
fr: **surface_** (*pygame.Surface*): La surface sur laquelle l'effet de carte thermique sera appliqué. La surface doit être une `pygame.Surface` valide contenant des données de pixels dans un tableau 3D (canaux RGB).

source: **grid_** (*tuple*): A tuple `(grid_y, grid_x)` representing the grid configuration for parallel GPU execution. The grid values must match the array and texture sizes.
es: **grid_** (*tuple*): Una tupla `(grid_y, grid_x)` que representa la configuración de la cuadrícula para la ejecución paralela en GPU. Los valores de la cuadrícula deben coincidir con los tamaños del array y la textura.
fr: **grid_** (*tuple*): Un tuple `(grid_y, grid_x)` représentant la configuration de la grille pour l'exécution parallèle sur le GPU. Les valeurs de la grille doivent correspondre aux tailles du tableau et de la texture.

source: **block_** (*tuple*): A tuple `(block_y, block_x)` representing the block configuration. It defines the number of threads per block for GPU computation. The product `block_x * block_y` must not exceed `1024` (CUDA's maximum threads per block).
es: **block_** (*tuple*): Una tupla `(block_y, block_x)` que representa la configuración del bloque. Define el número de hilos por bloque para el cálculo en GPU. El producto `block_x * block_y` no debe exceder `1024` (el máximo de hilos por bloque en CUDA).
fr: **block_** (*tuple*): Un tuple `(block_y, block_x)` représentant la configuration du bloc. Il définit le nombre de threads par bloc pour le calcul sur le GPU. Le produit `block_x * block_y` ne doit pas dépasser `1024` (le nombre maximal de threads par bloc de CUDA).

source: **invert_** (*boolean*, optional): If `True`, the heatmap effect is inverted, reversing the color range. Default is `False` (no inversion).
es: **invert_** (*boolean*, opcional): Si es `True`, el efecto de mapa de calor se invierte, invirtiendo el rango de colores. El valor predeterminado es `False` (sin inversión).
fr: **invert_** (*booléen*, optionnel) : Si `True`, l'effet de carte thermique est inversé, inversant la gamme de couleurs. La valeur par défaut est `False` (pas d'inversion).

source: (*void*): This function modifies the `surface_` directly and does not return a value.
es: (*void*): Esta función modifica `surface_` directamente y no devuelve ningún valor.
fr: (*void*): Cette fonction modifie directement la `surface_` et ne retourne pas de valeur.

source: The effect is applied in place, meaning the input `surface_` is modified directly.
es: El efecto se aplica en el lugar, lo que significa que la entrada `surface_` se modifica directamente.
fr: L'effet est appliqué directement, ce qui signifie que la `surface_` d'entrée est modifiée directement.

source: The inversion of the heatmap allows for a reversed color representation.
es: La inversión del mapa de calor permite una representación de color invertida.
fr: L'inversion de la carte thermique permet une représentation des couleurs inversée.

source: Apply predator vision effect using GPU acceleration.
es: Aplica un efecto de visión de depredador utilizando aceleración por GPU.
fr: Applique un effet de vision de prédateur à l'aide de l'accélération GPU.

source: This function processes the input `pygame.Surface` to apply a predator vision effect using GPU acceleration. The effect simulates a vision filter with bloom and colormap adjustments, which can be customized based on the provided parameters.
es: Esta función procesa el `pygame.Surface` de entrada para aplicar un efecto de visión de depredador utilizando aceleración por GPU. El efecto simula un filtro de visión con ajustes de bloom y mapa de colores, que se pueden personalizar según los parámetros proporcionados.
fr: Cette fonction traite la `pygame.Surface` d'entrée pour appliquer un effet de vision de prédateur en utilisant l'accélération GPU. L'effet simule un filtre de vision avec un effet de bloom et des ajustements de carte de couleurs, qui peuvent être personnalisés en fonction des paramètres fournis.

source: **surface_** (*pygame.Surface*): The input surface to process.
es: **surface_** (*pygame.Surface*): La superficie de entrada a procesar.
fr: **surface_** (*pygame.Surface*): La surface d'entrée à traiter.

source: **grid_** (*tuple*): A tuple `(grid_y, grid_x)` representing the grid dimensions for CUDA kernel execution.
es: **grid_** (*tuple*): Una tupla `(grid_y, grid_x)` que representa las dimensiones de la cuadrícula para la ejecución del núcleo CUDA.
fr: **grid_** (*tuple*): Un tuple `(grid_y, grid_x)` représentant les dimensions de la grille pour l'exécution du noyau CUDA.

source: **block_** (*tuple*): A tuple `(block_y, block_x)` representing the block dimensions for CUDA kernel execution.
es: **block_** (*tuple*): Una tupla `(block_y, block_x)` que representa las dimensiones del bloque para la ejecución del núcleo CUDA.
fr: **block_** (*tuple*): Un tuple `(block_y, block_x)` représentant les dimensions du bloc pour l'exécution du noyau CUDA.

source: **bloom_smooth** (*unsigned int*, optional): The smoothing factor for the bloom effect. Default is `50`.
es: **bloom_smooth** (*unsigned int*, opcional): El factor de suavizado para el efecto de bloom. El valor predeterminado es `50`.
fr: **bloom_smooth** (*entier non signé*, optionnel) : Le facteur de lissage pour l'effet de bloom. La valeur par défaut est `50`.

source: **bloom_threshold** (*unsigned int*, optional): The intensity threshold for the bloom effect. Default is `50`.
es: **bloom_threshold** (*unsigned int*, opcional): El umbral de intensidad para el efecto de bloom. El valor predeterminado es `50`.
fr: **bloom_threshold** (*entier non signé*, optionnel) : Le seuil d'intensité pour l'effet de bloom. La valeur par défaut est `50`.

source: **inv_colormap** (*boolean*, optional): Whether to invert the colormap. Default is `False`.
es: **inv_colormap** (*boolean*, opcional): Si se debe invertir el mapa de colores. El valor predeterminado es `False`.
fr: **inv_colormap** (*booléen*, optionnel) : Si la carte de couleurs doit être inversée. La valeur par défaut est `False`.

source: **blend** (*int*, optional): The blending mode for final rendering. Default is `pygame.BLEND_RGB_ADD`.
es: **blend** (*int*, opcional): El modo de mezcla para la renderización final. El valor predeterminado es `pygame.BLEND_RGB_ADD`.
fr: **blend** (*int*, optionnel) : Le mode de fusion pour le rendu final. La valeur par défaut est `pygame.BLEND_RGB_ADD`.

source: **bloom_flag** (*boolean*, optional): Flag to enable the bloom effect. Default is `pygame.BLEND_RGB_ADD`.
es: **bloom_flag** (*boolean*, opcional): Bandera para habilitar el efecto de bloom. El valor predeterminado es `pygame.BLEND_RGB_ADD`.
fr: **bloom_flag** (*booléen*, optionnel) : Indicateur pour activer l'effet de bloom. La valeur par défaut est `pygame.BLEND_RGB_ADD`.

source: (*pygame.Surface*): The processed surface with the applied predator vision effect.
es: (*pygame.Surface*): La superficie procesada con el efecto de visión de depredador aplicado.
fr: (*pygame.Surface*): La surface traitée avec l'effet de vision de prédateur appliqué.

source: **ValueError**: If `bloom_smooth`, `bloom_threshold` are not positive integers or if `blend` is not a valid blend mode.
es: **ValueError**: Si `bloom_smooth`, `bloom_threshold` no son enteros positivos o si `blend` no es un modo de mezcla válido.
fr: **ValueError** : Si `bloom_smooth`, `bloom_threshold` ne sont pas des entiers positifs ou si `blend` n'est pas un mode de fusion valide.

source: This function uses GPU acceleration to apply a fast predator vision effect.
es: Esta función utiliza aceleración por GPU para aplicar un efecto de visión de depredador rápido.
fr: Cette fonction utilise l'accélération GPU pour appliquer un effet de vision de prédateur rapide.

source: The bloom effect simulates glowing areas of high intensity, and the colormap can be inverted for different visual effects.
es: El efecto de bloom simula áreas brillantes de alta intensidad, y el mapa de colores se puede invertir para diferentes efectos visuales.
fr: L'effet de bloom simule des zones brillantes à haute intensité, et la carte de couleurs peut être inversée pour des effets visuels différents.

source: The `blend` and `bloom_flag` parameters allow for customization of the final rendering effect.
es: Los parámetros `blend` y `bloom_flag` permiten personalizar el efecto de renderización final.
fr: Les paramètres `blend` et `bloom_flag` permettent de personnaliser l'effet final de rendu.

source: Downscale a pygame surface using CUDA on CuPy.
es: Reduce la escala de una superficie de pygame utilizando CUDA en CuPy.
fr: Réduire la taille d'une surface pygame en utilisant CUDA sur CuPy.

source: This function extracts pixel data from a `pygame.Surface`, transfers it to the GPU, applies a downscaling operation using a CUDA kernel, and returns the processed image in a byte buffer.
es: Esta función extrae los datos de píxeles de un `pygame.Surface`, los transfiere a la GPU, aplica una operación de reducción de escala utilizando un núcleo CUDA y devuelve la imagen procesada en un búfer de bytes.
fr: Cette fonction extrait les données des pixels d'une `pygame.Surface`, les transfère vers le GPU, applique une opération de réduction de taille en utilisant un noyau CUDA, puis retourne l'image traitée dans un tampon d'octets.

source: **surface_** (*pygame.Surface*): The input surface to be downscaled.
es: **surface_** (*pygame.Surface*): La superficie de entrada a reducir.
fr: **surface_** (*pygame.Surface*): La surface d'entrée à réduire.

source: **grid_** (*tuple*): CUDA grid dimensions for kernel execution.
es: **grid_** (*tuple*): Dimensiones de la cuadrícula CUDA para la ejecución del núcleo.
fr: **grid_** (*tuple*): Dimensions de la grille CUDA pour l'exécution du noyau.

source: **block_** (*tuple*): CUDA block dimensions for kernel execution.
es: **block_** (*tuple*): Dimensiones del bloque CUDA para la ejecución del núcleo.
fr: **block_** (*tuple*): Dimensions du bloc CUDA pour l'exécution du noyau.

source: **zoom** (*float*): The scaling factor for downscaling. Must be in the range `[0.0, 0.9999]`.
es: **zoom** (*float*): El factor de escala para la reducción de escala. Debe estar en el rango `[0.0, 0.9999]`.
fr: **zoom** (*flottant*): Le facteur de mise à l'échelle pour la réduction de taille. Il doit être dans la plage `[0.0, 0.9999]`.

source: **w2** (*int*): The target width of the downscaled image.
es: **w2** (*int*): El ancho objetivo de la imagen reducida.
fr: **w2** (*int*): La largeur cible de l'image réduite.

source: **h2** (*int*): The target height of the downscaled image.
es: **h2** (*int*): La altura objetivo de la imagen reducida.
fr: **h2** (*int*): La hauteur cible de l'image réduite.

source: (*bytes*): The downscaled image in RGB format as a byte buffer.
es: (*bytes*): La imagen reducida en formato RGB como un búfer de bytes.
fr: (*bytes*): L'image réduite au format RGB sous forme de tampon d'octets.

source: **ValueError**: If `zoom` is not in the range `[0.0, 0.9999]`, or if `w2` or `h2` are non-positive values.
es: **ValueError**: Si `zoom` no está en el rango `[0.0, 0.9999]`, o si `w2` o `h2` son valores no positivos.
fr: **ValueError** : Si `zoom` n'est pas dans la plage `[0.0, 0.9999]`, ou si `w2` ou `h2` sont des valeurs non positives.

source: This function uses GPU acceleration with CuPy for efficient downscaling.
es: Esta función utiliza aceleración por GPU con CuPy para una reducción de escala eficiente.
fr: Cette fonction utilise l'accélération GPU avec CuPy pour une réduction de taille efficace.

source: The downscaled image is returned as a byte buffer in RGB format.
es: La imagen reducida se devuelve como un búfer de bytes en formato RGB.
fr: L'image réduite est retournée sous forme de tampon d'octets au format RGB.
