Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: This function transforms an image to resemble a hand-painted artistic style. It achieves this by using a fast median filter algorithm (`median_fast`), which smooths pixel values while maintaining edge details, giving the image a brushstroke-like appearance.
es: Esta función transforma una imagen para que se asemeje a un estilo artístico pintado a mano. Lo logra utilizando un algoritmo de filtro de mediana rápida (`median_fast`), que suaviza los valores de píxeles mientras mantiene los detalles de los bordes, dando a la imagen una apariencia similar a pinceladas.
fr: Cette fonction transforme une image pour lui donner un style artistique ressemblant à une peinture à la main. Elle y parvient en utilisant un algorithme de filtre médian rapide (`median_fast`), qui lisse les valeurs de pixels tout en maintenant les détails des bords, donne à l'image une apparence similaire à celle de coups de pinceau.

source: **Note:** - This method **modifies the input surface in place**. - It **is not optimized for real-time rendering** and is intended for offline processing of images.
es: **Nota:** - Este método **modifica la superficie de entrada in situ**. - **No está optimizado para renderizado en tiempo real** y está destinado al procesamiento fuera de línea de imágenes.
fr: **Note :** - Cette méthode **modifie la surface d'entrée en place**. - Elle **n'est pas optimisée pour le rendu en temps réel** et est destinée au traitement hors ligne des images.

source: For a 24-bit or 32-bit image:
es: Para una imagen de 24 bits o 32 bits:
fr: Pour une image 24 bits ou 32 bits :

source: **surface_** (pygame.Surface) A Pygame-compatible surface (24-bit or 32-bit), with or without per-pixel transparency (alpha channel).
es: **surface_** (pygame.Surface) Una superficie compatible con Pygame (24 bits o 32 bits), con o sin transparencia por píxel (canal alfa).
fr: **surface_** (pygame.Surface) Une surface compatible Pygame (24 bits ou 32 bits), avec ou sans transparence par pixel (canal alpha).

source: None The function modifies the input surface directly.
es: None La función modifica la superficie de entrada directamente.
fr: None La fonction modifie directement la surface d'entrée.

source: ValueError If `surface_` is not a valid `pygame.Surface`.
es: ValueError Si `surface_` no es un `pygame.Surface` válido.
fr: ValueError Si `surface_` n'est pas une `pygame.Surface` valide.

source: Apply a pixelation effect to an image (INPLACE).
es: Aplica un efecto de pixelación a una imagen (IN SITU).
fr: Applique un effet de pixelisation à une image (EN PLACE).

source: Pixelation is a visual effect where an image is displayed at a low resolution, making individual pixels (small, single-colored square elements) clearly visible. This technique is often used in digital graphics to create artistic styles, censor parts of an image, or simulate retro, low-resolution video game graphics.
es: La pixelación es un efecto visual en el que una imagen se muestra a baja resolución, haciendo que los píxeles individuales (pequeños elementos cuadrados de un solo color) sean claramente visibles. Esta técnica se utiliza a menudo en gráficos digitales para crear estilos artísticos, censurar partes de una imagen o simular gráficos de videojuegos retro de baja resolución.
fr: La pixelisation est un effet visuel où une image est affichée à une faible résolution, rendant les pixels individuels (petits éléments carrés de couleur unie) clairement visibles. Cette technique est souvent utilisée dans les graphiques numériques pour créer des styles artistiques, censurer des parties d'une image, ou simuler des graphiques rétro de jeux vidéo à faible résolution.

source: This function modifies the input surface in-place, reducing fine details and emphasizing blocky pixel structures.
es: Esta función modifica la superficie de entrada in situ, reduciendo los detalles finos y enfatizando las estructuras de píxeles cuadriculados.
fr: Cette fonction modifie la surface d'entrée en place, réduisant les détails fins et mettant en évidence les structures de pixels carrés.

source: For both 24-bit and 32-bit images:
es: Para imágenes de 24 bits y 32 bits:
fr: Pour les images 24 bits et 32 bits :

source: **surface_** (pygame.Surface) A Pygame-compatible surface (24-bit or 32-bit image) with or without per-pixel transparency (alpha channel).
es: **surface_** (pygame.Surface) Una superficie compatible con Pygame (imagen de 24 bits o 32 bits) con o sin transparencia por píxel (canal alfa).
fr: **surface_** (pygame.Surface) Une surface compatible Pygame (image 24 bits ou 32 bits) avec ou sans transparence par pixel (canal alpha).

source: None The input surface is modified directly (in-place).
es: Ninguno La superficie de entrada se modifica directamente (in situ).
fr: None La surface d'entrée est modifiée directement (en place).

source: Apply a median filter to a grayscale version of the image (INPLACE).
es: Aplica un filtro de mediana a una versión en escala de grises de la imagen (IN SITU).
fr: Applique un filtre médian à une version en niveaux de gris de l'image (EN PLACE).

source: The **median filter** is a non-linear digital filtering technique commonly used to remove noise from images while preserving edges. It is widely used in digital image processing as a pre-processing step for tasks such as edge detection and segmentation.
es: El **filtro de mediana** es una técnica de filtrado digital no lineal comúnmente utilizada para eliminar ruido de las imágenes mientras se preservan los bordes. Se utiliza ampliamente en el procesamiento de imágenes digitales como un paso de preprocesamiento para tareas como la detección de bordes y la segmentación.
fr: Le **filtre médian** est une technique de filtrage numérique non linéaire couramment utilisée pour éliminer le bruit des images tout en préservant les bords. Il est largement utilisé dans le traitement d'image numérique comme étape de pré-traitement pour des tâches telles que la détection de bords et la segmentation.

source: This function converts the input surface to grayscale and applies a median filter effect. The strength of the filtering effect is controlled by the `kernel_size_` parameter.
es: Esta función convierte la superficie de entrada a escala de grises y aplica un efecto de filtro de mediana. La fuerza del efecto de filtrado se controla mediante el parámetro `kernel_size_`.
fr: Cette fonction convertit la surface d'entrée en niveaux de gris et applique un effet de filtre médian. La force de l'effet de filtrage est contrôlée par le paramètre `kernel_size_`.

source: ⚠ **Note**: - This method **modifies the surface in place**. - It is **not suitable for real-time rendering**. - Compatible with **24-bit and 32-bit surfaces**, with or without an alpha channel.
es: ⚠ **Nota**: - Este método **modifica la superficie in situ**. - **No es adecuado para renderizado en tiempo real**. - Compatible con **superficies de 24 y 32 bits**, con o sin canal alfa.
fr: ⚠ **Note**: - Cette méthode **modifie la surface en place**. - Elle n'est **pas adaptée au rendu en temps réel**. - Compatible avec des **surfaces 24 bits et 32 bits**, avec ou sans un canal alpha.

source: Apply median filter to a 24-bit image:
es: Aplicar filtro de mediana a una imagen de 24 bits:
fr: Appliquer un filtre médian à une image 24 bits :

source: Apply median filter to a 32-bit image (with alpha channel):
es: Aplicar filtro de mediana a una imagen de 32 bits (con canal alfa):
fr: Appliquer un filtre médian à une image 32 bits (avec canal alpha) :

source: **surface_** (pygame.Surface) A Pygame-compatible surface (24-bit or 32-bit, with or without alpha).
es: **surface_** (pygame.Surface) Una superficie compatible con Pygame (24 o 32 bits, con o sin alfa).
fr: **surface_** (pygame.Surface) Une surface compatible Pygame (24 bits ou 32 bits, avec ou sans alpha).

source: **kernel_size_** (int, optional, default=2) The size of the kernel (neighborhood of pixels considered for filtering). Must be greater than 0. Increasing the kernel size enhances the filtering effect but significantly impacts performance.
es: **kernel_size_** (int, opcional, predeterminado=2) El tamaño del kernel (vecindario de píxeles considerados para el filtrado). Debe ser mayor que 0. Aumentar el tamaño del kernel mejora el efecto de filtrado pero impacta significativamente el rendimiento.
fr: **kernel_size_** (int, optionnel, valeur par défaut=2) La taille du noyau (voisinage des pixels considérés pour le filtrage). Doit être supérieur à 0. Augmenter la taille du noyau améliore l'effet de filtrage mais impacte considérablement les performances.

source: None The function modifies the input surface directly (in-place).
es: Ninguno La función modifica la superficie de entrada directamente (in situ).
fr: None La fonction modifie directement la surface d'entrée (en place).

source: Reduce the number of colors in an image (INPLACE).
es: Reducir el número de colores en una imagen (IN SITU).
fr: Réduire le nombre de couleurs dans une image (EN PLACE).

source: This function decreases the number of unique colors in the given surface, effectively creating a posterization effect. Reducing colors can be useful for artistic effects, image compression, or preprocessing for stylized graphics.
es: Esta función reduce el número de colores únicos en la superficie dada, creando efectivamente un efecto de posterización. Reducir los colores puede ser útil para efectos artísticos, compresión de imágenes o preprocesamiento para gráficos estilizados.
fr: Cette fonction réduit le nombre de couleurs uniques dans la surface donnée, créant ainsi un effet de postérisation. Réduire le nombre de couleurs peut être utile pour des effets artistiques, la compression d'images ou un pré-traitement pour des graphiques stylisés.

source: ⚠ **Note**: - **Modifies the surface in place**. - **Works with 24-bit and 32-bit surfaces**, with or without an alpha channel. - If the surface has a **32-bit per-pixel alpha channel**, the alpha layer will be disregarded, meaning the effect is applied only to RGB values.
es: ⚠ **Nota**: - **Modifica la superficie in situ**. - **Funciona con superficies de 24 y 32 bits**, con o sin canal alfa. - Si la superficie tiene un **canal alfa de 32 bits por píxel**, la capa alfa se ignorará, lo que significa que el efecto se aplica solo a los valores RGB.
fr: ⚠ **Note**: - **Modifie la surface en place**. - **Fonctionne avec des surfaces 24 bits et 32 bits**, avec ou sans un canal alpha. - Si la surface a un **canal alpha par pixel 32 bits**, le canal alpha sera ignoré, ce qui signifie que l'effet est appliqué uniquement aux valeurs RGB.

source: Reduce the number of colors in a Pygame surface to 8:
es: Reducir el número de colores en una superficie de Pygame a 8:
fr: Réduire le nombre de couleurs dans une surface Pygame à 8 :

source: **color_** (int, optional, default=8) The number of colors to reduce the image to. Must be greater than 0. Lower values produce a more dramatic effect.
es: **color_** (int, opcional, predeterminado=8) El número de colores al que se reducirá la imagen. Debe ser mayor que 0. Valores más bajos producen un efecto más dramático.
fr: **color_** (int, optionnel, valeur par défaut=8) Le nombre de couleurs auquel réduire l' image. Doit être supérieur à 0. Des valeurs plus faibles produisent un effet plus dramatique.

source: Apply Sobel Edge Detection (Inplace)
es: Aplicar detección de bordes Sobel (In situ)
fr: Appliquer la détection de bords de Sobel (en place)

source: The Sobel operator, also known as the Sobel-Feldman operator, is commonly used in image processing for edge detection. It highlights edges in an image by emphasizing areas with high intensity gradients.
es: El operador Sobel, también conocido como operador Sobel-Feldman, se utiliza comúnmente en el procesamiento de imágenes para la detección de bordes. Resalta los bordes en una imagen enfatizando áreas con gradientes de alta intensidad.
fr: L'opérateur Sobel, également connu sous le nom d'opérateur Sobel-Feldman, est couramment utilisé dans le traitement d'image pour la détection de bords. Il met en évidence les bords dans une image en accentuant les zones avec de forts gradients d'intensité.

source: This function applies the Sobel edge detection to a Pygame surface, transforming the surface to emphasize its edges based on the gradient of pixel intensities.
es: Esta función aplica la detección de bordes Sobel a una superficie de Pygame, transformando la superficie para enfatizar sus bordes basándose en el gradiente de intensidades de píxeles.
fr: Cette fonction applique la détection de bords de Sobel à une surface Pygame, transformant la surface pour mettre en évidence ses bords en fonction du gradient des intensités des pixels.

source: The input surface must be in grayscale (24 - 32 bit) for best results. If the surface is not in grayscale, only the red channel will be used for the edge detection.
es: La superficie de entrada debe estar en escala de grises (24 - 32 bits) para obtener los mejores resultados. Si la superficie no está en escala de grises, solo se utilizará el canal rojo para la detección de bordes.
fr: La surface d'entrée doit être en niveaux de gris (24 - 32 bits) pour de meilleurs résultats. Si la surface n'est pas en niveaux de gris, seul le canal rouge sera utilisé pour la détection des bords.

source: **Example usage:**
es: **Ejemplo de uso:**
fr: **Exemple d'utilisation :**

source: Apply Sobel edge detection with a threshold of 64:
es: Aplicar detección de bordes Sobel con un umbral de 64:
fr: Appliquer la détection de bords de Sobel avec un seuil de 64 :

source: **surface_** (pygame.Surface) A Pygame.Surface object (24 - 32 bit depth), which may or may not have an alpha channel. The surface should be greyscaled, although non-greyscale images will use the red channel for edge detection.
es: **surface_** (pygame.Surface) Un objeto Pygame.Surface (profundidad de 24 - 32 bits), que puede o no tener un canal alfa. La superficie debe estar en escala de grises, aunque las imágenes que no estén en escala de grises utilizarán el canal rojo para la detección de bordes.
fr: **surface_** (pygame.Surface) Un objet Pygame.Surface (profondeur 24 - 32 bits), qui peut ou non avoir un canal alpha. La surface doit être en niveaux de gris, bien que les images non en niveaux de gris utiliseront le canal rouge pour la détection des bords.

source: **threshold_** (int, optional, default=64) An integer representing the threshold for detecting edges. The threshold determines the sensitivity of edge detection, with higher values requiring stronger gradients to be considered an edge.
es: **threshold_** (int, opcional, predeterminado=64) Un entero que representa el umbral para detectar bordes. El umbral determina la sensibilidad de la detección de bordes, donde valores más altos requieren gradientes más fuertes para ser considerados un borde.
fr: **threshold_** (int, optionnel, valeur par défaut=64) Un entier représentant le seuil pour la détection des bords. Le seuil détermine la sensibilité de la détection des bords, des valeurs plus élevées nécessitant des gradients plus forts pour être considérés comme un bord.

source: None The function modifies the input surface in place, updating it with the Sobel edge detection result.
es: Ninguno La función modifica la superficie de entrada in situ, actualizándola con el resultado de la detección de bordes Sobel.
fr: None La fonction modifie la surface d'entrée en place, la mettant à jour avec le résultat de la détection de bords de Sobel.

source: Apply 1D Sobel Edge Detection (Inplace)
es: Aplicar detección de bordes Sobel 1D (In situ)
fr: Appliquer la détection de bords de Sobel 1D (en place)

source: This function applies the 1D Sobel operator to a given image (or surface), emphasizing the edges in the horizontal or vertical direction based on the gradient of pixel intensities. It modifies the input buffer(s) in place.
es: Esta función aplica el operador Sobel 1D a una imagen (o superficie) dada, enfatizando los bordes en la dirección horizontal o vertical basándose en el gradiente de intensidades de píxeles. Modifica el/los búfer(es) de entrada in situ.
fr: Cette fonction applique l'opérateur Sobel 1D à une image (ou surface) donnée, mettant en évidence les bords dans la direction horizontale ou verticale en fonction du gradient des intensités des pixels. Elle modifie les tampons d'entrée en place.

source: For 24-bit image:
es: Para una imagen de 24 bits:
fr: Pour une image 24 bits :

source: For 32-bit image (with alpha):
es: Para una imagen de 32 bits (con alfa):
fr: Pour une image 32 bits (avec alpha) :

source: **w** (int) Width of the Pygame surface that the source array (`bgr_array`) is referencing.
es: **w** (int) Ancho de la superficie de Pygame a la que hace referencia el arreglo fuente (`bgr_array`).
fr: **w** (int) Largeur de la surface Pygame que le tableau source (`bgr_array`) référence.

source: **h** (int) Height of the Pygame surface that the source array (`bgr_array`) is referencing.
es: **h** (int) Altura de la superficie de Pygame a la que hace referencia el arreglo fuente (`bgr_array`).
fr: **h** (int) Hauteur de la surface Pygame que le tableau source (`bgr_array`) référence.

source: **bgr_array** (numpy.ndarray) A 1D C-buffer of type uint8 containing pixel data in BGR format. If the image is not greyscale, the algorithm processes all three RGB channels. If greyscale is enabled, only the blue channel is used for edge detection.
es: **bgr_array** (numpy.ndarray) Un búfer C 1D de tipo uint8 que contiene datos de píxeles en formato BGR. Si la imagen no está en escala de grises, el algoritmo procesa los tres canales RGB. Si la escala de grises está habilitada, solo se utiliza el canal azul para la detección de bordes.
fr: **bgr_array** (numpy.ndarray) Un tampon C 1D de type uint8 contenant les données des pixels au format BGR. Si l'image n'est pas en niveaux de gris, l'algorithme traite les trois canaux RGB. Si les niveaux de gris sont activés, seul le canal bleu est utilisé pour la détection des bords.

source: **tmp_array** (numpy.ndarray, optional) A 1D C-buffer of type uint8 containing pixel data in BGR format. It is a copy of the source `bgr_array`. Both `bgr_array` and `tmp_array` must have the same size and data format. This is used as a temporary buffer during processing.
es: **tmp_array** (numpy.ndarray, opcional) Un búfer C 1D de tipo uint8 que contiene datos de píxeles en formato BGR. Es una copia del arreglo fuente `bgr_array`. Tanto `bgr_array` como `tmp_array` deben tener el mismo tamaño y formato de datos. Se utiliza como un búfer temporal durante el procesamiento.
fr: **tmp_array** (numpy.ndarray, optionnel) Un tampon C 1D de type uint8 contenant des données de pixels au format BGR. C'est une copie du tableau source `bgr_array`. Les tableaux `bgr_array` et `tmp_array` doivent avoir la même taille et le même format de données. Il est utilisé comme tampon temporaire lors du traitement.

source: **threshold** (int, optional, default=64) The threshold for edge detection. Pixels with gradient values above this threshold will be considered edges.
es: **threshold** (int, opcional, predeterminado=64) El umbral para la detección de bordes. Los píxeles con valores de gradiente por encima de este umbral serán considerados bordes.
fr: **threshold** (int, optionnel, valeur par défaut=64) Le seuil pour la détection des bords. Les pixels ayant des valeurs de gradient supérieures à ce seuil seront considérés comme des bords.

source: **format_32** (bool, optional, default=False) If `True`, the input array is assumed to be in 32-bit BGRA format. If `False`, the input array is assumed to be in 24-bit BGR format.
es: **format_32** (bool, opcional, predeterminado=False) Si es `True`, se asume que el arreglo de entrada está en formato BGRA de 32 bits. Si es `False`, se asume que el arreglo de entrada está en formato BGR de 24 bits.
fr: **format_32** (bool, optionnel, valeur par défaut=False) Si `True`, le tableau d'entrée est supposé être au format 32 bits BGRA. Si `False`, le tableau d'entrée est supposé être au format 24 bits BGR.

source: **greyscale** (bool, optional, default=False) If `True`, the algorithm processes only the blue channel for edge detection, which can simplify the computation for greyscale images. If `False`, all three RGB channels are used in the Sobel operator.
es: **greyscale** (bool, opcional, predeterminado=False) Si es `True`, el algoritmo procesa solo el canal azul para la detección de bordes, lo que puede simplificar el cálculo para imágenes en escala de grises. Si es `False`, se utilizan los tres canales RGB en el operador Sobel.
fr: **greyscale** (bool, optionnel, valeur par défaut=False) Si `True`, l'algorithme traite uniquement le canal bleu pour la détection des bords, ce qui peut simplifier le calcul pour les images en niveaux de gris. Si `False`, les trois canaux RGB sont utilisés dans l'opérateur Sobel.

source: None The function modifies the input buffers (`bgr_array` and `tmp_array`) in place.
es: Ninguno La función modifica los búferes de entrada (`bgr_array` y `tmp_array`) in situ.
fr: None La fonction modifie les tampons d'entrée (`bgr_array` et `tmp_array`) en place.

source: Fast sobel (inplace)
es: Sobel rápido (in situ)
fr: Sobel rapide (en place)

source: The Sobel operator, sometimes called the Sobel–Feldman operator or Sobel filter, is used in image processing and computer vision, particularly within edge detection algorithms where it creates an image emphasising edges.
es: El operador Sobel, a veces llamado operador Sobel-Feldman o filtro Sobel, se utiliza en el procesamiento de imágenes y la visión por computadora, particularmente en algoritmos de detección de bordes donde crea una imagen que enfatiza los bordes.
fr: L'opérateur Sobel, parfois appelé opérateur Sobel–Feldman ou filtre Sobel, est utilisé dans le traitement d'image et la vision par ordinateur, notamment dans les algorithmes de détection de bords où il crée une image mettant en évidence les bords.

source: This function transforms the game display or a Pygame surface into a Sobel equivalent model. It is faster than the standard Sobel operator (`sobel_inplace_c`) as it down-scales the array containing all the pixels and applies the Sobel algorithm to a smaller sample. After processing, the array is re-scaled to its original dimensions. While this method is theoretically faster, down-scaling and up-scaling an array results in a decrease in overall image quality (e.g., jagged lines, no anti-aliasing).
es: Esta función transforma la pantalla del juego o una superficie de Pygame en un modelo equivalente Sobel. Es más rápida que el operador Sobel estándar (`sobel_inplace_c`) ya que reduce la escala del arreglo que contiene todos los píxeles y aplica el algoritmo Sobel a una muestra más pequeña. Después del procesamiento, el arreglo se vuelve a escalar a sus dimensiones originales. Aunque este método es teóricamente más rápido, la reducción y ampliación de escala de un arreglo resulta en una disminución de la calidad general de la imagen (por ejemplo, líneas dentadas, sin anti-aliasing).
fr: Cette fonction transforme l'affichage du jeu ou une surface Pygame en un modèle équivalent de Sobel. Elle est plus rapide que l'opérateur Sobel standard (`sobel_inplace_c`) car elle réduit la taille du tableau contenant tous les pixels et applique l'algorithme Sobel à un échantillon plus petit. Après traitement, le tableau est redimensionné à ses dimensions d'origine. Bien que cette méthode soit théoriquement plus rapide, la réduction et l'agrandissement d'un tableau entraînent une diminution de la qualité globale de l'image (par exemple, des lignes dentelées, pas d'anti-crénelage).
