Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader.po
Languages: es, fr

source: Convert a 1D array from RGB(A) to BGR(A) format and return a new copy. This function takes a 1D array (or memoryview slice) that contains pixel data in RGB(A) order and produces a new 1D array with the color channels reordered to BGR(A). This conversion is useful when interfacing with libraries or routines that expect pixels in BGR(A) format instead of the more common RGB(A) order.
es: Convierte un arreglo 1D de formato RGB(A) a BGR(A) y retorna una nueva copia. Esta función toma un arreglo 1D (o un fragmento de `memoryview`) que contiene datos de píxeles en orden RGB(A) y produce un nuevo arreglo 1D con los canales de color reordenados a BGR(A). Esta conversión es útil cuando se trabaja con bibliotecas o rutinas que esperan píxeles en formato BGR(A) en lugar del más común orden RGB(A).
fr: Convertit un tableau 1D du format RGB(A) au format BGR(A) et retourne une nouvelle copie. Cette fonction prend un tableau 1D (ou une tranche de mémoire `memoryview`) contenant des données de pixels dans l'ordre RGB(A) et produit un nouveau tableau 1D avec les canaux de couleur réorganisés en BGR(A). Cette conversion est utile lors de l'interfaçage avec des bibliothèques ou des routines qui attendent des pixels au format BGR(A) plutôt que dans l'ordre plus courant RGB(A).

source: The function assumes that the input array is of type uint8, and its length should be a multiple of 3 (for RGB data) or 4 (for RGBA data). The `format_32` flag indicates whether the input contains 32-bit pixels (True for RGBA, False for RGB).
es: La función asume que el arreglo de entrada es de tipo uint8, y su longitud debe ser un múltiplo de 3 (para datos RGB) o 4 (para datos RGBA). El indicador `format_32` señala si los píxeles de entrada son de 32 bits (True para RGBA, False para RGB).
fr: La fonction suppose que le tableau d'entrée est de type uint8, et que sa longueur doit être un multiple de 3 (pour les données RGB) ou de 4 (pour les données RGBA). Le drapeau `format_32` indique si l'entrée contient des pixels 32 bits (`True` pour RGBA, `False` pour RGB).

source: **bgr_array** (numpy.ndarray or memoryview slice, shape `(w,)`, dtype `uint8`) A 1D array or buffer containing pixel data in RGB(A) order. (For instance, if the image is RGB, the array length should be 3 * number_of_pixels.)
es: **bgr_array** (numpy.ndarray o fragmento de memoryview, forma `(w,)`, tipo `uint8`) Un arreglo 1D o buffer que contiene datos de píxeles en orden RGB(A). Por ejemplo, si la imagen es RGB, la longitud del arreglo debe ser 3 * número_de_píxeles).
fr: **bgr_array** (numpy.ndarray ou tranche de `memoryview`, forme `(w,)`, type `uint8`) Un tableau 1D ou un tampon contenant des données de pixels au format RGB(A). (Par exemple, si l'image est en RGB, la longueur du tableau doit être de 3 * nombre_de_pixels.)

source: **format_32** (bool, optional) A flag indicating the pixel format: - `False` (default): the input is assumed to be 24-bit (RGB, 3 channels). - `True`: the input is assumed to be 32-bit (RGBA, 4 channels).
es: **format_32** (bool, opcional) Un indicador que señala el formato del píxel: - `False` (predeterminado): se asume que la entrada es de 24 bits (RGB, 3 canales). - `True`: se asume que la entrada es de 32 bits (RGBA, 4 canales).
fr: **format_32** (bool, optionnel) Un drapeau indiquant le format des pixels : - `False` (par défaut) : l'entrée est supposée être en 24 bits (RGB, 3 canaux). -`True` : l'entrée est supposée être en 32 bits (RGBA, 4 canaux).

source: **numpy.ndarray** A new 1D array (uint8) with the pixel data converted to BGR(A) order.
es: **numpy.ndarray** Un nuevo arreglo 1D (uint8) con los datos de píxeles convertidos a orden BGR(A).
fr: **numpy.ndarray** Un nouveau tableau 1D (`uint8`) avec les données de pixels converties en ordre BGR(A).

source: Convert a Pygame surface from RGB(A) to BRG(A) format in-place. This function modifies the given surface by swapping the red and green color channels, converting an image from RGB(A) order to BRG(A) order. The alpha channel, if present, is preserved but ignored during the conversion process.
es: Convierte una superficie de Pygame de RGB(A) a BRG(A) en su lugar. Esta función modifica la superficie dada intercambiando los canales de color rojo y verde, convirtiendo una imagen de orden RGB(A) a orden BRG(A). El canal alfa, si está presente, se conserva pero se ignora durante el proceso de conversión.
fr: Convertit une surface Pygame du format RGB(A) au format BRG(A) en place. Cette fonction modifie la surface donnée en échangeant les canaux de couleur rouge et vert, convertissant ainsi une image du format RGB(A) au format BRG(A). Le canal alpha, s'il est présent, est conservé mais ignoré lors du processus de conversion.

source: **Example Usage:**
es: **Ejemplo de uso:**
fr: **Exemple d'utilisation :**

source: **surface_** (pygame.Surface) A Pygame surface or display surface compatible with 24-bit (RGB) or 32-bit (RGBA) pixel formats. The function operates directly on the provided surface.
es: **surface_** (pygame.Surface) Una superficie de Pygame o superficie de pantalla compatible con formatos de píxeles de 24 bits (RGB) o 32 bits (RGBA). La función opera directamente sobre la superficie proporcionada.
fr: **surface_** (pygame.Surface) Une surface Pygame ou une surface d'affichage compatible avec les formats de pixels 24 bits (RGB) ou 32 bits (RGBA). La fonction agit directement sur la surface fournie.

source: **None** The function modifies the input surface in-place and does not return a new surface.
es: **None** La función modifica la superficie de entrada en su lugar y no retorna una nueva superficie.
fr: **None** La fonction modifie la surface d'entrée en place et ne retourne pas de nouvelle surface.

source: Convert an image from RGB(A) to BRG(A) format and return a new copy. This function swaps the red and green channels of an image while preserving the blue channel. It creates and returns a new surface with the modified color format, leaving the original surface unchanged.
es: Convierte una imagen de RGB(A) a formato BRG(A) y retorna una nueva copia. Esta función intercambia los canales rojo y verde de una imagen mientras preserva el canal azul. Crea y retorna una nueva superficie con el formato de color modificado, dejando la superficie original sin cambios.
fr: Convertit une image du format RGB(A) au format BRG(A) et retourne une nouvelle copie. Cette fonction échange les canaux rouge et vert d'une image tout en conservant le canal bleu. Elle crée et retourne une nouvelle surface avec le format de couleur modifié, laissant la surface originale inchangée.

source: **surface_** (pygame.Surface) A Pygame surface or display surface in 24-bit (RGB) or 32-bit (RGBA) format. The alpha channel (if present) will be ignored.
es: **surface_** (pygame.Surface) Una superficie de Pygame o superficie de pantalla en formato de 24 bits (RGB) o 32 bits (RGBA). El canal alfa (si está presente) será ignorado.
fr: **surface_** (pygame.Surface) Une surface Pygame ou une surface d'affichage au format 24 bits (RGB) ou 32 bits (RGBA). Le canal alpha (s'il est présent) sera ignoré.

source: **pygame.Surface** A new surface with the color channels converted to BRG format.
es: **pygame.Surface** Una nueva superficie con los canales de color convertidos a BRG formato.
fr: **pygame.Surface** Une nouvelle surface avec les canaux de couleur convertis au format BRG.

source: Convert a 3D array from RGB(A) to BRG(A) format (inplace). This function swaps the red and green channels while preserving the blue and alpha channels (if present). It modifies the input array directly without creating a copy.
es: Convierte un arreglo 3D de formato RGB(A) a BRG(A) (in situ). Esta función intercambia los canales rojo y verde mientras preserva los canales azul y alfa (si están presentes). Modifica el arreglo de entrada directamente sin crear una copia.
fr: Convertit un tableau 3D du format RGB(A) au format BRG(A) en place. Cette fonction échange les canaux rouge et vert tout en conservant les canaux bleu et alpha (s'ils sont présents). Elle modifie directement le tableau d'entrée sans créer de copie.

source: **rgb_array** (numpy.ndarray, shape (w, h, n), dtype uint8) A 3D array representing an image, where pixel values range from 0 to 255. The last dimension (n) must be 3 (RGB) or 4 (RGBA).
es: **rgb_array** (numpy.ndarray, forma (w, h, n), dtype uint8) Un arreglo 3D que representa una imagen, donde los valores de los píxeles varían de 0 a 255. La última dimensión (n) debe ser 3 (RGB) o 4 (RGBA).
fr: **rgb_array** (numpy.ndarray, forme `(w, h, n)`, type `uint8`) Un tableau 3D représentant une image, où les valeurs des pixels varient de 0 à 255. La dernière dimension (n) doit être de 3 (RGB) ou 4 (RGBA).

source: **None** The function operates inplace and does not return a new array.
es: **None** La función opera in situ y no devuelve un nuevo arreglo.
fr: **None** La fonction opère en place et ne retourne pas de nouveau tableau.

source: Converts a 1D array of RGB(A) pixel data to BRG(A) format in-place. This function swaps the red and blue channels of an input array or buffer representing RGB or RGBA pixel data. It works on both 24-bit (RGB) and 32-bit (RGBA) formats.
es: Convierte un arreglo 1D de datos de píxeles RGB(A) a formato BRG(A) in situ. Esta función intercambia los canales rojo y azul de un arreglo o búfer de entrada que representa datos de píxeles RGB o RGBA. Funciona tanto en formatos de 24 bits (RGB) como de 32 bits (RGBA).
fr: Convertit un tableau 1D de données de pixels RGB(A) au format BRG(A) en place. Cette fonction échange les canaux rouge et bleu d'un tableau d'entrée ou d'un tampon représentant des données de pixels RGB ou RGBA. Elle fonctionne avec les formats 24 bits (RGB) et 32 bits (RGBA).

source: **rgb_array** (numpy.ndarray or bytearray) A 1D array of shape (w,) containing uint8 pixel data (values 0-255). Can be either a NumPy array or a raw byte buffer.
es: **rgb_array** (numpy.ndarray o bytearray) Un arreglo 1D de forma (w,) que contiene datos de píxeles uint8 (valores 0-255). Puede ser un arreglo NumPy o un búfer de bytes crudo.
fr: **rgb_array** (numpy.ndarray ou `bytearray`) Un tableau 1D de forme `(w,)` contenant des données de pixels `uint8` (valeurs entre 0 et 255). Peut être soit un tableau NumPy, soit un tampon brut d'octets.

source: **format_32** (bool, optional, default = False) - True: Treats the input as an RGB (24-bit) buffer. - False: Treats the input as an RGBA (32-bit) buffer.
es: **format_32** (bool, opcional, predeterminado = False) - True: Trata la entrada como un búfer RGB (24 bits). - False: Trata la entrada como un búfer RGBA (32 bits).
fr: **format_32** (bool, optionnel, par défaut = False) - `True` : traite l'entrée comme un tampon RGB (24 bits). - `False` : traite l'entrée comme un tampon RGBA (32 bits).

source: **None** The operation is performed in-place, modifying `rgb_array` directly.
es: **None** La operación se realiza in situ, modificando `rgb_array` directamente.
fr: **None** L'opération est effectuée en place, modifiant directement `rgb_array`.

source: Converts a 1D array of uint8 BGR(A) pixel data to BRG(A) format and returns a new array. Unlike the in-place version (`brg_1d`), this function creates and returns a new array with the red and blue channels swapped.
es: Convierte un arreglo 1D de datos de píxeles uint8 BGR(A) a formato BRG(A) y devuelve un nuevo arreglo. A diferencia de la versión in situ (`brg_1d`), esta función crea y devuelve un nuevo arreglo con los canales rojo y azul intercambiados.
fr: Convertit un tableau 1D de données de pixels `uint8` BGR(A) au format BRG(A) et retourne un nouveau tableau. Contrairement à la version en place (`brg_1d`), cette fonction crée et retourne un nouveau tableau avec les canaux rouge et bleu échangés.

source: BRG stands for Blue, Red, Green.
es: BRG significa Azul, Rojo, Verde.
fr: BRG signifie Bleu, Rouge, Vert.

source: **bgr_array** (numpy.ndarray or bytearray) A 1D array of shape (w,) containing uint8 pixel data (values 0-255). Can be either a NumPy array or a raw byte buffer.
es: **bgr_array** (numpy.ndarray o bytearray) Un arreglo 1D de forma (w,) que contiene datos de píxeles uint8 (valores 0-255). Puede ser un arreglo NumPy o un búfer de bytes crudo.
fr: **bgr_array** (numpy.ndarray ou `bytearray`) Un tableau 1D de forme `(w,)` contenant des données de pixels `uint8` (valeurs entre 0 et 255). Peut être soit un tableau NumPy, soit un tampon brut d'octets.

source: **format_32** (bool, optional, default = False) - True: Treats the input as a BGR (24-bit) buffer. - False: Treats the input as a BGRA (32-bit) buffer.
es: **format_32** (bool, opcional, predeterminado = False) - True: Trata la entrada como un búfer BGR (24 bits). - False: Trata la entrada como un búfer BGRA (32 bits).
fr: **format_32** (bool, optionnel, par défaut = False) - `True` : traite l'entrée comme un tampon BGR (24 bits). - `False` : traite l'entrée comme un tampon BGRA (32 bits).

source: **numpy.ndarray** A new array of shape (w,) with the BRG(A) pixel format (copied).
es: **numpy.ndarray** Un nuevo arreglo de forma (w,) con el formato de píxeles BRG(A) (copiado).
fr: **numpy.ndarray** Un nouveau tableau de forme `(w,)` avec le format de pixels BRG(A) (copié).

source: Convert an image to grayscale while preserving luminosity (in-place). A grayscale image has a single channel representing pixel intensity or brightness, where pixel values range from 0 (black) to 255 (white). This function computes the grayscale values based on luminosity, preserving perceived brightness from the original color image.
es: Convierte una imagen a escala de grises preservando la luminosidad (in situ). Una imagen en escala de grises tiene un solo canal que representa la intensidad o el brillo de los píxeles, donde los valores de los píxeles varían de 0 (negro) a 255 (blanco). Esta función calcula los valores de escala de grises basados en la luminosidad, preservando el brillo percibido de la imagen en color original.
fr: Convertit une image en niveaux de gris tout en préservant la luminosité (en place). Une image en niveaux de gris possède un seul canal représentant l'intensité ou la luminosité des pixels, avec des valeurs variant de 0 (noir) à 255 (blanc). Cette fonction calcule les valeurs en niveaux de gris en se basant sur la luminosité, préservant ainsi la perception de la luminosité de l'image couleur d'origine.

source: **surface_** (pygame.Surface) A Pygame surface or display surface compatible object, with an image in 24-bit or 32-bit format. The surface may include transparency or an alpha channel.
es: **surface_** (pygame.Surface) Una superficie de Pygame o un objeto compatible con superficie de visualización, con una imagen en formato de 24 bits o 32 bits. La superficie puede incluir transparencia o un canal alfa.
fr: **surface_** (pygame.Surface) Une surface Pygame ou un objet compatible avec une surface d'affichage, contenant une image au format 24 bits ou 32 bits. La surface peut inclure de la transparence ou un canal alpha.

source: **None** The function modifies the input surface in place and does not return a new surface.
es: **None** La función modifica la superficie de entrada in situ y no devuelve una nueva superficie.
fr: **None** La fonction modifie la surface d'entrée en place et ne retourne pas de nouvelle surface.

source: Convert an image to grayscale while preserving luminosity and return a new surface. A grayscale image has a single channel representing pixel intensity or brightness, with pixel values typically ranging from 0 (black) to 255 (white). This function converts the original image to grayscale based on luminosity, preserving perceived brightness from the color image. The alpha channel is preserved in images with transparency (RGBA format), but it is not altered.
es: Convierte una imagen a escala de grises preservando la luminosidad y devuelve una nueva superficie. Una imagen en escala de grises tiene un solo canal que representa la intensidad o el brillo de los píxeles, con valores de píxeles que generalmente varían de 0 (negro) a 255 (blanco). Esta función convierte la imagen original a escala de grises basándose en la luminosidad, preservando el brillo percibido de la imagen en color. El canal alfa se preserva en imágenes con transparencia (formato RGBA), pero no se altera.
fr: Convertit une image en niveaux de gris tout en préservant la luminosité et retourne une nouvelle surface. Une image en niveaux de gris possède un seul canal représentant l'intensité ou la luminosité des pixels, avec des valeurs variant généralement de 0 (noir) à 255 (blanc). Cette fonction convertit l'image d'origine en niveaux de gris en se basant sur la luminosité, préservant ainsi la perception de la luminosité de l'image couleur. Le canal alpha est conservé dans les images avec transparence (format RGBA), mais il n'est pas modifié.

source: **surface_** (pygame.Surface) A Pygame surface or display surface compatible object, with an image in 24-bit or 32-bit format. The surface may include transparency (alpha channel).
es: **surface_** (pygame.Surface) Una superficie de Pygame o un objeto compatible con superficie de visualización, con una imagen en formato de 24 bits o 32 bits. La superficie puede incluir transparencia (canal alfa).
fr: **surface_** (pygame.Surface) Une surface Pygame ou un objet compatible avec une surface d'affichage, contenant une image au format 24 bits ou 32 bits. La surface peut inclure de la transparence (canal alpha).

source: **pygame.Surface** A new surface object containing the grayscale image. The original surface remains unchanged.
es: **pygame.Surface** Un nuevo objeto de superficie que contiene la imagen en escala de grises. La superficie original permanece sin cambios.
fr: **pygame.Surface** Un nouvel objet surface contenant l'image en niveaux de gris. La surface d'origine reste inchangée.

source: Convert an image into a 2D grayscale array. A grayscale image has a single channel representing pixel intensity or brightness, with pixel values typically ranging from 0 (black) to 255 (white). This function converts the input image to grayscale based on luminosity, preserving the intensity from the original color image. The alpha channel, if present, will be ignored in the output.
es: Convierte una imagen en un arreglo 2D de escala de grises. Una imagen en escala de grises tiene un solo canal que representa la intensidad o el brillo de los píxeles, con valores de píxeles que generalmente varían de 0 (negro) a 255 (blanco). Esta función convierte la imagen de entrada a escala de grises basándose en la luminosidad, preservando la intensidad de la imagen en color original. El canal alfa, si está presente, se ignorará en la salida.
fr: Convertit une image en un tableau 2D en niveaux de gris. Une image en niveaux de gris possède un seul canal représentant l'intensité ou la luminosité des pixels, avec des valeurs variant généralement de 0 (noir) à 255 (blanc). Cette fonction convertit l'image d'entrée en niveaux de gris en se basant sur la luminosité, en préservant l'intensité de l'image couleur d'origine. Le canal alpha, s'il est présent, sera ignoré dans le résultat.

source: **surface_** (pygame.Surface) A Pygame surface or display surface-compatible object, with an image in 24-bit or 32-bit format. The surface may include transparency (alpha channel), which will be ignored during the conversion.
es: **surface_** (pygame.Surface) Una superficie de Pygame o un objeto compatible con superficie de visualización, con una imagen en formato de 24 bits o 32 bits. La superficie puede incluir transparencia (canal alfa), que se ignorará durante la conversión.
fr: **surface_** (pygame.Surface) Une surface Pygame ou un objet compatible avec une surface d'affichage, contenant une image au format 24 bits ou 32 bits. La surface peut inclure de la transparence (canal alpha), qui sera ignorée lors de la conversion.

source: **numpy.ndarray** A 2D NumPy array containing the grayscale image data. The array will have shape (w, h) and dtype uint8, where each value represents pixel intensity.
es: **numpy.ndarray** Un arreglo 2D de NumPy que contiene los datos de la imagen en escala de grises. El arreglo tendrá forma (w, h) y dtype uint8, donde cada valor representa la intensidad del píxel.
fr: **numpy.ndarray** Un tableau NumPy 2D contenant les données de l'image en niveaux de gris. Le tableau aura la forme `(w, h)` et le type `uint8`, où chaque valeur représente l'intensité des pixels.

source: Convert a 3D array (w, h, n) in RGB(A) format to grayscale (with alpha) in place. This function processes a 3D array directly, converting it to grayscale based on luminosity while preserving the alpha channel (if present). The pixel values in the resulting grayscale array represent intensity or brightness, ranging from 0 (black) to 255 (white).
es: Convierte un arreglo 3D (w, h, n) en formato RGB(A) a escala de grises (con alfa) in situ. Esta función procesa un arreglo 3D directamente, convirtiéndolo a escala de grises basándose en la luminosidad mientras preserva el canal alfa (si está presente). Los valores de píxeles en el arreglo de escala de grises resultante representan intensidad o brillo, variando de 0 (negro) a 255 (blanco).
fr: Convertit un tableau 3D (w, h, n) au format RGB(A) en niveaux de gris (avec alpha) en place. Cette fonction traite directement un tableau 3D, le convertissant en niveaux de gris sur la base de la luminosité tout en préservant le canal alpha (s'il est présent). Les valeurs des pixels dans le tableau de niveaux de gris résultant représentent l'intensité ou la luminosité, allant de 0 (noir) à 255 (blanc).

source: **rgb_array** (numpy.ndarray) A 3D NumPy array of shape (w, h, n) with dtype uint8, containing pixel data in RGB(A) format. The values in the array range from 0 to 255. For 32-bit arrays (RGBA), the alpha channel will be preserved but ignored in the grayscale conversion.
es: **rgb_array** (numpy.ndarray) Un arreglo 3D de NumPy de forma (w, h, n) con dtype uint8, que contiene datos de píxeles en formato RGB(A). Los valores en el arreglo varían de 0 a 255. Para arreglos de 32 bits (RGBA), el canal alfa se preservará pero se ignorará en la conversión a escala de grises.
fr: **rgb_array** (numpy.ndarray) Un tableau NumPy 3D de forme (w, h, n) avec le type `uint8`, contenant des données de pixels au format RGB(A). Les valeurs dans le tableau vont de 0 à 255. Pour les tableaux 32 bits (RGBA), le canal alpha sera préservé mais ignoré lors de la conversion en niveaux de gris.

source: **None** This function modifies the input array in place and does not return a new array.
es: **None** Esta función modifica el arreglo de entrada in situ y no devuelve un nuevo arreglo.
fr: **None** Cette fonction modifie le tableau d'entrée en place et ne retourne pas de nouveau tableau.
