Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader_gpu.po
Languages: es, fr

source: This function leverages CuPy (`cp.asarray`) for GPU-accelerated computation.
es: Esta función aprovecha CuPy (`cp.asarray`) para la computación acelerada por GPU.

source: The filter operates on each color channel (R, G, B) separately.
es: El filtro opera en cada canal de color (R, G, B) por separado.

source: The median filter is a non-linear filter that reduces noise by replacing each pixel with the median value of its surrounding neighbors.
es: El filtro de mediana es un filtro no lineal que reduce el ruido reemplazando cada píxel con el valor mediano de sus vecinos circundantes.

source: **surface_** (*pygame.Surface*): The input Pygame surface to be processed.
es: **surface_** (*pygame.Surface*): La superficie de Pygame de entrada que se procesará.

source: **size_** (*int*, optional): The size of the neighborhood considered for median filtering. Must be greater than zero. Default is 5.
es: **size_** (*int*, opcional): El tamaño de la vecindad considerada para el filtrado de mediana. Debe ser mayor que cero. El valor predeterminado es 5.

source: **AssertionError**: If `size_` is not greater than zero.
es: **AssertionError**: Si `size_` no es mayor que cero.

source: **ValueError**: If `surface_` is not a valid Pygame surface, or if the surface cannot be referenced as a 3D array, or if the surface width or height is zero.
es: **ValueError**: Si `surface_` no es una superficie de Pygame válida, o si la superficie no se puede referenciar como un arreglo 3D, o si el ancho o la altura de la superficie es cero.

source: Apply a 5x5 Gaussian blur to an image using GPU-accelerated processing.
es: Aplica un desenfoque gaussiano de 5x5 a una imagen utilizando procesamiento acelerado por GPU.
fr: Applique un flou gaussien 5x5 à une image en utilisant le traitement accéléré par GPU.

source: This function convolves each RGB channel of the given surface with a 5x5 Gaussian blur kernel to create a smoothing effect while preserving edges.
es: Esta función convoluciona cada canal RGB de la superficie dada con un kernel de desenfoque gaussiano de 5x5 para crear un efecto de suavizado mientras preserva los bordes.
fr: Cette fonction applique une convolution sur chaque canal RGB de la surface donnée avec un noyau de flou gaussien 5x5 pour créer un effet de lissage tout en préservant les contours.

source: **surface_** (*pygame.Surface*): A 24-bit or 32-bit Pygame surface to be blurred.
es: **surface_** (*pygame.Surface*): Una superficie de Pygame de 24 bits o 32 bits que se desenfocará.
fr: **surface_** (*pygame.Surface*): Une surface Pygame 24 bits ou 32 bits à flouter.

source: **pygame.Surface**: A new Pygame surface with the applied Gaussian blur in 24-bit format.
es: **pygame.Surface**: Una nueva superficie de Pygame con el desenfoque gaussiano aplicado en formato de 24 bits.
fr: **pygame.Surface** : Une nouvelle surface Pygame avec le flou gaussien appliqué au format 24 bits.

source: **TypeError**: If `surface_` is not a valid Pygame surface.
es: **TypeError**: Si `surface_` no es una superficie de Pygame válida.
fr: **TypeError** : Si `surface_` n'est pas une surface Pygame valide.

source: **ValueError**: If the surface dimensions are invalid or pixel data cannot be accessed.
es: **ValueError**: Si las dimensiones de la superficie no son válidas o no se puede acceder a los datos de píxeles.
fr: **ValueError** : Si les dimensions de la surface sont invalides ou si les données des pixels ne peuvent pas être accessibles.

source: The function uses `pixels3d(surface_)` to extract the pixel array.
es: La función utiliza `pixels3d(surface_)` para extraer el arreglo de píxeles.
fr: La fonction utilise `pixels3d(surface_)` pour extraire le tableau de pixels.

source: The computation is performed on the GPU for efficiency.
es: El cálculo se realiza en la GPU para mayor eficiencia.
fr: Le calcul est effectué sur le GPU pour optimiser les performances.

source: `gaussian_5x5_cupy` is called to apply the blur effect.
es: Se llama a `gaussian_5x5_cupy` para aplicar el efecto de desenfoque.
fr: `gaussian_5x5_cupy` est appelé pour appliquer l'effet de flou.

source: Apply a 3x3 Gaussian blur to a Pygame surface using GPU acceleration.
es: Aplica un desenfoque gaussiano de 3x3 a una superficie de Pygame utilizando aceleración por GPU.
fr: Applique un flou gaussien 3x3 à une surface Pygame en utilisant l'accélération GPU.

source: This function converts a given `pygame.Surface` to a GPU-compatible array, applies a 3x3 Gaussian blur filter to each color channel (R, G, B), and returns a new blurred `pygame.Surface`.
es: Esta función convierte una `pygame.Surface` dada en un arreglo compatible con la GPU, aplica un filtro de desenfoque gaussiano de 3x3 a cada canal de color (R, G, B) y devuelve una nueva `pygame.Surface` desenfocada.
fr: Cette fonction convertit une `pygame.Surface` donnée en un tableau compatible avec le GPU, applique un filtre de flou gaussien 3x3 à chaque canal de couleur (R, G, B) et retourne une nouvelle `pygame.Surface` floutée.

source: **surface_** (*pygame.Surface*): A 24-bit or 32-bit `pygame.Surface` representing the input image.
es: **surface_** (*pygame.Surface*): Una `pygame.Surface` de 24 bits o 32 bits que representa la imagen de entrada.
fr: **surface_** (*pygame.Surface*): Une `pygame.Surface` 24 bits ou 32 bits représentant l'image d'entrée.

source: **pygame.Surface**: A new `pygame.Surface` with the Gaussian blur effect applied.
es: **pygame.Surface**: Una nueva `pygame.Surface` con el efecto de desenfoque gaussiano aplicado.
fr: **pygame.Surface** : Une nouvelle `pygame.Surface` avec l'effet de flou gaussien appliqué.

source: **TypeError**: If `surface_` is not a `pygame.Surface`.
es: **TypeError**: Si `surface_` no es una `pygame.Surface`.
fr: **TypeError** : Si `surface_` n'est pas une `pygame.Surface`.

source: **ValueError**: If the surface has invalid dimensions or cannot be converted into an array.
es: **ValueError**: Si la superficie tiene dimensiones no válidas o no se puede convertir en un arreglo.
fr: **ValueError** : Si la surface a des dimensions invalides ou ne peut pas être convertie en tableau.

source: The function assumes that `gaussian_kernel_3x3` is predefined.
es: La función asume que `gaussian_kernel_3x3` está predefinido.
fr: La fonction suppose que `gaussian_kernel_3x3` est prédéfini.

source: `cp.cuda.Stream.null.synchronize()` ensures the GPU operations complete before returning.
es: `cp.cuda.Stream.null.synchronize()` asegura que las operaciones de la GPU se completen antes de devolver el resultado.
fr: `cp.cuda.Stream.null.synchronize()` garantit que les opérations GPU sont terminées avant de retourner le résultat.

source: Apply the Sobel edge detection filter to a grayscale image using GPU acceleration.
es: Aplica el filtro de detección de bordes Sobel a una imagen en escala de grises utilizando aceleración por GPU.
fr: Applique le filtre de détection de contours de Sobel à une image en niveaux de gris en utilisant l'accélération GPU.

source: This function assumes the input image is grayscale, meaning the same intensity is present in all three RGB channels. It applies the Sobel filter using only the red channel (`R`), though the green (`G`) or blue (`B`) channels could also be used.
es: Esta función asume que la imagen de entrada está en escala de grises, lo que significa que la misma intensidad está presente en los tres canales RGB. Aplica el filtro Sobel utilizando solo el canal rojo (`R`), aunque también se podrían usar los canales verde (`G`) o azul (`B`).
fr: Cette fonction suppose que l'image d'entrée est en niveaux de gris, ce qui signifie que la même intensité est présente dans les trois canaux RGB. Elle applique le filtre de Sobel en utilisant uniquement le canal rouge (`R`), bien que les canaux vert (`G`) ou bleu (`B`) puissent également être utilisés.

source: If the input image is not truly grayscale, the Sobel effect may vary slightly because the RGB channels might have different intensities.
es: Si la imagen de entrada no está realmente en escala de grises, el efecto Sobel puede variar ligeramente porque los canales RGB podrían tener diferentes intensidades.
fr: Si l'image d'entrée n'est pas réellement en niveaux de gris, l'effet de Sobel peut légèrement varier car les canaux RGB peuvent avoir des intensités différentes.

source: **pygame.Surface**: A new `pygame.Surface` with the Sobel edge detection effect applied in 24-bit format.
es: **pygame.Surface**: Una nueva `pygame.Surface` con el efecto de detección de bordes Sobel aplicado en formato de 24 bits.
fr: **pygame.Surface** : Une nouvelle `pygame.Surface` avec l'effet de détection de contours de Sobel appliqué en format 24 bits.

source: The function assumes that `sobel_cupy()` is implemented to process the GPU array.
es: La función asume que `sobel_cupy()` está implementado para procesar el arreglo de la GPU.
fr: La fonction suppose que `sobel_cupy()` est implémentée pour traiter le tableau GPU.

source: The final image retains the `RGB` format, but only the red channel is modified.
es: La imagen final conserva el formato `RGB`, pero solo se modifica el canal rojo.
fr: L'image finale conserve le format `RGB`, mais seul le canal rouge est modifié.

source: Apply the Prewitt edge detection algorithm to a grayscale image using GPU acceleration.
es: Aplica el algoritmo de detección de bordes Prewitt a una imagen en escala de grises utilizando aceleración por GPU.
fr: Applique l'algorithme de détection de contours de Prewitt à une image en niveaux de gris en utilisant l'accélération GPU.

source: This function assumes the input image is grayscale, meaning the same intensity is present in all three RGB channels. It applies the Prewitt filter using only the red channel (`R`), though the green (`G`) or blue (`B`) channels could also be used.
es: Esta función asume que la imagen de entrada está en escala de grises, lo que significa que la misma intensidad está presente en los tres canales RGB. Aplica el filtro Prewitt utilizando solo el canal rojo (`R`), aunque también se podrían usar los canales verde (`G`) o azul (`B`).
fr: Cette fonction suppose que l'image d'entrée est en niveaux de gris, ce qui signifie que la même intensité est présente dans les trois canaux RGB. Elle applique le filtre de Prewitt en utilisant uniquement le canal rouge (`R`), bien que les canaux vert (`G`) ou bleu (`B`) puissent également être utilisés.

source: If the input image is not truly grayscale, the Prewitt effect may vary slightly because the RGB channels might have different intensities.
es: Si la imagen de entrada no está realmente en escala de grises, el efecto Prewitt puede variar ligeramente porque los canales RGB podrían tener diferentes intensidades.
fr: Si l'image d'entrée n'est pas réellement en niveaux de gris, l'effet de Prewitt peut légèrement varier car les canaux RGB peuvent avoir des intensités différentes.

source: **pygame.Surface**: A new `pygame.Surface` with the Prewitt edge detection effect applied in 24-bit format.
es: **pygame.Surface**: Una nueva `pygame.Surface` con el efecto de detección de bordes Prewitt aplicado en formato de 24 bits.
fr: **pygame.Surface** : Une nouvelle `pygame.Surface` avec l'effet de détection de contours de Prewitt appliqué en format 24 bits.

source: The function assumes that `prewitt_cupy()` is implemented to process the GPU array.
es: La función asume que `prewitt_cupy()` está implementado para procesar el arreglo de la GPU.
fr: La fonction suppose que `prewitt_cupy()` est implémentée pour traiter le tableau GPU.

source: Apply the Canny edge detection algorithm to a grayscale image using GPU acceleration.
es: Aplica el algoritmo de detección de bordes Canny a una imagen en escala de grises utilizando aceleración por GPU.
fr: Applique l'algorithme de détection de contours de Canny à une image en niveaux de gris en utilisant l'accélération GPU.

source: This function assumes the input image is grayscale, meaning the same intensity is present in all three RGB channels. It applies the Canny edge detection algorithm using only the red channel (`R`), though the green (`G`) or blue (`B`) channels could also be used. If the input image is not truly grayscale, the Canny effect may vary slightly because the RGB channels might have different intensities.
es: Esta función asume que la imagen de entrada está en escala de grises, lo que significa que la misma intensidad está presente en los tres canales RGB. Aplica el algoritmo de detección de bordes Canny utilizando solo el canal rojo (`R`), aunque también se podrían usar los canales verde (`G`) o azul (`B`). Si la imagen de entrada no está realmente en escala de grises, el efecto Canny puede variar ligeramente porque los canales RGB podrían tener diferentes intensidades.
fr: Cette fonction suppose que l'image d'entrée est en niveaux de gris, ce qui signifie que la même intensité est présente dans les trois canaux RGB. Elle applique l'algorithme de détection de contours de Canny en utilisant uniquement le canal rouge (`R`), bien que les canaux vert (`G`) ou bleu (`B`) puissent également être utilisés. Si l'image d'entrée n'est pas réellement en niveaux de gris, l'effet de Canny peut légèrement varier car les canaux RGB peuvent avoir des intensités différentes.

source: **pygame.Surface**: A new `pygame.Surface` with the Canny edge detection effect applied in 24-bit format.
es: **pygame.Surface**: Una nueva `pygame.Surface` con el efecto de detección de bordes Canny aplicado en formato de 24 bits.
fr: **pygame.Surface** : Une nouvelle `pygame.Surface` avec l'effet de détection de contours de Canny appliqué en format 24 bits.

source: The function assumes that `canny_cupy()` is implemented to process the GPU array.
es: La función asume que `canny_cupy()` está implementado para procesar el arreglo de la GPU.
fr: La fonction suppose que `canny_cupy()` est implémentée pour traiter le tableau GPU.

source: Apply a color reduction effect to an image using GPU acceleration.
es: Aplica un efecto de reducción de color a una imagen utilizando aceleración por GPU.
fr: Applique un effet de réduction des couleurs à une image en utilisant l'accélération GPU.

source: This function reduces the number of unique colors in the image by quantizing each RGB channel. For example, if `color_number=8`, each channel will have 8 distinct levels (0, 32, 64, ..., 255), resulting in a total of 8^3 possible colors.
es: Esta función reduce el número de colores únicos en la imagen cuantizando cada canal RGB. Por ejemplo, si `color_number=8`, cada canal tendrá 8 niveles distintos (0, 32, 64, ..., 255), lo que resulta en un total de 8^3 colores posibles.
fr: Cette fonction réduit le nombre de couleurs uniques dans l'image en quantifiant chaque canal RGB. Par exemple, si `color_number=8`, chaque canal aura 8 niveaux distincts (0, 32, 64, ..., 255), ce qui donne un total de 8^3 couleurs possibles.

source: **surface_** (*pygame.Surface*): The input surface (image) to which the color reduction will be applied.
es: **surface_** (*pygame.Surface*): La superficie de entrada (imagen) a la que se aplicará la reducción de color.
fr: **surface_** (*pygame.Surface*): La surface d'entrée (image) sur laquelle l'effet de réduction des couleurs sera appliqué.

source: **color_number** (*int*, optional): The number of colors (levels) to reduce each RGB channel to. The default value is 8. The number of colors in the palette will be `color_number^3`.
es: **color_number** (*int*, opcional): El número de colores (niveles) a los que se reducirá cada canal RGB. El valor predeterminado es 8. El número de colores en la paleta será `color_number^3`.
fr: **color_number** (*int*, optionnel) : Le nombre de niveaux de couleur auxquels chaque canal RGB sera réduit. La valeur par défaut est 8. Le nombre total de couleurs dans la palette sera `color_number^3`.

source: **pygame.Surface**: A new surface with the color reduction effect applied, in 24-bit format.
es: **pygame.Surface**: Una nueva superficie con el efecto de reducción de color aplicado, en formato de 24 bits.
fr: **pygame.Surface** : Une nouvelle surface avec l'effet de réduction des couleurs appliqué, au format 24 bits.

source: **TypeError**: If the `surface_` argument is not a valid `pygame.Surface` instance.
es: **TypeError**: Si el argumento `surface_` no es una instancia válida de `pygame.Surface`.
fr: **TypeError** : Si l'argument `surface_` n'est pas une instance valide de `pygame.Surface`.

source: **ValueError**: If the `color_number` is less than or equal to 0 or if the surface has invalid dimensions.
es: **ValueError**: Si `color_number` es menor o igual a 0 o si la superficie tiene dimensiones no válidas.
fr: **ValueError** : Si `color_number` est inférieur ou égal à 0 ou si la surface a des dimensions invalides.

source: The function utilizes GPU acceleration for efficient processing.
es: La función utiliza aceleración por GPU para un procesamiento eficiente.
fr: La fonction utilise l'accélération GPU pour un traitement efficace.

source: The color reduction is achieved by quantizing each RGB color channel.
es: La reducción de color se logra cuantizando cada canal de color RGB.
fr: La réduction des couleurs est obtenue par quantification de chaque canal RGB.

source: The function works with 32-bit and 24-bit images (Pygame Surface format).
es: La función funciona con imágenes de 32 bits y 24 bits (formato Pygame Surface).
fr: La fonction fonctionne avec des images 32 bits et 24 bits (format Pygame Surface).

source: Apply a hue rotation effect to an image using GPU acceleration.
es: Aplica un efecto de rotación de tono a una imagen utilizando aceleración por GPU.
fr: Applique un effet de rotation de la teinte à une image en utilisant l'accélération GPU.

source: This function modifies the hue of each pixel in the image while preserving its saturation and brightness, effectively shifting colors while maintaining overall image structure.
es: Esta función modifica el tono de cada píxel en la imagen mientras preserva su saturación y brillo, cambiando efectivamente los colores mientras mantiene la estructura general de la imagen.
fr: Cette fonction modifie la teinte de chaque pixel de l'image tout en préservant sa saturation et sa luminosité, décalant ainsi les couleurs tout en conservant la structure globale de l'image.

source: **surface_** (*pygame.Surface*): The input surface (image) on which the hue rotation effect will be applied.
es: **surface_** (*pygame.Surface*): La superficie de entrada (imagen) a la que se aplicará el efecto de rotación de tono.
fr: **surface_** (*pygame.Surface*): La surface d'entrée (image) sur laquelle l'effet de rotation de la teinte sera appliqué.

source: **val_** (*float*): The hue shift value, which must be within the range [0.0, 1.0]. - `0.0` corresponds to a -180° shift (full backward rotation). - `0.5` represents 0° shift (no change). - `1.0` corresponds to a +180° shift (full forward rotation).
es: **val_** (*float*): El valor de desplazamiento de tono, que debe estar dentro del rango [0.0, 1.0]. - `0.0` corresponde a un desplazamiento de -180° (rotación completa hacia atrás). - `0.5` representa un desplazamiento de 0° (sin cambios). - `1.0` corresponde a un desplazamiento de +180° (rotación completa hacia adelante).
fr: **val_** (*float*): La valeur de décalage de la teinte, qui doit être comprise dans l'intervalle [0.0, 1.0]. - `0.0` correspond à un décalage de -180° (rotation complète vers l'arrière). - `0.5` représente un décalage de 0° (aucun changement). - `1.0` correspond à un décalage de +180° (rotation complète vers l'avant).

source: **grid_** (*tuple*): Specifies the CUDA grid dimensions for kernel execution. - Example: `(grid_y, grid_x)`, e.g., `(25, 25)`. - The grid size should be tuned according to the texture and array sizes.
es: **grid_** (*tuple*): Especifica las dimensiones de la cuadrícula CUDA para la ejecución del kernel. - Ejemplo: `(grid_y, grid_x)`, por ejemplo, `(25, 25)`. - El tamaño de la cuadrícula debe ajustarse según los tamaños de la textura y el arreglo.
fr: **grid_** (*tuple*): Spécifie les dimensions de la grille CUDA pour l'exécution du noyau. - Exemple : `(grid_y, grid_x)`, e.g., `(25, 25)`. - La taille de la grille doit être ajustée en fonction de la texture et des dimensions du tableau.

source: **block_** (*tuple*): Specifies the CUDA block dimensions for kernel execution. - Example: `(block_y, block_x)`, e.g., `(32, 32)`. - The total number of threads (`block_x * block_y`) must not exceed 1024 due to GPU hardware limitations.
es: **block_** (*tuple*): Especifica las dimensiones del bloque CUDA para la ejecución del kernel. - Ejemplo: `(block_y, block_x)`, por ejemplo, `(32, 32)`. - El número total de hilos (`block_x * block_y`) no debe exceder 1024 debido a las limitaciones del hardware de la GPU.

source: **pygame.Surface**: A new surface containing the hue-modified image, returned in 24-bit RGB format.
es: **pygame.Surface**: Una nueva superficie que contiene la imagen con el tono modificado, devuelta en formato RGB de 24 bits.

source: **TypeError**: If `surface_` is not a valid `pygame.Surface` instance.
es: **TypeError**: Si `surface_` no es una instancia válida de `pygame.Surface`.
fr: **TypeError** : Si `surface_` n'est pas une instance valide de `pygame.Surface`.

source: **ValueError**: If the input surface has zero width or height, if `val_` is out of the valid range [0.0, 1.0], or if the surface pixels cannot be referenced as a 3D array.
es: **ValueError**: Si la superficie de entrada tiene un ancho o altura de cero, si `val_` está fuera del rango válido [0.0, 1.0], o si los píxeles de la superficie no se pueden referenciar como un arreglo 3D.
fr: **ValueError** : Si la surface d'entrée a une largeur ou une hauteur nulle, si `val_` est en dehors de l'intervalle valide [0.0, 1.0], ou si les pixels de la surface ne peuvent pas être référencés sous forme de tableau 3D.

source: The input image must be in RGB format before applying this transformation.
es: La imagen de entrada debe estar en formato RGB antes de aplicar esta transformación.
fr: L'image d'entrée doit être au format RGB avant d'appliquer cette transformation.

source: The function performs hue rotation using GPU acceleration with CuPy for optimized performance.
es: La función realiza la rotación de tono utilizando aceleración por GPU con CuPy para un rendimiento optimizado.
fr: La fonction effectue une rotation de teinte en utilisant l'accélération GPU avec CuPy pour des performances optimisées.

source: The transformation works by converting RGB to HSV, modifying the H (hue) channel, and then converting it back to RGB.
es: La transformación funciona convirtiendo RGB a HSV, modificando el canal H (tono) y luego convirtiéndolo de nuevo a RGB.
fr: La transformation fonctionne en convertissant le RGB en HSV, en modifiant le canal H (teinte), puis en le reconvertissant en RGB.

source: Perform bloom downscaling by progressively reducing image resolution.
es: Realiza una reducción de resolución progresiva para el efecto bloom.
fr: Effectuer un downscaling de l'effet bloom en réduisant progressivement la résolution de l'image.
