Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Shader_gpu.po
Languages: es, fr

source: The block and grid sizes are then validated to ensure they can correctly cover the entire area. If the validation fails, assertions are raised. Afterward, the function prints the resulting grid and block sizes.
es: Los tamaños de bloque y cuadrícula se validan para asegurar que puedan cubrir correctamente toda el área. Si la validación falla, se lanzan aserciones. Posteriormente, la función imprime los tamaños de cuadrícula y bloque resultantes.
fr: Les tailles de bloc et de grille sont ensuite validées pour s'assurer qu'elles couvrent correctement toute la surface. Si la validation échoue, des assertions sont levées. Ensuite, la fonction affiche les tailles de grille et de bloc résultantes.

source: **w** (*int*): The width of the image or display (must be greater than 0).
es: **w** (*int*): El ancho de la imagen o pantalla (debe ser mayor que 0).
fr: **w** (*int*) : La largeur de l'image ou de l'affichage (doit être supérieure à 0).

source: **h** (*int*): The height of the image or display (must be greater than 0).
es: **h** (*int*): La altura de la imagen o pantalla (debe ser mayor que 0).
fr: **h** (*int*) : La hauteur de l'image ou de l'affichage (doit être supérieure à 0).

source: **AssertionError**: - If either `w` or `h` is non-positive. - If the calculated grid and block sizes do not properly cover the image.
es: **AssertionError**: - Si `w` o `h` no son positivos. - Si los tamaños de cuadrícula y bloque calculados no cubren adecuadamente la imagen.
fr: **AssertionError** : - Si `w` ou `h` est négatif ou nul. - Si les tailles calculées de grille et de bloc ne couvrent pas correctement l'image.

source: **None**: This function only prints the GPU grid and block information. It does not return any values.
es: **None**: Esta función solo imprime la información de la cuadrícula y bloque de la GPU. No devuelve ningún valor.
fr: **None** : Cette fonction affiche uniquement les informations relatives à la grille et aux blocs GPU. Elle ne retourne aucune valeur.

source: The grid is determined by the number of blocks required to cover the image's height and width.
es: La cuadrícula se determina por el número de bloques necesarios para cubrir la altura y el ancho de la imagen.
fr: La grille est déterminée par le nombre de blocs nécessaires pour couvrir la hauteur et la largeur de l'image.

source: The block size refers to the size of each individual block of threads in the GPU.
es: El tamaño del bloque se refiere al tamaño de cada bloque individual de hilos en la GPU.
fr: La taille du bloc fait référence à la taille de chaque bloc individuel de threads dans le GPU.

source: This function assumes the GPU processing will be optimized for the calculated grid and block sizes.
es: Esta función asume que el procesamiento en la GPU se optimizará para los tamaños de cuadrícula y bloque calculados.
fr: Cette fonction suppose que le traitement GPU sera optimisé pour les tailles de grille et de bloc calculées.

source: Display detailed GPU information, including memory, compute capability, and PCI bus ID.
es: Muestra información detallada de la GPU, incluyendo memoria, capacidad de cálculo y ID del bus PCI.
fr: Affiche des informations détaillées sur le GPU, y compris la mémoire, la capacité de calcul et l'identifiant du bus PCI.

source: This function retrieves and prints various details about the GPU, including: - The installed CuPy version. - The maximum grid size per block supported by the GPU. - The available and total GPU memory, both in bytes and human-readable formats. - The PCI Bus ID of the GPU. - The compute capability of the GPU.
es: Esta función recupera e imprime varios detalles sobre la GPU, incluyendo: - La versión instalada de CuPy. - El tamaño máximo de cuadrícula por bloque soportado por la GPU. - La memoria disponible y total de la GPU, tanto en bytes como en formatos legibles. - El ID del bus PCI de la GPU. - La capacidad de cálculo de la GPU.
fr: Cette fonction récupère et affiche divers détails sur le GPU, notamment : - La version de CuPy installée. - La taille maximale de grille par bloc prise en charge par le GPU. - La mémoire GPU disponible et totale, en octets et en formats lisibles par l'homme. - L'identifiant du bus PCI du GPU. - La capacité de calcul du GPU.

source: **None**: This function prints GPU-related information to the console.
es: **None**: Esta función imprime información relacionada con la GPU en la consola.
fr: **None** : Cette fonction affiche les informations relatives au GPU dans la console.

source: **Example output:**
es: **Ejemplo de salida:**
fr: **Exemple de sortie :**

source: The function relies on CuPy for GPU memory information.
es: La función depende de CuPy para la información de la memoria de la GPU.
fr: La fonction repose sur CuPy pour obtenir des informations sur la mémoire GPU.

source: The `conv` function is used to convert raw memory values into a more readable format (e.g., GB).
es: La función `conv` se utiliza para convertir valores de memoria en bruto a un formato más legible (por ejemplo, GB).
fr: La fonction `conv` est utilisée pour convertir les valeurs brutes de mémoire en un format plus lisible (par exemple, GB).

source: This function is useful for debugging and verifying GPU resource availability before launching CUDA-based operations.
es: Esta función es útil para depurar y verificar la disponibilidad de recursos de la GPU antes de lanzar operaciones basadas en CUDA.
fr: Cette fonction est utile pour le débogage et la vérification de la disponibilité des ressources GPU avant de lancer des opérations basées sur CUDA.

source: Perform GPU-accelerated color inversion on a Pygame surface (returns a copy).
es: Realiza la inversión de color acelerada por GPU en una superficie de Pygame (devuelve una copia).
fr: Effectue une inversion des couleurs accélérée par GPU sur une surface Pygame (retourne une copie).

source: This function transfers the image data from a `pygame.Surface` to the GPU, inverts the color values using CuPy, and then reconstructs a new surface with the modified pixel data.
es: Esta función transfiere los datos de la imagen de una `pygame.Surface` a la GPU, invierte los valores de color utilizando CuPy y luego reconstruye una nueva superficie con los datos de píxeles modificados.
fr: Cette fonction transfère les données d'image d'un `pygame.Surface` vers le GPU, inverse les valeurs de couleur à l'aide de CuPy, puis reconstruit une nouvelle surface avec les pixels modifiés.

source: **surface_** (*pygame.Surface*): A Pygame surface object (24-bit or 32-bit) containing the image to be inverted.
es: **surface_** (*pygame.Surface*): Un objeto de superficie de Pygame (24-bit o 32-bit) que contiene la imagen a invertir.
fr: **surface_** (*pygame.Surface*) : Un objet Pygame Surface (24 bits ou 32 bits) contenant l'image à inverser.

source: **pygame.Surface**: A new Pygame surface with inverted colors, preserving the original format (BGR or BGRA).
es: **pygame.Surface**: Una nueva superficie de Pygame con colores invertidos, conservando el formato original (BGR o BGRA).
fr: **pygame.Surface** : Une nouvelle surface Pygame avec les couleurs inversées, conservant le format original (BGR ou BGRA).

source: **ValueError**: If the surface cannot be referenced as a 1D buffer or has zero length.
es: **ValueError**: Si la superficie no puede ser referenciada como un búfer 1D o tiene longitud cero.
fr: **ValueError** : Si la surface ne peut pas être référencée comme un tampon 1D ou a une longueur nulle.

source: **TypeError**: If `surface_` is not a `pygame.Surface` object.
es: **TypeError**: Si `surface_` no es un objeto `pygame.Surface`.
fr: **TypeError** : Si `surface_` n'est pas un objet `pygame.Surface`.

source: Uses CuPy to perform the inversion directly on the GPU for optimal performance.
es: Utiliza CuPy para realizar la inversión directamente en la GPU para un rendimiento óptimo.
fr: Utilise CuPy pour effectuer l'inversion directement sur le GPU afin d'optimiser les performances.

source: Automatically detects whether the surface is 24-bit (BGR) or 32-bit (BGRA).
es: Detecta automáticamente si la superficie es de 24 bits (BGR) o de 32 bits (BGRA).
fr: Détecte automatiquement si la surface est en 24 bits (BGR) ou 32 bits (BGRA).

source: Synchronizes the GPU to ensure completion before returning the processed image.
es: Sincroniza la GPU para asegurar la finalización antes de devolver la imagen procesada.
fr: Synchronise le GPU pour garantir la fin du traitement avant de retourner l'image modifiée.

source: Perform in-place GPU-accelerated color inversion on a Pygame surface.
es: Realiza la inversión de color acelerada por GPU en una superficie de Pygame in situ.
fr: Effectuer une inversion des couleurs en place accélérée par GPU sur une surface Pygame.

source: This function directly modifies the pixel data of the given `pygame.Surface` by inverting its color values using GPU processing via CuPy. The inversion is performed in-place, meaning the original surface is altered without creating a new one.
es: Esta función modifica directamente los datos de píxeles de la `pygame.Surface` dada invirtiendo sus valores de color utilizando procesamiento en la GPU a través de CuPy. La inversión se realiza in situ, lo que significa que la superficie original se altera sin crear una nueva.
fr: Cette fonction modifie directement les données des pixels de la `pygame.Surface` donnée en inversant ses valeurs de couleur via un traitement GPU avec CuPy. L'inversion est effectuée en place, ce qui signifie que la surface d'origine est modifiée sans en créer une nouvelle.

source: **surface_** (*pygame.Surface*): The Pygame surface whose pixel colors will be inverted. Must be a valid 24-bit (BGR) or 32-bit (BGRA) surface.
es: **surface_** (*pygame.Surface*): La superficie de Pygame cuyos colores de píxeles se invertirán. Debe ser una superficie válida de 24 bits (BGR) o 32 bits (BGRA).
fr: **surface_** (*pygame.Surface*) : La surface Pygame dont les couleurs des pixels seront inversées. Doit être une surface valide en 24 bits (BGR) ou en 32 bits (BGRA).

source: **ValueError**: If the surface buffer cannot be accessed or has zero length.
es: **ValueError**: Si el búfer de la superficie no se puede acceder o tiene longitud cero.
fr: **ValueError** : Si le tampon de la surface ne peut pas être accédé ou a une longueur nulle.

source: The function transfers the pixel data to the GPU, performs the inversion, and copies the modified pixels back to the original surface.
es: La función transfiere los datos de píxeles a la GPU, realiza la inversión y copia los píxeles modificados de vuelta a la superficie original.
fr: La fonction transfère les données des pixels vers le GPU, effectue l'inversion, puis copie les pixels modifiés dans la surface d'origine.

source: Uses CuPy for efficient GPU computation.
es: Utiliza CuPy para un cálculo eficiente en la GPU.
fr: Utilise CuPy pour un calcul efficace sur GPU.

source: Perform in-place inversion of a BGR pixel buffer using the GPU.
es: Realiza la inversión in situ de un búfer de píxeles BGR utilizando la GPU.
fr: Effectuer une inversion en place d'un tampon de pixels BGR à l'aide du GPU.

source: This function takes a contiguous 1D BGR buffer (as a NumPy array or memoryview), transfers it to the GPU, inverts the pixel values (255 - pixel value), and writes the result back into the original buffer.
es: Esta función toma un búfer BGR 1D contiguo (como un array de NumPy o memoryview), lo transfiere a la GPU, invierte los valores de píxeles (255 - valor de píxel) y escribe el resultado de vuelta en el búfer original.
fr: Cette fonction prend un tampon BGR contigu 1D (sous forme de tableau NumPy ou de memoryview), le transfère vers le GPU, inverse les valeurs des pixels (255 - valeur du pixel), puis réécrit le résultat dans le tampon d'origine.

source: **bgr_array** (*numpy.ndarray* or *memoryview*): A contiguous 1D array representing the BGR pixel buffer. The buffer must be mutable and non-empty.
es: **bgr_array** (*numpy.ndarray* o *memoryview*): Un array 1D contiguo que representa el búfer de píxeles BGR. El búfer debe ser mutable y no estar vacío.
fr: **bgr_array** (*numpy.ndarray* ou *memoryview*) : Un tableau 1D contigu représentant le tampon de pixels BGR. Le tampon doit être modifiable et non vide.

source: **TypeError**: If `bgr_array` is not a NumPy array or a memoryview.
es: **TypeError**: Si `bgr_array` no es un array de NumPy o un memoryview.
fr: **TypeError** : Si `bgr_array` n'est pas un tableau NumPy ou un memoryview.

source: **ValueError**: If `bgr_array` is empty (has zero length).
es: **ValueError**: Si `bgr_array` está vacío (tiene longitud cero).
fr: **ValueError** : Si `bgr_array` est vide (longueur nulle).

source: This function modifies `bgr_array` in place.
es: Esta función modifica `bgr_array` in situ.
fr: Cette fonction modifie `bgr_array` en place.

source: Uses CUDA-enabled CuPy for GPU acceleration.
es: Utiliza CuPy habilitado para CUDA para la aceleración por GPU.
fr: Utilise CuPy avec prise en charge CUDA pour l'accélération GPU.

source: Suitable for high-performance image processing where in-place modification is necessary.
es: Adecuado para el procesamiento de imágenes de alto rendimiento donde es necesaria la modificación in situ.
fr: Convient au traitement d'images haute performance nécessitant une modification en place.

source: Inverts the RGB values of an image (3D numpy array or memoryview) in place using GPU.
es: Invierte los valores RGB de una imagen (array 3D de NumPy o memoryview) in situ utilizando la GPU.
fr: Inverse les valeurs RGB d'une image (tableau NumPy 3D ou memoryview) en place à l'aide du GPU.

source: This function performs an in-place inversion of the RGB channels in the input array. It operates on the assumption that the input `rgb_array` is a 3D numpy array or memoryview with shape (height, width, 3), where the last dimension represents the RGB color channels.
es: Esta función realiza una inversión in situ de los canales RGB en el array de entrada. Opera bajo la suposición de que el `rgb_array` de entrada es un array 3D de NumPy o un memoryview con forma (altura, ancho, 3), donde la última dimensión representa los canales de color RGB.
fr: Cette fonction effectue une inversion en place des canaux RGB dans le tableau d'entrée. Elle suppose que `rgb_array` est un tableau NumPy 3D ou un memoryview avec la forme (hauteur, largeur, 3), où la dernière dimension représente les canaux de couleur RGB.

source: **Note**: This operation is performed using GPU to speed up the computation.
es: **Nota**: Esta operación se realiza utilizando la GPU para acelerar el cálculo.
fr: **Remarque** : Cette opération est effectuée sur GPU pour accélérer le calcul.

source: **rgb_array** (*numpy.ndarray* or *memoryview*): A 3D array or memoryview of shape (height, width, 3) containing the RGB values of the image. The dtype must be *numpy.uint8*. If `rgb_array` is a memoryview, it should be of a compatible type.
es: **rgb_array** (*numpy.ndarray* o *memoryview*): Un array 3D o memoryview con forma (altura, ancho, 3) que contiene los valores RGB de la imagen. El dtype debe ser *numpy.uint8*. Si `rgb_array` es un memoryview, debe ser de un tipo compatible.
fr: **rgb_array** (*numpy.ndarray* ou *memoryview*) : Un tableau 3D ou un memoryview de forme (hauteur, largeur, 3) contenant les valeurs RGB de l'image. Le dtype doit être *numpy.uint8*. Si `rgb_array` est un memoryview, il doit être d'un type compatible.

source: **TypeError**: If `rgb_array` is not a *numpy.ndarray* or *memoryview*.
es: **TypeError**: Si `rgb_array` no es un *numpy.ndarray* o *memoryview*.
fr: **TypeError** : Si `rgb_array` n'est pas un *numpy.ndarray* ou *memoryview*.

source: **ValueError**: If the `rgb_array` is not of dtype *numpy.uint8* or does not have 3 dimensions. If the width or height of the array is zero.
es: **ValueError**: Si el `rgb_array` no es de tipo *numpy.uint8* o no tiene 3 dimensiones. Si el ancho o la altura del array es cero.
fr: **ValueError** : Si `rgb_array` n'est pas du dtype *numpy.uint8* ou n'a pas 3 dimensions. Si la largeur ou la hauteur du tableau est nulle.

source: **Description:**
es: **Descripción:**

source: This function directly modifies the input `rgb_array` by inverting the RGB channels using GPU-accelerated operations. The inversion is done in place, meaning the original array will be updated. The GPU is used to perform the inversion efficiently.
es: Esta función modifica directamente el arreglo de entrada `rgb_array` invirtiendo los canales RGB utilizando operaciones aceleradas por GPU. La inversión se realiza in situ, lo que significa que el arreglo original será actualizado. La GPU se utiliza para realizar la inversión de manera eficiente.
fr: Cette fonction modifie directement le tableau d'entrée `rgb_array` en inversant les canaux RGB à l'aide d'opérations accélérées par GPU. L'inversion se fait en place, ce qui signifie que le tableau d'origine sera mis à jour. Le GPU est utilisé pour effectuer l'inversion de manière efficace.

source: Apply a Sepia shader to a Pygame surface and return a new surface with the Sepia effect applied.
es: Aplica un sombreador Sepia a una superficie de Pygame y devuelve una nueva superficie con el efecto Sepia aplicado.
fr: Applique un shader Sepia à une surface Pygame et retourne une nouvelle surface avec l'effet Sepia appliqué.

source: This function works with Pygame surfaces of both 32-bit and 24-bit color depth. It uses GPU-based computations to transform the pixel colors by applying a Sepia filter.
es: Esta función funciona con superficies de Pygame de profundidad de color de 32 bits y 24 bits. Utiliza cálculos basados en GPU para transformar los colores de los píxeles aplicando un filtro Sepia.
fr: Cette fonction fonctionne avec des surfaces Pygame de profondeur de couleur 32 bits et 24 bits. Elle utilise des calculs basés sur le GPU pour transformer les couleurs des pixels en appliquant un filtre Sepia.

source: The function first checks the type of the provided surface to ensure it's a valid Pygame Surface. Then it extracts the pixel data from the surface, applies the Sepia filter using a GPU-based kernel, and returns a new Pygame surface with the transformed image.
es: La función primero verifica el tipo de la superficie proporcionada para asegurarse de que sea una superficie válida de Pygame. Luego extrae los datos de píxeles de la superficie, aplica el filtro Sepia utilizando un kernel basado en GPU y devuelve una nueva superficie de Pygame con la imagen transformada.
fr: La fonction vérifie d'abord le type de la surface fournie pour s'assurer qu'il s'agit d'une surface Pygame valide. Ensuite, elle extrait les données des pixels de la surface, applique le filtre Sepia en utilisant un noyau basé sur le GPU, puis retourne une nouvelle surface Pygame avec l'image transformée.

source: **surface_** (*pygame.Surface*): A Pygame Surface object containing the image to which the Sepia filter will be applied. The surface is expected to be in 32-bit or 24-bit format.
es: **surface_** (*pygame.Surface*): Un objeto Pygame Surface que contiene la imagen a la que se aplicará el filtro Sepia. Se espera que la superficie esté en formato de 32 bits o 24 bits.
fr: **surface_** (*pygame.Surface*) : Un objet Surface Pygame contenant l'image à laquelle le filtre Sepia sera appliqué. La surface doit être en format 32 bits ou 24 bits.

source: **pygame.Surface**: A new Pygame Surface object with the same dimensions and the Sepia filter applied, in the "RGB" format.
es: **pygame.Surface**: Un nuevo objeto Pygame Surface con las mismas dimensiones y el filtro Sepia aplicado, en formato "RGB".
fr: **pygame.Surface** : Un nouvel objet Surface Pygame avec les mêmes dimensions et le filtre Sepia appliqué, au format "RGB".

source: The function utilizes GPU acceleration to apply the Sepia effect efficiently.
es: La función utiliza aceleración por GPU para aplicar el efecto Sepia de manera eficiente.
fr: La fonction utilise l'accélération GPU pour appliquer l'effet Sepia de manière efficace.

source: The input surface is not modified; a new surface with the Sepia effect is returned.
es: La superficie de entrada no se modifica; se devuelve una nueva superficie con el efecto Sepia aplicado.
fr: La surface d'entrée n'est pas modifiée ; une nouvelle surface avec l'effet Sepia est retournée.

source: Ensure that the Pygame surface is in a compatible format (24-bit or 32-bit) before applying the filter.
es: Asegúrese de que la superficie de Pygame esté en un formato compatible (24 bits o 32 bits) antes de aplicar el filtro.
fr: Assurez-vous que la surface Pygame soit dans un format compatible (24 bits ou 32 bits) avant d'appliquer le filtre.

source: Apply a Sepia filter in-place to an RGB image array using GPU acceleration.
es: Aplica un filtro Sepia in situ a un arreglo de imagen RGB utilizando aceleración por GPU.
fr: Applique un filtre Sepia en place à un tableau d'image RGB en utilisant l'accélération GPU.

source: This function processes a 32-bit or 24-bit image in-place by modifying the provided `numpy.ndarray` of shape (w, h, 3) containing uint8 RGB values. The Sepia effect is applied directly to the input array without creating a new array.
es: Esta función procesa una imagen de 32 bits o 24 bits in situ modificando el arreglo `numpy.ndarray` proporcionado de forma (w, h, 3) que contiene valores RGB de tipo uint8. El efecto Sepia se aplica directamente al arreglo de entrada sin crear un nuevo arreglo.
fr: Cette fonction traite une image 32 bits ou 24 bits en place en modifiant le `numpy.ndarray` fourni de forme (w, h, 3) contenant les valeurs RGB en uint8. L'effet Sepia est appliqué directement au tableau d'entrée sans créer un nouveau tableau.

source: **rgb_array** (*numpy.ndarray*): A 3D numpy array with shape (w, h, 3), representing an image with RGB pixel values in the uint8 data type. The shape should represent the width (w), height (h), and three channels (Red, Green, Blue).
es: **rgb_array** (*numpy.ndarray*): Un arreglo numpy 3D con forma (w, h, 3), que representa una imagen con valores de píxeles RGB en el tipo de datos uint8. La forma debe representar el ancho (w), la altura (h) y los tres canales (Rojo, Verde, Azul).
fr: **rgb_array** (*numpy.ndarray*) : Un tableau 3D numpy de forme (w, h, 3), représentant une image avec des valeurs de pixels RGB en type de données uint8. La forme doit représenter la largeur (w), la hauteur (h), et les trois canaux (Rouge, Vert, Bleu).

source: **None**: This function modifies the input `rgb_array` in-place and returns nothing.
es: **None**: Esta función modifica el arreglo de entrada `rgb_array` in situ y no devuelve nada.
fr: **None** : Cette fonction modifie `rgb_array` en place et ne retourne rien.

source: The input array is modified directly; no new array is created.
es: El arreglo de entrada se modifica directamente; no se crea un nuevo arreglo.
fr: Le tableau d'entrée est modifié directement ; aucun nouveau tableau n'est créé.

source: Ensure that the input array is of dtype `numpy.uint8` and has three dimensions representing the RGB channels.
es: Asegúrese de que el arreglo de entrada sea de tipo `numpy.uint8` y tenga tres dimensiones que representen los canales RGB.
fr: Assurez-vous que le tableau d'entrée soit du dtype `numpy.uint8` et ait trois dimensions représentant les canaux RGB.

source: Apply a Sepia filter to a BGR or BGRA image buffer on the GPU (in-place).
es: Aplica un filtro Sepia a un búfer de imagen BGR o BGRA en la GPU (in situ).
fr: Applique un filtre Sepia à un tampon d'image BGR ou BGRA sur le GPU (en place).
