Repository: yoyoberenguer/yoyoberenguer.github.io
Catalog: docs/locale/*/LC_MESSAGES/Sprites.po
Languages: fr

source: 1. Sprite and Group Management
fr: 1. Gestion des Sprites et des Groupes

source: This library provides an efficient Cython implementation of **sprite management, collision detection, and rendering** similar to `pygame.sprite`, but optimized for performance. This functionality already exists in the **Pygame project**, but has been **Cythonized** to significantly improve performance by using C-level optimizations for common operations. It includes:
fr: Cette bibliothèque fournit une implémentation Cython efficace de la **gestion des sprites, de la détection de collisions et du rendu**, similaire à`pygame.sprite`, mais optimisée pour la performance. Cette fonctionnalité existe déjà dans le **projet Pygame**, mais a été **Cythonisée** pour améliorer considérablement les performances en utilisant des optimisations au niveau C pour les opérations courantes. Elle comprend :

source: **Sprite Objects** (`Sprite` class)
fr: **Objets Sprite** (classe `Sprite`)

source: **Group Handling** (`AbstractGroup`, `GroupSingle`, `LayeredUpdates`)
fr: **Gestion des Groupes** (`AbstractGroup`, `GroupSingle`, `LayeredUpdates`)

source: **Collision Detection** (`collide_rect`, `collide_circle`, `collide_mask`)
fr: **Détection de Collisions** (`collide_rect`, `collide_circle`, `collide_mask`)

source: **Layered Sprite Management** (`LayeredUpdates`, `LayeredUpdatesModified`)
fr: **Gestion des Sprites en Couches** (`LayeredUpdates`, `LayeredUpdatesModified`)

source: 2. Purpose
fr: 2. Objectif

source: This module enhances **Pygame's sprite system** by providing: - Faster **group operations** with optimized internal structures. - Efficient **collision detection** using various methods (rectangles, circles, masks). - Advanced **layer-based rendering** for handling depth ordering. - Support for **single-object sprite groups** (e.g., `GroupSingle`). - **In-place updates** to minimize memory allocations.
fr: Ce module améliore le **système de sprites de Pygame** en offrant : - Des **opérations sur les groupes plus rapides** grâce à des structures internes optimisées. - Une **détection de collisions efficace** utilisant diverses méthodes (rectangles, cercles, masques). - Un **rendu basé sur les couches avancé** pour gérer l'ordre de profondeur. - Un support pour les **groupes de sprites à objet unique** (par exemple, `GroupSingle`). - **Mises à jour en place** pour minimiser les allocations mémoire.

source: The core functionality is inspired by the **Pygame sprite module** but is **Cythonized** for better performance. It takes advantage of Cython's ability to compile code into C to achieve faster execution and reduced memory usage, making it suitable for performance-critical games.
fr: La fonctionnalité principale est inspirée du **module sprite de Pygame**, mais a été **Cythonisée** pour de meilleures performances. Elle profite de la capacité de Cython à compiler le code en C pour obtenir une exécution plus rapide et une réduction de l'utilisation mémoire, ce qui la rend adaptée aux jeux nécessitant des performances élevées.

source: 3. Sprite Class
fr: 3. Classe Sprite

source: **`Sprite`** represents an individual game object that can belong to multiple groups.
fr: **`Sprite`** représente un objet de jeu individuel qui peut appartenir à plusieurs groupes.

source: **Methods** - `add_internal(group)`: Adds the sprite to a group. - `remove_internal(group)`: Removes the sprite from a group. - `update(args=*)`: Updates the sprite state. - `kill()`: Removes the sprite from all groups. - `groups() -> list`: Returns all groups containing this sprite. - `alive() -> bool`: Checks if the sprite is still in any group.
fr: **Méthodes** - `add_internal(group)`: Ajoute le sprite à un groupe. - `remove_internal(group)`: Retire le sprite d'un groupe. - `update(args=*)`: Met à jour l'état du sprite. - `kill()`: Retire le sprite de tous les groupes. - `groups() -> list`: Renvoie tous les groupes contenant ce sprite. - `alive() -> bool`: Vérifie si le sprite est toujours dans un groupe.

source: **`AbstractGroup`** is the base class for managing sprite groups.
fr: **`AbstractGroup`** est la classe de base pour la gestion des groupes de sprites.

source: **Attributes** - `_spritegroup (bool)`: Indicates whether this is a sprite group. - `spritedict (dict)`: Stores sprites and their data. - `lostsprites (list)`: Tracks removed sprites.
fr: **Attributs** - `_spritegroup (bool)`: Indique s'il s'agit d'un groupement de sprites. - `spritedict (dict)`: Stocke les sprites et leurs données. - `lostsprites (list)`: Suit les sprites supprimés.

source: **Methods** - `sprites() -> list`: Returns a list of all sprites in the group. - `add_internal(sprite)`: Adds a sprite to the group. - `remove_internal(sprite)`: Removes a sprite from the group. - `has_internal(sprite) -> bool`: Checks if a sprite is in the group. - `copy()`: Creates a copy of the group. - `update(args=*)`: Calls the `update()` method on all sprites. - `draw(surface)`: Draws all sprites onto the given surface. - `clear(surface, bgd)`: Clears the group from the screen. - `empty()`: Removes all sprites from the group.
fr: **Méthodes** - `sprites() -> list`: Renvoie une liste de tous les sprites du groupement. - `add_internal(sprite)`: Ajoute un sprite au groupe. - `remove_internal(sprite)`: Retire un sprite du groupe. - `has_internal(sprite) -> bool`: Vérifie si un sprite est dans le groupe. - `copy()`: Crée une copie du groupe. - `update(args=*)`: Appelle la méthode `update()` pour tous les sprites. - `draw(surface)`: Dessine tous les sprites sur la surface donnée. - `clear(surface, bgd)`: Efface le groupe de l'écran. - `empty()`: Retire tous les sprites du groupe.

source: **`GroupSingle`** is a specialized group that holds only a **single sprite**.
fr: **`GroupSingle`** est un groupe spécialisé qui contient uniquement un **seul sprite**.

source: **Methods** - `sprites() -> list`: Returns a list containing the single sprite. - `add_internal(sprite)`: Sets the sprite for this group. - `remove_internal(sprite)`: Removes the sprite. - `has_internal(sprite) -> bool`: Checks if a sprite exists in the group.
fr: **Méthodes** - `sprites() -> list`: Renvoie une liste contenant le sprite unique. - `add_internal(sprite)`: Définit le sprite pour ce groupe. - `remove_internal(sprite)`: Retire le sprite. - `has_internal(sprite) -> bool`: Vérifie si un sprite existe dans le groupe.

source: **Collision Detection**
fr: **Détection de Collisions**

source: **Collision functions** allow efficient detection between sprites and groups.
fr: Les **fonctions de collision** permettent une détection efficace entre les sprites et les groupes.

source: `collide_rect(left, right)`: Rectangular collision detection.
fr: `collide_rect(left, right)`: Détection de collisions rectangulaires.

source: `collide_circle(left, right)`: Circular collision detection.
fr: `collide_circle(left, right)`: Détection de collisions circulaires.

source: `collide_mask(left, right)`: Pixel-perfect collision detection.
fr: `collide_mask(left, right)`: Détection de collisions au niveau des pixels.

source: `groupcollide(groupa, groupb, dokilla, dokillb, collided=*) -> dict`: - Checks collisions between two groups, optionally removing colliding sprites.
fr: `groupcollide(groupa, groupb, dokilla, dokillb, collided=*) -> dict`: - Vérifie les collisions entre deux groupes, supprimant éventuellement les sprites en collision.

source: `spritecollideany(sprite, group, collided=*)`: - Checks if a sprite collides with any sprite in a group.
fr: `spritecollideany(sprite, group, collided=*)`: - Vérifie si un sprite entre en collision avec un sprite dans un groupe.

source: `spritecollide(sprite, group, dokill, collided=*) -> list`: - Returns a list of sprites that collide with `sprite`.
fr: `spritecollide(sprite, group, dokill, collided=*) -> list`: - Renvoie une liste des sprites qui entrent en collision avec `sprite`.

source: **Layered Sprite Management**
fr: **Gestion des Sprites en Couches**

source: **`LayeredUpdates`** extends `AbstractGroup` to support **layer-based rendering**.
fr: **`LayeredUpdates`** étend `AbstractGroup` pour prendre en charge le **rendu basé sur les couches**.

source: **Attributes**
fr: **Attributs**

source: `_spritelayers (dict)`: Stores sprite-layer mappings.
fr: `_spritelayers (dict)`: Stocke les correspondances entre les sprites et les couches.

source: `_spritelist (list)`: Ordered list of sprites.
fr: `_spritelist (list)`: Liste ordonnée des sprites.

source: `_default_layer (int)`: Default layer for new sprites.
fr: `_default_layer (int)`: Couche par défaut pour les nouveaux sprites.

source: **Methods**
fr: **Méthodes**

source: `add_internal(sprite, layer=*)`: Adds a sprite to a specified layer.
fr: `add_internal(sprite, layer=*)`: Ajoute un sprite à une couche spécifiée.

source: `remove_internal(sprite)`: Removes a sprite.
fr: `remove_internal(sprite)`: Retire un sprite.

source: `sprites() -> list`: Returns all sprites.
fr: `sprites() -> list`: Renvoie tous les sprites.

source: `get_sprites_at(pos)`: Retrieves sprites at a given position.
fr: `get_sprites_at(pos)`: Récupère les sprites à une position donnée.

source: `get_sprite(idx)`: Returns a sprite by index.
fr: `get_sprite(idx)`: Renvoie un sprite par index.

source: `remove_sprites_of_layer(layer)`: Removes all sprites from a specific layer.
fr: `remove_sprites_of_layer(layer)`: Retire tous les sprites d'une couche spécifique.

source: `layers()`: Returns a list of all layers.
fr: `layers()`: Renvoie une liste de toutes les couches.

source: `change_layer(sprite, new_layer)`: Moves a sprite to a new layer.
fr: `change_layer(sprite, new_layer)`: Déplace un sprite vers une nouvelle couche.

source: `get_layer_of_sprite(sprite)`: Returns the layer of a given sprite.
fr: `get_layer_of_sprite(sprite)`: Renvoie la couche d'un sprite donné.

source: `get_top_layer() / get_bottom_layer()`: Returns the highest or lowest layer.
fr: `get_top_layer() / get_bottom_layer()`: Renvoie la couche la plus haute ou la plus basse.

source: `move_to_front(sprite) / move_to_back(sprite)`: Changes sprite depth ordering.
fr: `move_to_front(sprite) / move_to_back(sprite)`: Modifie l'ordre de profondeur du sprite.

source: `get_top_sprite()`: Retrieves the topmost sprite.
fr: `get_top_sprite()`: Récupère le sprite le plus haut.

source: `get_sprites_from_layer(layer)`: Returns all sprites in a given layer.
fr: `get_sprites_from_layer(layer)`: Renvoie tous les sprites d'une couche donnée.

source: `switch_layer(layer1, layer2)`: Swaps two layers.
fr: `switch_layer(layer1, layer2)`: Échange deux couches.

source: **LayeredUpdatesModified**
fr: **LayeredUpdatesModifié**

source: Extends `LayeredUpdates` with additional drawing and update functionality.
fr: Étend `LayeredUpdates` avec des fonctionnalités supplémentaires de dessin et de mise à jour.

source: `update(args=*)`: Updates all sprites.
fr: `update(args=*)`: Met à jour tous les sprites.

source: `draw(surface)`: Draws sprites onto a surface.
fr: `draw(surface)`: Dessine les sprites sur une surface.

source: **Helper Functions**
fr: **Fonctions d'Aide**

source: `int_min(a, b) -> int`: Returns the smaller of two integers.
fr: `int_min(a, b) -> int`: Renvoie le plus petit des deux entiers.

source: `truth(a) -> bool`: Converts a value to boolean.
fr: `truth(a) -> bool`: Convertit une valeur en booléen.

source: 4. Summary
fr: 4. Résumé

source: This library optimizes **sprite handling** in Pygame by: - **Enhancing performance** with Cython memoryviews. - **Supporting efficient collision detection** (rect, circle, mask). - **Managing layered rendering** with advanced depth ordering. - **Providing various group structures** (standard, single, layered).
fr: Cette bibliothèque optimise la **gestion des sprites** dans Pygame en : - **Améliorant les performances** avec les vues mémoire Cython. - **Supportant la détection de collisions efficace** (rect, cercle, masque). - **Gérant le rendu par couches** avec un ordre de profondeur avancé. - **Fournissant diverses structures de groupes** (standard, unique, en couches).

source: Although this functionality is available in the **Pygame project**, this library has been **Cythonized** to provide **significant performance improvements**, making it ideal for **performance-critical games**.
fr: Bien que cette fonctionnalité soit disponible dans le **projet Pygame**, cette bibliothèque a été **Cythonisée** pour offrir des **améliorations de performance significatives**, ce qui la rend idéale pour les **jeux nécessitant des performances élevées**.

source: **Ideal for Pygame developers needing fast and efficient sprite management.** 🚀
fr: **Idéale pour les développeurs Pygame ayant besoin d'une gestion rapide et efficace des sprites.** 🚀
